[{"title":"【内推】无需日语、可远程！加入日本自动驾驶新星 RoboTruck，定义物流未来","date":"2026-01-08T09:00:00.000Z","path":"2026/01/08/robotruck-ref/","text":"【内推】无需日语、可远程！加入日本自动驾驶独角兽候补，定义物流未来 想在日本科技圈工作，却担心日语障碍？身怀自动驾驶绝技，渴望参与从0到1的 L4 级落地？ 株式会社ロボトラック RoboTruck 正在寻找志同道合的技术伙伴。我们刚刚完成 Pre-Series A 轮融资（16.5 亿日元），正处于业务爆发期。如果你希望用代码解决日本“物流危机”，这绝对是你不能错过的舞台。 🚀 关于 RoboTruck我们是一家致力于通过自动驾驶卡车的研究开发与商业化，创造物流未来的科技公司。我们的核心使命是利用 L4 级自动驾驶技术，解决日本日益严重的司机短缺和社会基础设施痛点。 🌟 为什么选择这里？ 资本青睐： 累计融资 16.5 亿日元，背靠 JIC（产业革新投资机构）系基金、SMBC 风险投资等顶级机构，资金充足。 准独角兽潜力： 处于极具爆发力的 Pre-Series A 阶段，现在加入是获取期权的最佳时机。 薪资竞争力： 提供市场上具有竞争力的 Offer（包括对比中国市场薪资）。 技术硬核： 专注于感知算法、整车线控改装到实车测试的全栈研发。 国际化团队： 团队成员背景多元，研发氛围浓厚。 🔥 重点推荐：核心研发岗 (无需日语 / 可远程)针对算法工程师，我们提供极度灵活的工作环境： ✅ 语言友好： 工作语言主要为中文/英语。 ✅ 远程办公： 研发岗支持 Remote 模式，以结果为导向。 💻 1. Algorithm Engineer / Perception General (感知算法工程师) 【核心岗位】做自动驾驶卡车的“眼睛” 职责： 负责多传感器（Camera, LiDAR, Radar）融合的目标检测及 Online Mapping 算法研发。 利用海量实车数据及仿真数据，验证并优化算法性能，解决 Highway 等复杂场景下的感知难题。 构建高效的训练 Pipeline 及数据管理框架。 要求： 语言： 能够使用中文或英语沟通。 技术： 精通 Python/C++ 及 PyTorch 等深度学习框架。 经验： 在 CV、Deep Learning 或机器感知领域有扎实基础及实战经验。 加分项： 顶级会议发表论文、CUDA 编程经验、ROS/ROS2 开发经验。 🛠️ 现场研发与工程岗 (需日语基础 / 日本现场)此类岗位需在东京总部或车库现场工作，要求具备一定的日语沟通能力，但团队国际化程度高，内部沟通顺畅。 🔌 2. Hardware Engineer (硬件工程师) 职责： 负责自动驾驶系统的电路设计、线束设计、传感器选型及硬件集成测试。 要求： 具备电路知识及线束设计经验。 具备日语沟通能力（同时欢迎不排斥使用翻译工具与中/英文团队沟通者）。 加分： Linux 使用经验、车辆改造经验。 🚛 3. AD Truck Refit Lead (自动驾驶卡车架装责任者) 职责： Lead 角色： 统括大型卡车的线控改装、传感器集成、计算平台部署。 法规对应： 确保车辆改装符合日本道路交通法规及安全标准。 实验室建设： 主导实验环境及测试设备的搭建。 要求： 商用车/大型卡车改装或开发经验 3 年以上。 精通车辆电气架构、CAN/LIN 总线。 语言： 日语可沟通（英语/中文词汇量丰富者优先）。 🧪 4. AD Field Test Engineer (自动驾驶测试工程师) 职责： 制定测试计划，执行实车测试，采集数据并分析故障模式（Boundary Condition）。 要求： 具备良好的日语沟通能力。 熟练使用 Office 软件，具备数据整理分析能力。 加分： 商务水平中文能力、Linux 环境经验。 🚚 5. Test Driver (测试驾驶员) 职责： 负责自动驾驶卡车的测试运行、数据收集及长距离干线运输测试。 要求： 持有大型自动车免许，有测试驾驶或数据分析经验者优先。 💼 职能与业务管理岗 (需流利日语 / 商务精英)作为准独角兽企业的核心成员，你将参与到从0到1的组织建设与商业落地中。 📈 6. PM (Project Manager) - 项目经理 背景： 作为第1位专职PM，直接向 CEO 汇报。 职责： 统筹国及政府项目，管理许认可申请，协调政府、车厂、物流公司等多方利益相关者。 要求： 汽车行业技术背景 3 年以上（ADAS经验优先），具备卓越的多方协调与项目管理能力。 🤝 7. Business Development (事业开发 / BD) 背景： 这是一个新设岗位，未来有望成为 BD 团队负责人。 职责： 深入挖掘物流客户痛点，制定并执行市场拓展战略，推动 L4 技术的商业化落地。 要求： 物流行业战略/企划经验，或咨询公司 SCM/物流领域经验。 🏢 8. Corporate 管理部长候选 职责： 统管经营管理、财务（决算/预算/国际税务）、法务及组织架构搭建。 要求： 具备扎实的管理部门实务经验（KPI管理、连结会计等），有“动手解决问题”的能力。 💰 薪资与福利 年收： 提供具有市场竞争力的薪资（对标中国及全球市场）。 激励： 提供 Stock Option（股票期权），共享公司成长红利。 地点： 东京都中央区（东京总部）/ 研发岗可协商远程。 制度： 裁量劳动制，周末双休，各类社保完备。 📩 如何内推 (How to Apply)机会难得，简历直达 Hiring Manager！ 如果你对以上职位感兴趣，请将简历发送至我的邮箱 yvonshong@gmail.com （研发岗建议提供英文或中文简历，职能岗请提供日文简历） 投递邮箱： yvonshong@gmail.com* 邮件标题格式： 姓名 - 申请职位 - 内推 附件： PDF 格式简历 💡 特别提示： RoboTruck 正处于高速成长期，我们不仅在寻找员工，更是在寻找能够一起定义行业标准的合作伙伴。如果你渴望挑战，渴望改变世界，欢迎加入我们！","tags":[{"name":"autopilot","slug":"autopilot","permalink":"http://www.yvonshong.com/tags/autopilot/"}]},{"title":"All-in-One HomeLab 和多设备多系统远程方案","date":"2025-12-16T23:00:00.000Z","path":"2025/12/16/homelab/","text":"🏡 打造 All-in-One 智能家庭实验室 (Homelab)之前一直用自己的笔记本电脑跑脚本，总是受掣于电脑关机，ip，网络等等问题，于是就会想要有一台自己的服务器，搞过一段时间GCP，还是因为需求不高放弃了服务器方案，用我之前一台闲置的零刻 Mini 主机为核心，结合家里的软路由，构建了HomeLab的体系，来实现了一些我（创造出来）的需求。 智能控制： 沿用之前给mini主机的 小米智能开关，来实现远程的开关上下电，出问题可以硬断电重启。 关键配置： BIOS 设置了 “上电自启”，确保断电恢复后无需手动干预。同时，加装一个USB底部风扇散热，来保证长期运行。 💻 系统方案与核心功能栈用 Windows 系统 作为 Homelab 的基础操作系统。虽然很多服务在 Linux 上更原生，但 Windows 提供了便利的远程可视化桌面（RDP），容器化部署的基础环境 DockerHub Desktop，以及我可以用Windows Subsystem Linux，WSL2, 则可以既要又要还要，还很方便使用 smb 构建家庭轻量 NAS。 对于一些自己开了发的浏览器自动化任务，由于 WSL 下的 Selenium 存在一些兼容性 Bug，也保留了 Windows 系统下的 Python 环境。 🚀 DockerHub 核心功能一览DockerHub中，包含以下一些常用的镜像。 服务名称 描述 qbittorrent 专业的下载工具，提供强大的资源获取能力。 qd today 自动签到服务，管理各种日常网络任务。 openlist 开源版本 Alist 网盘聚合。 homeassistant 智能家居中枢，接入小米开关等设备，实现全屋自动化。 immich 私有照片云服务，取代公有云，保护个人隐私。 npm 提供 nginx实现反向代理。 cloudflared Cloudflare Tunnel 服务，用于安全地将选定服务暴露到公网，无需公网 IP，配合nginx打洞。 🗄 SMB 轻 NAS宿主机是 Windows，最简单的文件共享方式莫过于系统原生的 SMB (Server Message Block) 协议。不需要像 TrueNAS 那样直通硬盘，利用 Windows 的“高级共享”功能，配合局域网和 TailScale，就能实现一个内网跑满带宽，外网随时存取的轻量 NAS。开启共享：右键点击想要共享的大容量硬盘或文件夹（例如 D:\\Downloads 或 E:\\Movies）。选择 属性 (Properties) -&gt; 共享 (Sharing) -&gt; 高级共享 (Advanced Sharing)。勾选 “共享此文件夹”。点击 权限 (Permissions) -&gt; 添加 guest -&gt; 给予 完全控制 (Full Control) 或 读取 (Read) 权限。网络发现： 确保当前网络连接属性为“专用网络”，并在“网络和共享中心”中开启了“启用网络发现”和“启用文件和打印机共享”。 多端挂载与访问，有了 SMB，家里的所有设备都能极其丝滑地访问 Homelab 里的资源： 设备端 连接方式 用途 MacBook Finder -&gt; Cmd + K -&gt; 输入 smb://192.168.xx.xx 也就是前面提到的“轻负载工作流”，直接挂载远程磁盘剪辑视频或整理照片。 iOS / iPad 自带“文件”App -&gt; 连接服务器 或 nPlayer / InfuseiPad 躺平看片神器，Infuse 配合 SMB 刮削海报墙体验极佳。 电视/盒子 Kodi / 这里的 Android TV 播放器 直接读取 PC 下载好的 4K 原盘电影，不占电视存储。 远程 NAS (配合 TailScale) 这是该方案的杀手锏。因为我在 Homelab 和 MacBook 上都装了 TailScale，在外网环境下，我只需要将 SMB 地址中的局域网 IP 换成 Homelab 的 TailScale IP，地址示例：smb://100.x.y.z (Tailscale IP) 效果： 即使人在咖啡馆，也能像在局域网一样挂载家里的硬盘，虽然速度受限于上行带宽，但用来存取文档、看非高码率视频完全够用，真正实现了私有云盘。 💖 心跳监控让 Homelab 保持“心跳”服务的稳定性至关重要。我使用 healthychecks.io 配合 开机自启的 Python 脚本 来实现心跳检测（Hearbeat）： 如果系统在预定时间内未收到信号，则会触发警报，发邮件提醒我主机或服务可能宕机。healthychecks可以设置一定的宽容时间，比如正常60s心跳，超过5min没有收到才报警。 脚本在 Homelab 启动后自动运行，并定期向 healthychecks.io 发送信号。文件后缀名从 .py 改为 .pyw（例如 heartbeat.pyw），这样它就会在后台静默运行。Win + R 键打开“运行”框,输入 shell:startup， 把.pyw创建的快捷方式丢到这个文件夹即可。 123456789101112131415161718192021222324252627282930313233343536import timeimport requestsimport datetime# ================= 配置 =================# 替换成你在 healthchecks.io 获取的那个 URLHEARTBEAT_URL = \"https://hc-ping.com/你的UUID-xxxx-xxxx\"CHECK_INTERVAL = 60 # 每60秒报一次平安# =======================================def get_current_time(): return datetime.datetime.now().strftime(\"%H:%M:%S\")if __name__ == \"__main__\": print(f\"[{get_current_time()}] 💓 看门狗已启动...\") print(f\" - 机制：每 {CHECK_INTERVAL} 秒向服务器发送一次心跳\") print(f\" - 效果：如果脚本停止（断电/关机）超过设定时间，服务器将给你发邮件\") while True: try: # 1. 发送“活着”的信号 (相当于“重置定时器”) # timeout=10 防止网络不好时脚本卡死 requests.get(HEARTBEAT_URL, timeout=10) print(f\"[{get_current_time()}] ✅ 咚-咚 (心跳发送成功，炸弹倒计时已重置)\") except requests.exceptions.RequestException as e: # 网络不通时，只是打印错误，不要退出循环，等待网络恢复 print(f\"[{get_current_time()}] ⚠️ 网络连接失败: {e}\") except KeyboardInterrupt: print(\"\\n🛑 用户手动停止脚本 (警告：这会导致服务器误报关机！)\") # 如果你正常关闭脚本，不想触发报警，通常需要去网页上点“暂停”，或者发送一个特殊的“完成信号” break # 2. 休息 time.sleep(CHECK_INTERVAL) 🌐 网络篇：家庭软路由和远程方案🛜 小米 BE7000 软路由之前选择小米路由器 BE7000，是因为他是仅次于万兆路由器的次旗舰，wifi7+usb口，足够满足我的需求，之前一直用USB的U盘作为轻NAS，后来将NAS功能挪到homelab电脑上，U盘只供路由器内部的docker使用，跑软路由服务。 解锁 SSH 发烧模式： 为了获得完整的控制权，我参考了 教程 解锁了 SSH。 常用连接命令（备忘）（因为内部rsa协议较老）： 1ssh -o HostKeyAlgorithms=+ssh-rsa -o PubkeyAcceptedKeyTypes=+ssh-rsa root@192.168.31.1 然后安装 shellclash，等以后买个双网口的再考虑把软路由集成到 HomeLab 吧。 🛰️ 远程访问方案Homelab 必须有便捷安全的远程访问能力。我的方案结合了 TailScale 的零配置 VPN 和传统的远程桌面。 🛡️ 核心远程方案 TailScale 零配置 VPN 远程：这是我的首选方案，它在所有设备间建立安全、加密的网状网络，无需复杂的端口转发配置。网络内部可以 ssh+FTP，在这一点上就可以拓展出很多很多东西。 Windows RDP 可视化：通过 TailScale 网络，我可以安全地使用 Windows 远程桌面（RDP），获得完整的可视化操作界面。其他系统如 macOS（Windows应用），Ubuntu（Remmina）都有对应的软件，只需要使用 TailScale 应用里面显示的设备局域网 IP。 ✈️ TailScale Exit Node：实现免费版的“穿梭“使用国内 IP 打开某些政府app网页。 在 Homelab 上TailScale配置 Exit Node。 在 TailScale Admin Web 界面授权该 Exit Node。 在随身携带的 Client 端（如 MacBook） TailScale 上开启使用该 Exit Node。 这样，我的设备流量就能通过家里的 Homelab 路由，从而实现穿梭回国的效果，享受国内网络服务。 🍎 多系统融合从“重装”到“轻盈”，之前我不得不随身携带一台高性能、高功耗的笔记本拯救者 Legion（Ubuntu+Win 双系统，64GB 内存 + 4TB SSD外挂硬盘），不仅机身重，170W Type-C 充电器也成了负担，常常在咖啡馆遇到没插座的尴尬。 现在，我的移动工作流已经彻底转型为：MacBook + 远程方案。 轻负载工作流： MacBook 拥有无敌续航，我无需再担心电源问题。它可以轻装上阵，将高负载任务全部交给家里的 Homelab 或者 Ubuntu 笔记本。 原生环境满足： 通过 VS Code Remote + RDP，我的 MacBook 小硬盘不必再安装虚拟机，就能随时连接到 原生 Ubuntu Legion 笔记本或 Windows+WSL HomeLab 环境。 可视化与 AI 赋能： TailScale+RDP 完美解决了云服务器难以实现的可视化问题，方便进行图形化代码调试。 VS Code Remote 也让我能更便利地本地调试，也能使用 Gemini 等 AI 插件，不需要靠 RDP来传递画面。 iPad 随航显示器： 配合 iPad 作为随航显示器，移动工作站的效率也得到了极大的提升。 ✅️ TODOHomelab 是一个 “有生命周期的系统”。目前的阶段是“可用且稳定”，未来的方向是“影音和数据备份”。 后续预期搞个双网口实现低功耗的server。 软路由买更好的梯子，可能家里搞一搞IPTV。 目前组NAS和RAID的需求不强，后续可能搞一个家人数据备份功能。","tags":[{"name":"homelab","slug":"homelab","permalink":"http://www.yvonshong.com/tags/homelab/"}]},{"title":"输入法杂谈","date":"2023-06-15T11:00:00.000Z","path":"2023/06/15/tittle-tattle-about-input-method/","text":"关于输入法其实有一连串可以讲的故事和教程，因为它不仅仅是简简单单 26 键输入工具，更是侧面映衬了这些年的变化。 常见拼音输入法从小学开始学打字开始，就是使用智能 ABC 输入法，那时候还流行金山打字，警察抓小偷，可惜我一直学不会十指键位，可能到现在还是二指禅流，后来推出了搜狗输入法，我再也不用记自己姓名在智能 ABC 输入法的第几页第几行候选字了，到后来自己购入了 NOKIA，用九键打字打得飞起，高中甚至靠手机打了大半本书《九世呓语》的内容。 现在想来，九键的好处是减少了按键，结合搜狗输入法的词库功能减少了重码，再加上那时候手机的实体键盘的按键反馈，可谓是良好的打字体验。 1 2 3 abc def 4 5 6 ghi jkl mno 7 8 9 pqrs tuv wxyz 上了大学后开始用触屏手机，按键反馈靠振动，当时输入法最花里胡哨的功能是滑动输入，可是中文的同音字词太多，滑动输入到体验远没有英文的好。其中手机输入体验最好的是谷歌的 Gboard 输入法，但由于几乎两个月固定偶发 bug，不得不弃用，目前使用的是讯飞输入法。 注音输入法那时候还从朋友那学过注音输入法 大千式注音： A B C D E F G H I J K L M N O P Q R S T U V W X Y Z ㄇ ㄖ ㄏ ㄎ ㄍ ㄑ ㄕ ㄘ ㄛ ㄨ ㄜ ㄠ ㄩ ㄙ ㄟ ㄣ ㄆ ㄐ ㄋ ㄔ ㄧ ㄒ ㄊ ㄌ ㄗ ㄈ 1 2 3 4 5 6 7 8 9 0 - ; , . / |’ [ ] = ㄅ ㄉ ˇ ˋ ㄓ ˊ ˙ ㄚ ㄞ ㄢ ㄦ ㄤ ㄝ ㄡ ㄥ 看着很一头雾水对不对，其实注音输入法只是一种键盘位排列和字符的映射。其排列规律为 26 键键盘+上方数字+ENTER 附近符号，从左到右，从上到下，为我们学习的元音辅音排列，比如 1QAZ 为 bpmf ，即波泼摸佛。因此我们重新整理上述表。 1 2 3 4 5 6 7 8 9 0 - ㄅ b ㄉ d ˇ 上声 ˋ 去声 ㄓ zhi,zh ˊ 阳平 ˙ 轻声 ㄚ a ㄞ ai ㄢ an ㄦ er Q W E R T Y U I O P ㄆ p ㄊ t ㄍ g ㄐ j ㄔ chi,ch ㄗ zi,z ㄧ yi,i ㄛ o ㄟ ei ㄣ en A S D F G H J K L ; ㄇ m ㄋ n ㄎ k ㄑ q ㄕ shi,sh ㄘ ci,c ㄨ wu,u ㄜ e ㄠ ao ㄤ ang Z X C V B N M , . / ㄈ f ㄌ l ㄏ h ㄒ x ㄖ ri,r ㄙ,si,s ㄩ yu,u ㄝ ie,ue,üe ㄡ ou ㄥ eng 但是一些复杂韵母需要用组合来表示： ㄧ 组 yi,i ㄧㄥ ying ing ㄨ 组 wu,u ㄨㄚ wa,ua ㄨㄛ wo,uo ㄨㄞ wai,uai ㄨㄟ wei,ui ㄨㄢ wan,uan ㄨㄣ wen,un ㄨㄤ wang,uang ㄨㄥ weng,ong ㄩ 组 yu,u ㄩㄝ yue,ue ㄩㄢ yuan,uan ㄩㄣ yun,un ㄩㄥ yong,iong 大千式是使用最广的注音输入方式，微软称之为标准式，是大部分预设的键位。其实注音输入法还有不同键位，比如倚天注音键盘排列，其中又分为 41 键和 26 键，IBM 式、精业式、许式等等。手机由于其篇幅原因衍生出更多类型。 日语输入法后来去日本读研，也掌握了日语输入法，不得不说学了平假名片假名后，我就完全不记得注音符号了。。。 常见的日语输入法是用五十音（罗马音）来打日语的平假名片假名，然后平假名组合变成漢字 kanji，这其实可以理解为是一种全拼输入法。 假名 あ段 い段 う段 え段 お段 あ行 あ &nbsp; ア い &nbsp; イ う &nbsp; ウ え &nbsp; エ お &nbsp; オ a i u e o か行 か &nbsp; カ き &nbsp; キ く &nbsp; ク け &nbsp; ケ こ &nbsp; コ ka ki ku ke ko さ行 さ &nbsp; サ し &nbsp; シ す &nbsp; ス せ &nbsp; セ そ &nbsp; ソ sa si/shi su se so た行 た &nbsp; タ ち &nbsp; チ つ &nbsp; ツ て &nbsp; テ と &nbsp; ト ta ti/chi tu/tsu te to な行 な &nbsp; ナ に &nbsp; ニ ぬ &nbsp; ヌ ね &nbsp; ネ の &nbsp; ノ na ni nu ne no は行 は &nbsp; ハ ひ &nbsp; ヒ ふ &nbsp; フ へ &nbsp; ヘ ほ &nbsp; ホ ha hi hu/fu he ho ま行 ま &nbsp; マ み &nbsp; ミ む &nbsp; ム め &nbsp; メ も &nbsp; モ ma mi mu me mo や行 や &nbsp; ヤ ゆ &nbsp; ユ (已弃用) よ &nbsp; ヨ ya yu ye yo ら行 ら &nbsp; ラ り &nbsp; リ る &nbsp; ル れ &nbsp; レ ろ &nbsp; ロ ra ri ru re ro わ行 わ &nbsp; ワ ゐ &nbsp; ヰ（已弃用） ゑ &nbsp; ヱ（已弃用） を &nbsp; ヲ wa wi we wo ん &nbsp; ン n 日语也有按 あかさ たなは まやら わ 行划分，加二级滑动选项的九宫格输入法： 双拼输入法后来在朋友的安利下，接触了双拼输入法，十分适合我二指禅的功力。双拼输入法的本质在于，在全拼的基础上，用一些映射来替代了复杂的声/韵母。比如“双拼”，这两个字的全拼的声韵母为 sh uang p in，而双拼用映射，简化为 u d p n，任何字都只需要不超过两个的字符来表示其声韵母，所以得名为“双拼”。 双拼也分很多方案，比如微軟双拼、智能 ABC 双拼、拼音加加、小鹤双拼、搜狗双拼、紫光双拼、自然碼。我最开始因为微软粉的缘故，学习的是微软双拼，朋友还戏谑我，你作为程序媛，怎么就让渡了分号呢？我说我平时写 Python。。。 但是实在受不了手机上无法打分号，微软双拼方案几乎完全无法用，学了一个月后我就换自然码了，但是 iOS 过了很久才系统级支持自然码，这期间也多了几分辛酸泪。 双拼只需要熟悉以上映射，目前我已完全熟练掌握自然码，手机电脑平板车机均使用双拼输入法，其实也是自我设备的一种加密。 双拼还有加强版，即形码。目前流行的双拼加形解决方案主要有「自然码辅码」和「小鹤双拼双形」两套 自然码辅助码方案可以查看： qiaomusan: 双拼自然码辅助码方案及键位分布 小鹤双拼双形可以查看小鹤的官网。 Linux 下输入法之前一直用搜狗，但是 Ubutun 下安装中文输入法真的是麻烦得一匹，搜狗我经常搞崩，又没好的教程，于是我转投了百度输入法，其下载压缩包还自带教程。并且百度输入法有个优点，可以设置预设的应用默认使用英文！这对于程序员来说太重要了，赶紧把 VS Code 之类的都设置成默认英文，就不会在代码里面打出中文分号让给报错 debug 半天了。。。 不过需要禁用百度输入法的简繁快捷键，因为 Ctrl+F 我还是习惯用作应用内搜索。具体如下操作： 百度输入法-高级-输入法管理器-附加组件-简繁转换-配置 即可更改快捷键","tags":[{"name":"IME","slug":"IME","permalink":"http://www.yvonshong.com/tags/IME/"}]},{"title":"我们把往事的记忆幻化成光影纸质想使之永垂不朽","date":"2023-06-07T02:00:00.000Z","path":"2023/06/07/what-we-were-talking-about-ten-years-ago/","text":"十年前我在高中毕业的时候出过一本书，是高中三年来和同学们一起记录的玩笑和日常，书名为《九世呓语》，取名由来是我们高一是十一班，高二后，个别班级被拆分，其后班级序号前移，我们成了九班，书名谐音——九十一语（录）。 首先献上这次做的网页：九世呓语 主页 www.yvonshong.com/911/ 是的，如今提到高中，得说是十(几)年前了，那三年间，我们一起记录，Rich 制作了电子相册，我攒下了很多照片和视频。我还记得高考出成绩的那天晚上，我下午还在忙着语录印书的事情。 暑期来校的高一新生夏令营里，还制作了海报趁机贩卖。 贩卖后净收入一千余，事后请大家一起吃了顿大餐，给参与书籍排班的同学们送了纪念礼物。 如今趁着十年之际，现发布了书籍的电子版。 以及其中包含的系列内容： Three years 系列视频 - Bilibili 毕业去向统计 - 飞书文档 访问密码请联系 Yvon PDF 下载链接 - 《九世呓语》下载 在线阅读网页 - 《九世呓语》在线阅读 也分享一下我在其中写的 急 部分，没办法，年少时中二用序破急来命名书的章节。。。 我还翻到了我当时在夏令营上给学弟学妹分享的文稿 今天我现在想要分享的一个词是:尝试 如同我们三年前，大家刚进入七中，人生阅历也算尚浅，会有各种机会尝试各种事情，比如说现在的夏令营。 这三年来，我们这届高新的拓荒者注定要尝试各种东西，与学校一同发展。 依我看来，尝试需要三样东西。 第一是勇气。 夏令营第一天我在新生班后面看着各位竞选班干部，我就很佩服现在大家拥有的勇气，不像我高三的时候去参加自主招生过面试的时候，刚站在讲台上腿都在发抖&gt;&lt; 不过我认为想一千次，不如去做一次。华丽的跌倒，胜过无谓的徘徊。只有去尝试过了才能去开拓再进步。 二是计划。 关于计划不得不说的就是组织活动，三年来我尝试过多次组织班上同学参加社会实践和假期活动，如献血宣传，七夕节活动*2，去溜刀冰去做蛋糕，去骑游去烧烤，还有高考后的两项重大事件——“组织毕业旅行”和“语录编辑印制” 都圆满完成。纵观这么多次活动其实都有策划书伴随左右才能顺利进行。 不得不说的就是语录——本班刊物的印制。 我们历时三年的班级记录，一笔一划记录下班级的点点滴滴，毕业后十天编辑组的准备，按照计划分工合作加班加点完成，自己尝试做海报，自己尝试网上宣传，这本书里满满当当都是青春才有的味道。敢于去体验，正确地去体验。 这其实算是我们三年来最勇敢的尝试，毫无经验的编辑们按计划成功得印制出了一本书。若大家想一览七中生活，门外询问~ 三是反思。 三年来做过很多计划，每次活动的时候总会有变故，比如骑游那天早上下暴雨，面对突发事件，事后反思才能了解自己的缺漏，为下一次的尝试作经验，不然每一次都是新手都是白纸会被意外惊讶到措手不及。 比如我学会了 Plan B，比如学会计算迟到事件提前集合。还有高三学习清华学霸马东晗计划表，反思每次周的得失才是真正的收获，我相信大家即将进入真正的七中生活开启学霸模式更是将把总结反思践行到实处！ 对于前面有人说的话我还想说些什么。 青春的年纪总会豪言壮语，激情澎湃的对未来充满希望，自己可以改变整个世界，当现实的利刃会将你曾经的个性，冲动，自信等都抹平的时候，你会发现，其实我改变不了这个世界，是这个世界改变了我，仅存的只是那廉价的自尊心。当我们被周边的环境被同化的时候，能保留最真实的自我，不做作，不浮夸，做最本性的自己。便足矣。 —— 2013 年 7 月 18 日，于成都七中奥赛学科夏令营。","tags":[{"name":"cdqz","slug":"cdqz","permalink":"http://www.yvonshong.com/tags/cdqz/"}]},{"title":"PDF 文献库解决方案——Zotero","date":"2023-05-29T09:00:00.000Z","path":"2023/05/29/get-started-with-zotero/","text":"论工作方式的形成，和效率工具，我言必及我大一开始使用的： outlook 日历：做日程管理，有时间跨度和排他性的任务； todo：之前是 wunderlist，做任务管理，有 ddl 和优先级的设定； 以及我之前最重要的文档工具 OneNote； 但是在存储管理 pdf 文件上，迷糊了很多年。 有时候会追求在 pdf 上手写笔记，有时候又追求键盘输入的可搜索性。先后尝试过： 把 PDF 文件保存进 OneNote，在里面做批注。最后发现 OneNote 根本就不是做这个的，OneNote 会变得巨大打开变得巨慢，阅读体验也很差。 还原到本质，用文件夹进行管理，Surface 上做批注。缺点是文件夹的层级会十分犹豫，因为论文类型的 PDF 更适合多 tag 的描述，当然其实在足够优秀的搜索效果面前，tag 也是可以忽略的。 把 PDF 保存在 Notebility，在里面做批注。软件实现了 OneDrive 的保存，但是不跨平台，只支持 Mac + iPad 平台，Windows 用户震怒。 尝试过 Mendeley，是专门的文献管理软件，虽然文献信息可上传至云端备份，但账户存储空间只有2G的免费空间，多余的文献将无法同步其文件。因此，重装系统或者更换电脑后，未同步 PDF 文件的文献将无法同步至新平台上。其对英文文献的友好程度较高，但不利于中文文献的管理。 最后终于用上了 Zotero，它的好处有： 文献信息整理，有文献库的基本功能，搜索，标签，一应俱全。 支持 OneDrive 同步！M365用户狂喜。 有很多插件，支持中文文献。 Zotero注册和下载： https://www.zotero.org/ 基础设置语言 Edit 编辑 &gt;&gt; Preference 首选项 &gt;&gt; Advanced &gt;&gt; General &gt;&gt; Language &gt;&gt; 中文（简体） OneDrive 同步 编辑 &gt;&gt; 首选项 &gt;&gt; 同步 &gt;&gt; 登录 会用 Zotero 同步书目条例 编辑 &gt;&gt; 首选项 &gt;&gt; 高级 &gt;&gt; 文件和文件夹 &gt;&gt; 已链接附件的根文件夹 &gt;&gt; 选择 到 OneDrive 自己的 Zotero/storage 文件夹下 数据存储位置 为默认 Ubuntu 下 OneDrive 同步可参考 Get started with Obsidian 插件官方插件列表 https://www.zotero.org/support/plugins ZotFile用于管理附件，自动PDF重命名，移动和附加到Zotero项目，下载： https://github.com/jlegewie/zotfile 设置： 工具 &gt;&gt; ZotFile Preference &gt;&gt; Source Folder for Attaching New Files &gt;&gt; 到自己的 OneDrive/Documents/Zotero/storage 文件夹下 工具 &gt;&gt; ZotFile Preference &gt;&gt; Location of Files &gt;&gt; 到自己的 OneDrive/Documents/Zotero/storage 文件夹下 工具 &gt;&gt; ZotFile Preference &gt;&gt; Location of Files &gt;&gt; Use subfolder defined by /%t 茉莉花 Jasminum下载： Jasminum - 茉莉花 设置： enjoy it!","tags":[{"name":"onedrive","slug":"onedrive","permalink":"http://www.yvonshong.com/tags/onedrive/"},{"name":"zotero","slug":"zotero","permalink":"http://www.yvonshong.com/tags/zotero/"}]},{"title":"从零开始 NanoPi R2S","date":"2023-05-15T16:00:00.000Z","path":"2023/05/15/introduction-to-nano-pi-r2s/","text":"半年前购置了软路由，最近才配置上，全当做个笔记。 硬件 NanoPi R2S TF 卡（8G 以上就够了， Class 10 以上标准，更好的可以上 Industrial ） Type-C 电源线（无需支持快充标准） 10W 以上充电头 刷系统刷机工具win32diskimager 固件无需忍受百度云小水管： 官方固件 Google Drive 下载链接 在 Windows 下以管理员身份运行 win32diskimager，在界面上选择你的 TF 卡盘符，选择解压后的固件文件，点击 Write 按钮烧写到 TF 卡。 刷机完成后将 TF 卡插入，接电，会自动启动系统。此时 NanoPi 正面 SYS 灯红灯闪烁。 连线电脑直连 modem-router-nanopi-pc 接线方式：原家庭路由和光猫的接线方式不变，R2S 的 WAN 口连接原家庭主路由的 LAN 口，R2S 无需设置，R2S 的 LAN 口连接电脑网口； 验证方法：电脑网卡设置成“自动获得 IP 地址”就可正常上网。 此方法可快速检测 R2S 是否存在硬件故障，用命令 ping www.baidu.com 检测是否正常联网，能联网成功即可说明硬件正常。 路由器直连 modem-nanopi-router-pc R2S 的 WAN 口连接光猫，R2S 的 LAN 口连接原家庭无线路由器的任意一个 LAN 口； 设置步骤： 光猫拨号用户：R2S 无需设置，接线就可正常上网。 PPPOE 拨号用户：浏览器输入 192.168.2.1 登录 R2S 后台—网络—接口—WAN 修改协议为 PPPOE，填入宽带账户密码即可。 系统设置在电脑浏览器上输入以下网址即可进入 FriendlyWrt 管理页面: http://friendlywrt/ http://192.168.2.1/ http://[fd00🆎cd::1] 以上是 NanoPi R2S 的 LAN 口地址，WAN 口会从你的主路由器动态获取 IP 地址。 安全性设置以下设置事项非常建议在将 NanoPi-R2S 接入互联网之前完成，因为在空密码或弱密码的状态下将 NanoPi-R2S 接入互联网，极易受到网络攻击。 设置一个安全的密码 进入 系统-&gt;管理权 界面设置密码。 禁止从 wan 访问 ssh，更换端口 进入 系统-&gt;管理权-&gt;SSH 访问，将接口限制为 lan，将端口设置为其他非常用端口，例如 23333。 安装软件包进入菜单”系统“-》”软件包“, 在界面上点击”okpg 配置“按钮, 在新弹出的界面上, 更改/etc/opkg/distfeeds.conf 的文件内容即可,比如要切换至国内腾讯源, 可以替换成如下内容, 然后点击 “保存” 按钮: 123456src/gz openwrt_base https://mirrors.cloud.tencent.com/openwrt/releases/22.03.2/packages/aarch64_cortex-a53/basesrc/gz openwrt_luci https://mirrors.cloud.tencent.com/openwrt/releases/22.03.2/packages/aarch64_cortex-a53/lucisrc/gz openwrt_packages https://mirrors.cloud.tencent.com/openwrt/releases/22.03.2/packages/aarch64_cortex-a53/packagessrc/gz openwrt_routing https://mirrors.cloud.tencent.com/openwrt/releases/22.03.2/packages/aarch64_cortex-a53/routingsrc/gz openwrt_telephony https://mirrors.cloud.tencent.com/openwrt/releases/22.03.2/packages/aarch64_cortex-a53/telephonysrc/gz friendlywrt_packages file://opt/packages 通过命令行切换国内源: 12sed -i -e 's/downloads.openwrt.org/mirrors.cloud.tencent.com/g' /etc/opkg/distfeeds.confopkg update 插件openclashgithub vernesong O p e n / C l a s h WIKI 广告过滤AdGuardHome 解锁网易云灰色音乐https://github.com/UnblockNeteaseMusic/luci-app-unblockneteasemusic netease-cloudmusic-history-version 下载 2.9.5 挂载硬盘 把移动硬盘连接 NanoPi-R2S 作为外接存储设备，将移动硬盘插入 NanoPi-R2S 的 USB 接口，在 FriendlyWrt 中点击“系统-&gt;挂载点”进入挂载点设置界面： 在界面下方找到挂载点存储设备设置，点击“添加”按钮： 在弹出的对话框中 UUID 一栏选中刚刚接入的移动硬盘 /dev/sda1（实际情况请根据自身设备选择，如硬盘有多个分区可能会显示 sda1/sda2……等）： 在挂载点一栏中使用自定义，填入要挂载到的目标目录，这里以/jellyfin/videos 目录为例，勾选上方的“已启用”，然后点击“保存”： 设置完后点击“系统-&gt;重启”重启 NanoPi-R2S 使挂载点生效： 重启后再回到“挂载点”界面可看到“已挂载的文件系统”中显示刚刚挂载的移动硬盘信息，即设置成功（以后需要再新增或删减编辑挂载点都可以在下面的“挂载点”设置中操作）： 注：每次操作后都需要重启后才能生效 Wake on LANhttps://pkgs.org/download/luci-app-wol Reference friendlywrt wiki 巴掌大小的 Nanopi R2S 软路由 固件分享和体验","tags":[{"name":"openwrt","slug":"openwrt","permalink":"http://www.yvonshong.com/tags/openwrt/"}]},{"title":"聚焦激光雷达（五）——处理器","date":"2023-05-11T11:55:00.000Z","path":"2023/05/11/focus-on-lidar-5/","text":"我们在系列文章中，讲解了发射器，扫描器，接收器，光学系统，接下来便是激光雷达中的核心电子元件——处理器。由于篇幅原因，本文暂不涉及激光雷达的控制流程，或者是激光雷达的时间同步、脉冲的编解码、点云的解算等问题，仅依次介绍处理器硬件中涉及到的电子元件。文后附有几种激光雷达的拆解案例，罗列了激光雷达处理器中涉及到的电子元件，如有兴趣可点赞收藏该文章。 激光脉冲驱动控制器通常发射端每个激光器需要链接一个激光器脉冲驱动控制器 LD Driver，它负责在接收到主控芯片的发光指令后，给激光器发送一个控制信号。实现激光的脉冲式发射和编码，通过配置脉冲强度和脉冲宽度，增加编码功能，增强抗干扰能力。 驱动控制器要求控制信号能越快越好，有足够陡峭的上升沿。通常在低速信号电路中，信号从 0(低电平) 变成 1(高电平) 可以看成是瞬间完成的，但在高速电路中， 从 0 跳到 1 的时间消耗就无法忽略了，上升沿指的就是这个从 0 到 1 的过程，反之下降沿就是从 1 到 0 的过程。 之所以对上升沿有较高要求，是因为激光对人眼有加热效应，受到人眼安全约束，但可以通过提高瞬时功率，提高探测距离，缩短发光时间，降低发热效应（关于人眼安全，后期将会单独撰写一篇文章）。同时，缩短发光脉冲时间对于提高激光器点频也有所帮助。因此， 尽可能缩短上升沿和下降沿时间也成了必要。 同时激光器要达到高功率短脉冲，不仅需要快速的激光脉冲驱动，还需要一个能够快速响应 LD 驱动的大功率电流源，常见的是 TI 的 GaN FET。 大电流窄脉冲驱动能力能够实现驱动 GaN 产生脉冲宽度小于 3 ns、峰值电流超过 30 A 的电流脉冲， 控制激光器产生高峰值功率窄脉宽的光脉冲信号，有利于提升激光雷达产品的测远能力和测距精度。 扫描器驱动和编码器我们在前文 Yvon Shong：聚焦激光雷达（一）——扫描器 提到，一些类型的激光雷达，存在机械/微机电扫描结构，比如需要电机转动反射棱镜，或者是电磁驱动振镜。所以在主控芯片发出发光指令时，也会向扫描器驱动发射控制指令，控制电机或振镜的转动。 编码器可分为：电阻类、电感类、电容类和光电类，其功能是将位置和旋转等物理量转换为数字或模拟电信号。最常见的应用是在电动机的运动控制中提供反馈。大多数应用都使用光学编码器，因为光学编码器除了有准确性，还不需要任何单独的电子设备来提供位置或精确位置。 光学式编码器 光学式编码器轴带动光栅盘旋转时，经发光元件发出的光被光栅盘狭缝切割成断续光线，并被接收元件接收产生初始信号。该信号经后继电路处理后,输出脉冲信号。光栅实际上是一个刻有规则透光和不透光线条的圆盘，光敏元件接收的光通量随透光线条同步变化，光敏元件输出波形经整形后，变为脉冲信号，每转一圈，输出一个脉冲。根据脉冲的变化，可以精确测量和控制设备位移量。 透射型旋转编码器 反射型将来自光源的光束，反射到由柱面透镜和棱镜组成的转盘上，并将其作为受光元件进行检测，从而易于实现产品的小型化。 这些光学元件的特点是精度高、分辨率高，不易受磁场影响。 反射型旋转编码器 磁性编码器 磁性编码器通过磁阻元件检测，在外圆周上交替排列的磁化 N 极和 S 极的旋转圆盘的磁极变化，将其转换为电信号，并以方波形式输出。 其特点是体积小、重量轻，而且由于没有发光元件，因此功耗比光学式低。但磁性容易受到外界影响。 磁性编码器 接收器驱动和读出电路我们在 Yvon Shong：聚焦激光雷达（三）——接收器 中有详细介绍，接收器需要电路控制来放大光生电信号， 并且 SPAD 需要配合猝灭电路来进行重置，所以接收器链接着处理器中驱动和读出电路。 跨阻放大器在接收端，APD 或 SiPM 接收到光子后产生电流，理论上通过这个电流即可获知光强， 然而实际上尽管反射光信号已经经过了 SiPM 或 APD 的放大，却仍然较小，信号过于微弱，满足不了系统载噪比要求，通常需要在前端要采用低噪声放大器进行放大，以提高信噪比。 速腾 M1 接收端的 TIA 而且光电传感器输出的是电流信号，不利于与数字电路相融合，会将其转化为电压信号，一方面方便数字电路处理，另一方面也能够减小功耗。完成放大和电流转成较大电压任务的就是跨阻放大器 TIA（Trans-Impedance Amplifier，TIA），属于高速运算放大器的一种。 数字转换由于探测器的光电反应信号，通过跨阻放大器输出电压信号，往往需要将其转化成采样后的数字信号才便于核心处理器进行处理及运行后续的算法。 时间数字转换器 TDCTDC，Time-to-Digital Converter 时间数字转换器，精确测量电信号时间间隔，主要发挥计时器功能，通常用于低功耗、低成本、环境简单的系统，此时只 TDC 需要连接到主控芯片和光接收器之间，当主控芯片发出发光信号时，也同步给 TDC 一个开始计时的信号，随后反射回来的光经过 TIA 转换成放大的电压，再经过比较器与参考电压比较，判断是否有光入射，TDC 则将比较器的输出当做结束信号，完成计时，并将时间信息送回主控芯片。 TDC 的波形处理：通过时钟来读出前沿和脉宽，无峰值 TDC 功耗低、成本低、集成度高，但是采集到的信息量较少，难以做波形处理，适合低成本场景。 TI 基于 TDC 的 ToF 方案 模拟数字转换器 ADCADC，Analog-to-Digital Converter，模数转换器，将连续变化的电信号，转换为离散的数字量。 ADC 的波形处理：边沿检测得到上升沿时间、脉宽、峰值 ADC 通常用于更复杂的系统，ADC 对反射光信号进行持续采样，转换成数字信号，并由控制芯片进行波形处理、计时等工作。 ADC 能够采集到完整的波形，信息丰富，易应用波形处理算法（处理拖点、雨雾等）。但功耗高、成本高、集成度低。它适合更精密测量需求。 TI 基于 ADC 的 ToF 方案 主控芯片主控芯片需要控制发射系统发射激光脉冲，并处理电路返回的观测数据，计算开始信号和停止信号的时间间隔。FPGA 芯片通常被用作激光雷达的主控芯片，完成光电的处理进而输出点云信号，国外主流的供应商有 AMD 收购的 Xilinx（赛灵思），Intel 收购的 Altera，还有 Lattice 等规模稍小的厂商，国内主要的供应商有紫光国芯、西安智多晶等公司。 不过 FPGA 不是激光雷达主控芯片的唯一选择，也可以选用高性能单片机 （Microcontroller Unit，MCU）、数字信号处理单元（Digital Signal Processor，DSP） 代替。MCU 的国际主流供应商有 Renesas（瑞萨）、Infineon（英飞凌）等，DSP 的主流供应商有 TI（德州仪器）、ADI（亚德诺半导体）等。 为什么不采用 CPU 作为主控？因为激光雷达需要进行大量的信号处理、电机时序控制等，CPU 虽然也能做，但如果采用专用的算法以及为算法专门优化设计的电路，其效率会高得多。而激光雷达作为汽车领域的新生事物，从 2007 年 Velodyne 激光雷达首次被用于 DARPA 挑战赛至今，其上车的历史也不过十五年，还有许多硬件/算法设计尚处在探索阶段，因此采用 FPGA 有利于反复迭代修改，同时还满足了专用电路的高效性。 比如，仅仅反射波的波形处理就需要消耗大量算力，而且每一个激光器的反射光都需要进行处理，使用 CPU 既难以满足算力需求，又浪费 CPU 的通用能力，因此往往需要专门的电路进行处理。并且实际中波形的处理比理论中复杂许多，虽然发射端发射的是一个短促的脉冲，但由于光束的扩散，飞行过程中会遇到多个障碍物，产生多个反射波，判断反射光的返回时间，以及反射率将变得十分复杂，更不遑说对激光脉冲进行编码解码的处理。 关于 FPGA 的科普可以查看 FPGA 技术江湖：简谈 CPU、MCU、FPGA、SoC 芯片异同之处 而以下是 TI 的 机械旋转式 LiDAR 的电路模块图 Mechanically scanning LIDAR，可以看到通常还会有一些温度传感器和相应的温度控制，来避免激光雷达电路板处在极端温度环境。还包含整个系统的电源相关驱动模块。 LiDAR 各模块控制信号链路，以及电源，接口，时钟，监测和诊断模块 System on Chip模拟前端电路（Analog Front End，AFE）处理的对象是信号源给出的模拟信号，接收器的感生信号具有动态范围大，脉宽窄，幅度弱的特点，为了解决这些问题，处理数据，模拟前端通常包含传感器接口、模拟信号调理（Conditioning，包括阻抗变换、程控增益放大、滤波和极性转换等）电路、模拟多路开关、采样保持器、ADC、数据缓存以及控制逻辑等部件的存以及控制逻辑等部件的集成组件。 但由于激光雷达模拟芯片技术难度相对有限，且厂商之间尚无统一的设计标准，因此考虑到适用性和降本需求，众多激光雷达厂商开始自研 ASIC 或 SOC 芯片将以上功能集成到单个芯片中。 激光雷达专用芯片及功能模块示意图 处理器目前逐步向企业自研专用片上集成芯片（System on Chip， SoC）迁移发展，TIA、ADC 等也可能集成到 SoC 中，随着 VCSEL 发射器和 SPAD 接收器的芯片化，实现更强的运算能力、更低的功耗和更高的集成度。进一步的集成有多方面好处，第一是继续降低成本；第二是缩短距离，避免电路板层面以及外界的其他干扰；第三是减少元器件数量，提高可制造性，适合大规模量产；第四是缩小体积，更高的可制造性和更低的干扰有利于通过车规，而更小的体积和更低的成本对于汽车应用十分重要。 拆解案例Scale Gen 2可以查看 朱玉龙：技术讨论｜Valeo Lidar Scala Gen 2 拆解 Velodyne VLP 16Velodyne 16 线激光雷达的主板是该设备的核心，具有许多控制器，RF 组件和开关。包括 Intel，Microchip，ADI 和 TI 的组件。 VLP 16 主板 TI：微控制器，逆变器，调节器和接收器，温度传感器； ADI：放大器，ADC 驱动器和开关多路复用器； Microchip：稳压器； 英特尔： Cyclone III FPGA，8 MB 闪存（主板背面） 英飞凌：双 MOSFET 驱动器（主板背面） VLP 16 电源板 英特尔：第二个 Cyclone III FPGA ，并行的 128 MB NOR 闪存； ISSI： 32 MB SDRAM 内存； 意法半导体：调节器； Microchip： ADC 和 MOSFET 驱动器； Broadcom：双通道光耦，光学编码器（电源板背面）； Allegro Microsystems：霍尔效应传感器； 凌力尔特：降压转换器（电源板背面）； TI：以太网收发器（电源板背面），温度传感器（电源板背面）； Ouster OS1Ouster OS1 激光雷达传感器的主板上的组件包括： Ouster OS1 主板 Maxim：12 位模数转换器和限幅放大器 Marvell Semiconductor：千兆以太网收发器 美光多：芯片内存 8GB MLC NAND 闪存、内存控制器和 DDR3L SDRAM 内存 TI：DDR 终端稳压器和可调节的 slap-down 转换器 Analog Devices：射频功率检测器 Macronix：串行 NOR 闪存 16MB Ouster 内部转子板 内部的转动子板用作 Ouster OS1 内部的控制单元，其中包含： Microchip： 125 MHz MEMS 振荡器 Xilinx：Artiz-7 FPGA Nexperia：双电源转换收发器 Maxim： 12 位 ADC TI：电流分流监视器芯片 Ouster 电机板 电机板包含内存和其他芯片，用于车辆和 LiDAR 的通信： 包括与车辆通信的芯片 Microchip ：串行 EEPROM 存储器 2KB TI ：补偿器、电流分流芯片和功率 MOSFET ON Semi： MOSFET 驱动器 Livox HAP 大疆 Livox HAP 主控板以及两大控制芯片 英飞凌：ARM Cortex M4 FPGA Xilinx：Xilinx：Zynq Ultra Scale+ MPSoC RoboSense Helios RS Helios 主控板 赛灵思：ZYNQ ARM 双核 Cortex-A0 FPGA； 美光：512MB SDRAM 内存； TI：DDR 终端稳压器、LDO 稳压器、半桥栅极驱动器、降压电源块和功率 MOSFET； Broadcom：汽车以太网收发器； Winbond：串行闪存； Diodes Incorporated：ESD 保护； Maxim：Step-down DC-DC 转换器 在激光雷达里面还有一个数字适配器板，主要包含包含 RS Helios 数字转接板 ST Microelectronics：ARM 32 位 Cortex-M3 微控制器 MCU（用作激光雷达的连接和电源管理） On Semiconductor：稳压器 Diodes Incorporated：功率 MOSFET Broadcom：以太网收发器； 另一块辅助板： RS Helios 激光雷达辅助板 Xilinx： Spartan-7 FPGA（用于控制激光雷达传感器内部的传感器、连接和电源管理） Analog Devices：VCO TI：LDO、差分放大器、step-down 转换器和温度传感器 Maxim：DC-DC 转换器 Diodes Incorporated：ESD 保护 IDT：时钟缓冲器 NXP Semiconductors：双 USB 2.0 开关 Vishay：功率 MOSFET Reference 马鹏阁. 多脉冲激光雷达[M]. 国防工业出版社, 2017. 王颖麟, 廖进昆, 晏思平,等. 基于FPGA和MCU的激光成像雷达信号处理系统[J]. 兵器装备工程学报, 2009, 030(011):60-62. 上海证券交易所：禾赛科技 2021 年科创板招股书 TI：飞行时间和激光雷达 - 光学前端设计 与非网：模拟前端（AFE）原理及选型指南 可易亚半导体 KIA：集成电路-专用集成电路（ASIC）简介、优缺点等知识 面包板社区：FPGA与ASIC对比，优缺点一目了然！ FPGA技术江湖：简谈CPU、MCU、FPGA、SoC 芯片异同之处 车东西：看懂这颗激光雷达芯片，就看懂了索尼汽车 中信证券：拆解5款车载激光雷达带你了解里面的元器件 汽车电子设计：技术讨论｜Valeo Lidar Scala Gen 2 拆解 芝能汽车：激光雷达 Ouster 公司情况和 Ouster OS1-64 拆解 智能汽车俱乐部：拆解分析｜速腾RS Helios激光雷达的拆解 燃云汽车：Velodyne 激光雷达 Puck VLP-16 拆解 Teardown: Velodyne Lidar Puck VLP-16 sensor 科普中国：激光干涉光栅编码器——走进精密运动控制的世界 尼得科科智博电子：编码器特集 欢迎在我的专栏「自律走行」中查看更多「聚焦激光雷达」系列文章 聚焦激光雷达（一）——扫描器 聚焦激光雷达（二）——激光器 聚焦激光雷达（三）——接收器 聚焦激光雷达（四）——光学元件 聚焦激光雷达（五）——处理器","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"lidar","slug":"lidar","permalink":"http://www.yvonshong.com/tags/lidar/"}]},{"title":"观星指南","date":"2023-05-07T05:24:00.000Z","path":"2023/05/07/tutorial-for-stargazing/","text":"和朋友们去看过几次夏季银河，陆陆续续也看过几次流星雨，也翻过很多次的车，所以不才想要小结一下我自己的观星指南，方便更多对天文，对摄影感兴趣的朋友们入坑。 2019 年 9 月 于河北张家口冰山梁 这辈子第一次看的银河 地点观星者最需要确定自己要在哪里看，以及能在哪里看！这个是最重要的，因为地点决定了后续所有的因素。它决定了光污染程度，从而决定了你看到的银河/星星的效果。它决定了当地的天气，经纬度决定了当地的月出月落时间。所以观星第一步，确定你要在哪里观星！ 首先需要通过光污染地图，来查看或者确认当地的光害指数。建议选择光害三级以下的地点。 天文通 - 全球光污染地图 Light pollution map 京郊附近到张家口或者东灵山，光污染便比较低了，上海附近的话得到浙西大峡谷。 2020 年 8 月 于浙江宁波渔山列岛，光害较高，银河比较黯淡 时间确定了地点，需要查看计划前往日期的月相，因为月亮一出来，星星的光芒都会看不见了。月亮这个时候就成了很大的光污染，而唯一的办法，就是等月落后或者月出前。春秋季还需要关心银心升起落下时间，因为银心是最美最亮的！ 日出日落月相 iOS:&nbsp;日出日落月相 Android:&nbsp;日出日落月相官方新版本-安卓iOS版下载-应用宝官网 举个例子，比如这个情况，整晚月亮不落，观星条件就很差 巧摄 iOS: Planit巧摄现场版：摄影现场利器(免费，不能调整到预设地点，只能看当前位置) iOS: ‎Planit巧摄专业版：摄影计划神器(收费) 巧摄还有个用处是有地景数据，能辅助构图，比如想要月亮穿过某个楼尖，比如想要根据地形构图。 天文通 这款小程序/app几乎可以满足所有观星需求 天气偏远地区排除了城市光污染，没有月亮的晚上排除了月亮的光污染，下一步是确定当地天气，如果是下雨或多云的话，就几乎看不到了。 天气预报一直是一个很头疼的问题，因为还是不够准。目前使用的 app 有：莉景天气，彩云天气，windy。 莉景天气能够看到一些朝霞晚霞预报。彩云天气能够看到比较准确的当前的云图，windy能够协助查看几天后的云图。 理想的情况是不下雨，万里无云。 拍摄 2021 年 8 月 于河北张家口阳原县 铺垫了这么多前提条件，终于才能看到星星了。。 想要拍银河的话其实比较简单 构图，地球在转，银河是会动的，如果想要拍延时的话，需要预先用app估计好银河的运动轨迹（巧摄）。 必备三脚架，如果你是索尼A7S3或者ZV-E1的话当我没说（。）其他的需要长曝光，所以必须要有三脚架作为支撑点（并且建议三脚架下面挂上配重，两升装的矿泉水之类的，风大会吹倒三脚架，说多是泪。） 调整焦距构图，因为直怼银河拍多了会腻，有不同的地景效果会截然不同。如果想要拍摄流星雨的话，会需要找一找流星雨辐射点。 对焦！这里需要手动对焦，因为太黑了不能指望自动对焦。这种场景下对焦的方法是把 ISO 拉到最大，然后对准远处一颗很亮的星星，调整焦距，让这颗星星从弥散圆模糊的状态，调整成一颗星点（所以也并不是把焦距直接设置到无穷远）。 根据焦距估计可最长曝光的时长，因为地球在转，如果曝光太久的话，星星会拖线变成星轨。通常是400法则 最长可曝光秒数 = 400 / 等效焦距。 这时候就可以拍摄了，拍摄单张的时候分享个小技巧，设置2s的延时拍摄，不然你摁快门的时候会晃动机身。 我通常都懒得算了，银河大部分时间拍广角，直接光圈最大（提高进光量），曝光时间30s（提高进光量），ISO 从6400开始往下压， ISO 是亮度的增益，越低的话噪点就能够越少。其实不用完全遵循 400 法则，只需要现场多试几张就知道了，光圈开最大，曝光只要不拖线就最长，ISO 从高往低尝试。 2023 年 5 月 于浙江杭州临安浙西大峡谷 流星雨的观赏体验其实比较讲究，建议只去看ZHR值超过100时的北半球三大流星雨（1月的象限仪座流星雨、8月的英仙座流星雨、12月的双子座流星雨），然后带个地垫躺在草坪上~ 我还没拍过银河拱桥，等我拍过了再更新。。。 彗星虽然一直没去拍过彗星，但做了很多次攻略。。。 需要用到 Stellarium，来查询当地的最大高度角和升起落下时间。以 C/2021 A1 新智彗星为例，步骤如下： 打开 Stellarium&gt;&gt;设置&gt;&gt;脚本&gt;&gt;太阳系编辑器&gt;&gt;设置&gt;&gt;太阳系&gt;&gt;导入MPC格式的轨道参数&gt;&gt;选择天体类型[彗星]，从互联网下载天体列表，选择书签[MPC’s lists of observable comets]&gt;&gt;获取轨道信息&gt;&gt;下载完便可搜索 C/2021 A1 添加，便可以搜到该彗星了。 讲得比较零零碎碎，因为涉及的方面比较多，可能还会有住宿问题，导致需要露营，大晚上还需要保暖，还需要考虑电源，考虑露水等等。也还没入深空摄影的坑，暂时先写这么多吧。","tags":[{"name":"photograph","slug":"photograph","permalink":"http://www.yvonshong.com/tags/photograph/"}]},{"title":"聚焦激光雷达（四）——光学系统","date":"2023-04-19T00:21:00.000Z","path":"2023/04/19/focus-on-lidar-4/","text":"激光雷达从器件来看，最主要的构成要素是扫描器、发射器，接收器，处理器，以及一些内部的光学元件了，激光从发射器中产生，除了要通过扫描器来调整激光方向以外，还需要通过各式各样的光学元件，来调整光斑形状大小，光场的能量分布等等。 查阅了很多光学供应链公司的产品和研报，这可能是全网唯一比较全面的介绍激光雷达内部涉及的光学元件的科普文章了，欢迎点赞关注本专栏。 从激光雷达 BOM 成本拆分来看，透镜等光学组件仍是激光雷达的重要组成部分。以法雷奥 Scala 转镜激光雷达为例，目前年产量十万级规模， BOM 成本约 400 美元，其中主控板占 45%，激光发射接收组件占 33%，光学单元占 13%，外罩 8%，马达 1%。而 Livox 的双楔形棱镜式激光雷达的透镜模组占了成本的 54%。可以看到，光学元件是激光雷达成本里重要组成部分。 由于各种激光器发射的激光束并不是绝对平行的，具有光斑形状不规则，发散角度大的问题，因此还需要一套光学系统，对激光器的输出光束进行准直整形，通过改变光束的发散度、波束宽度和截面积，改善输出光束质量。 发射光学系统主要由透镜、反射器件、衍射器件等光学元器件组成，包含准直镜、分束器、扩散片等。接收光学系统主要由透镜、滤光片等组成，尽可能收集经目标反射后的光能量，将其汇集到探测器的光敏面上。 接下来我们从发射器出发，沿着光路一同探究沿途的光学元件。 准直镜 Collimator准直模块通常由 FAC 透镜（Fast-Axis Collimation Lens）和 SAC 透镜（Slow-Axis Collimation Lens）构成，他们本质上是我们熟悉的凸透镜在横纵轴上需求不同而产生的分解，先对快轴方向进行聚焦，然后在慢轴方向进行另一种程度的聚焦。 激光雷达用快轴准直镜 / 慢轴准直镜 为什么需要对激光器发出的光进行校准？因为激光器发射的激光并不是笔直的光束，而是存在着发散角的，尤其是半导体激光器，发散角非常大。由于半导体激光器体积小，谐振腔小，对光束的筛选作用比较弱，而且发光面积小，发出的光线会发生衍射。 另外，半导体激光器由于谐振腔的筛选能力不够强，还存在光束质量问题（光斑的强弱分布不均），且在主要光斑周围还有少量剩余能量（拖尾效应），所以需要进行调整。针对拖尾问题，经常采用光阑将主光斑之外的少量光束舍弃。 EEL 和 VCSEL 激光器光斑强度示意图 对于 EEL 来说通常射出的都是椭圆锥形光束，椭圆形光斑的长轴通常称为快轴，快轴方向发散角可能达到 25-50 度，短轴通常称为慢轴，慢轴方向发散角为 10-20 度。通常需要在发光界面后立刻使用柱面透镜进行快轴准直，便可先抑制住发散最严重的方向，减少后续使用的透镜面积。 EEL 激光器的发散角 例如速腾 M1 是五个激光器，在每个激光器后紧跟一个快轴准直。在进行快轴准直后，再进行一次慢轴准直，激光将具有较好的直线性。 速腾 M1 激光雷达拆解图 镭神智能的一款激光雷达发射模组中采用 8 个 EEL 激光器，在每个激光器的出光口直接安装一个快轴准直镜，体积更小，仅有亚毫米尺度，肉眼基本无法直接分辨。 镭申智能激光雷达拆解 VCSEL 激光器的光束也会呈现圆锥形发散，发散角可以达到 20 度左右。如果采取这样的光束直接照射，则能量会很快分散殆尽，无法进行有效探测。 光纤激光雷达输出的圆形高斯光束 而针对光学校准，1550nm 路线再次展现了其优势。由于 1550nm 激光雷达使用光纤激光器，而单模光纤本身就具有极强的光学校准能力，因此 1550nm 激光器的光束质量较高，输出的几乎是完美的圆形高斯光斑。同时其发散角也较小，圆光纤的发散角只有 6 度多，通常只需要在光纤后加一个普通的球面凸透镜即可。 图达通 Falcon 激光雷达拆解图 分束器 Beam Splitter衍射激光分束器简称分束器（Beam Splitter）又叫做激光分束镜，激光分光镜，分光片，光束分束器。 激光分束器可以把一束准直的入射激光均匀地分配成 N 束出射光，输出光束会以特定的分离角度射出，出射光的光束直径、发散角和波前相位完全和入射激光相同，只是传播方向发生改变。并且分离角度极其精准，误差小于 0.03mRad。分束器的衍射效率介于 70~95% 之间，均匀性一般&lt;5%，很多情况下光束直径的能量差别&lt;1%。 EFL：有效焦距；θs：两个焦点之间的分离角度；θf：全角；D：光点阵列的长度 根据输出光斑的分布，分束器可以分为一维分束、二维分束、点阵分束，一维分束在激光加工中最为常用，例如激光一分二、一分三和一分四，都可以成倍地提高加工效率。 扩散片 Diffuser扩散片又称作扩散器、匀光片、匀化镜、光场匀化器 、Beam Homogenizer、Optical Diffuser、Beam Transformation System。其作用是将入射激光转化成任意形状尺寸的强度均匀的光斑。将激光束扩散成一个圆锥形，可以使激光雷达接收到更多的反射光，从而提高激光雷达的探测距离和精度。 d：成形光斑尺寸；D：光束直径；EFL=有效焦距； 匀光片在半随机方向上分裂入射光束，以便在远场或焦平面上获得所需要的强度分布形状。这种方法可以设计出能够产生精确发散角度和任意的输出光斑尺寸和形状以及强度分布的元件。匀光片产生的光斑的性能在很大程度上取决于入射光束参数。入射激光可以为单模或多模，衍射效率 70%~90% 不等。通过使用高&nbsp;$M^2$&nbsp;输入光束可以实现更高的均匀性。匀光片对光束尺寸，位移和元件倾斜不敏感。它具有高激光损伤阈值（元件被激光损坏的阈值），而均匀性和效率随设计而变化。 光束质量系数&nbsp;$M^2$&nbsp;是一个单位的参数，用于描述实际激光束的不完美程度。$M^2$&nbsp;值越接近于 1.0，光束就能被聚焦到其衍射限制的光斑大小。在激光加工工艺中往往要求以尽可能小的光斑聚集光束的大部分激光能量，因此激光光束质量&nbsp;$M^2$&nbsp;因子便是一个量化激光聚焦能力的参数。 扫描器 Scanner扫描结构中最常见的就是反射镜（如 MEMS 中的振镜，或者是因为结构设计而需要改变光路）、棱镜（为了实现扫描，通常使用电机转动棱镜）和单向透光发射镜（为了实现收发同轴，发射的激光从里到外通过半透半反镜，接收的激光从外到里经过反射，进入接收器光路），具体可以查看我之前的系列文章&nbsp;Yvon Shong：聚焦激光雷达（一）——扫描器。 振静方案：振镜通过摆动来扩散激光，但受制于机械振动的损耗控制要求，MEMS 振镜的振幅一般在 25 度左右，需要搭配光路扩散系统对出射激光进行放大，来满足对物体的覆盖要求。 转镜方案：复杂形状让面型精度成为关键。转镜方案通过多面体转镜的旋转来扩散出射激光，涉及多个镜片表面的相互胶合，其相邻界面处的平整程度会对光束反射效率造成影响。因此，转镜对于元件的制备精度要求更高。 视窗 Windows 车规环境要求视窗等元件具备疏水等抗干扰功能 视窗作为激光雷达最外部的光学元件，需具备一定的主动抗干扰能力，其次恶劣的环境需要这些滤波片能够经受很宽泛的温度范围（零下 40℃ 到零上 80 ℃），特别是车窗所面临的环境，还可能暴露在雨水、冰层、道路除冰盐以及其他所有路上驾驶时所能遇到的元素环境中。这就需要视窗同时镀有疏水膜、 增透膜、除雾膜等多种膜系以保障恶劣天气的性能稳定性。 此外，在车辆使用寿命内，这些滤波片需要在没有维护和校准的情况下，在上述环境状况中正常运行。 滤波片 Filter如果探测器是 LiDAR 系统的“眼睛”，那么光学滤波片就是“太阳镜”——减少眩光，让眼睛可以无背景干扰观察所寻求的目标。相信大家也在使用 iPhone 的过程中遇到很多鬼影现象，这其实就是镀膜设计问题在搞鬼。在实际使用中，LiDAR 的镀膜作为光学滤波片主要有两种功能： 激光透过率的要求 光学元件通过镀防反射增透膜来满足高透过特性，减少散射光、重影和背向反射，否则激光传输将产生很大光损，直接影响最终的探测效果。防反射增透膜是光学元件中最基础、最通用的镀膜技术。增透膜利用了光的干涉原理， 通过控制薄膜的厚度和折射率来实现光线的增透。这些镀膜专为提供更低反射率 (&lt; 0.5%) 而设计，因为低透光率的缺陷会在光路中被一层层放大，成倍影响最终打到物体上的激光效能。 增透膜的技术难度主要是对膜材的特定折射率要求和现实中膜材固有物理特性并不完全匹配。增透膜对薄膜厚度和折射率的要求被特定的物理公式限定，但现实的薄膜材料折射率由自身属性固定，二者只能近似，无法完全匹配。 理论上，最理想的透过率要求膜材的折射率等于空气折射率和元件折射率乘积的算数平方根。比如一般空气折射率在 1.0 左右，玻璃折射率在 1.5-1.7 左右，对应折算出理想膜材的折射率在 1.224/1.304 左右，但实际中并没有精准贴合理论要求的镀膜材料，这就要求光学企业通过合理的材料选择（同时还需考虑材料成本、机械稳定性等因素）、多层膜制备等技术手段来无限接近 100%透过率的理想目标。 905nm 带通滤波片的光谱性能曲线 特定波长透过的要求 光学元件需要依据干涉原理来满足分光特性，其高透射率波段要尽可能窄，过滤其他波段的干扰杂散光并保障特定波长激光顺利透过。 激光在膜材上表面和下表面的反射光相位差为 180 度。依据光学原理推导后要求薄膜厚度为特定透射光波长的四分之一奇数倍。这对于薄膜制备精度有着极高要求。 具体光学元器件可能造成的影响，其实在相机中更为常见，可以参考我之前的文章：Yvon Shong：键盘摄影（九）——光学像差。 Reference 炬光科技：Fast Axis Collimators (FAC) for LiDAR 炬光科技：准直模块 炬光科技：Beam Transformation Systems (BTS) 海纳光学：匀化器操作原理，匀光片应用手册 海纳光学：分束器原理及应用手册 海纳光学：分束器 海纳光学：衍射光学元件示意图 海纳光学：衍射光学元件 Optics for Hire：LIDAR Lens Design 奥林巴斯生命科学：Laser Systems for Optical Microscopy 益瑞电 Iridian：用于自动驾驶汽车的 LiDAR 和光学滤波片 面包板社区：激光雷达中的激光发射与接收光学原理 范娜娜, 王懋, 温少聪,等. 基于二维MEMS振镜的激光雷达系统的光学设计[J]. 光学技术, 2020, 46(3):5. 刘壮, 王超, 江伦,等. 低空高分辨率激光雷达光学系统设计[J]. 红外与激光工程, 2021. Choi H , Kim W C . Optical system design for light detection and ranging sensor with an ultra-wide field-of-view using a micro actuator[J]. Microsystem Technologies, 2020. Cheng Y, Cao J, Zhang F, et al. Design and modeling of pulsed-laser three-dimensional imaging system inspired by compound and human hybrid eye[J]. Scientific reports, 2018, 8(1): 17164. 中信证券：激光雷达产业深度研究 从拆解五款激光雷达看智能驾驶投资机遇 华西证券：激光雷达 汽车智能化中的黄金赛道 浙商证券：华为哈勃生态成员，全球激光雷达光源模组先行者——炬光科技深度报告 浙商证券：2022年永新光学研究报告 激光雷达重新定义光学元件技术壁垒 国海证券：2022年激光雷达行业研究 激光雷达BOM成本以主板和激光单元为主 bilibili 绿芯频道：全网首拆！自制光路图！小鹏G9激光雷达—速腾聚创M1，究竟怎么样？ bilibili 绿芯频道：两千美刀，直接拆掉！蔚来ET7激光雷达全网首拆｜Lidar拆解系列 2 欢迎在我的专栏「自律走行」中查看更多「聚焦激光雷达」系列文章 聚焦激光雷达（一）——扫描器 聚焦激光雷达（二）——激光器 聚焦激光雷达（三）——接收器 聚焦激光雷达（四）——光学元件 聚焦激光雷达（五）——处理器","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"lidar","slug":"lidar","permalink":"http://www.yvonshong.com/tags/lidar/"}]},{"title":"聚焦激光雷达（三）——接收器","date":"2023-04-01T15:30:00.000Z","path":"2023/04/01/focus-on-lidar-3/","text":"接收元器件是决定激光雷达性能的核心零部件之一，激光雷达靠激光器发射激光，然后探测器接收漫反射回来的光，利用光电效应将光信号转化为电信号，从而实现对光信号的探测。 可以看到接收探测器的根本原理是光电效应，目前车载激光雷达中的半导体探测器按照工作原理可以分为： PIN-PD：是在最基础的光电二极管的基础上扩宽了势垒区，价格低廉，结构简单，响应速度快，但没有增益，灵敏度有限。 APD：在 PIN 光电二极管的基础上，加上一定的反向电压，相当于人为增加了势垒，在外界光电效应的触发下，少量光生载流子引发雪崩效应电流倍增。输出电流与入射光子数量呈线性关系，相当于一个具有增益的光电二极管，这可进一步增大光检测的灵敏度，同时较大反向电压的作用也可进一步提高其响应速度，这就是雪崩光电二极管（APD），APD 已经是光通信技术中用来接收微弱光信号的一种基本器件。 SPAD：APD 工作电压在雪崩电压以上（盖革模式），每个入射的光子都会触发雪崩效应，灵敏度极高，甚至可以探测单个光子，但由于其工作于临界状态，需要配合猝灭电路设计，只能识别有无而无法识别强度，通常采用阵列的方式，利用多个传感器感知到光子的机率和时间来间接获得光强信息。 多个 SPAD 以阵列并联，就是硅光电倍增管 SiPM。 接收探测器原理要讲解接收器的原理，我们首先要复习一下 PN 结： 采用不同的掺杂工艺，通过扩散作用，将带空穴的 P 型半导体与带电子的 N 型半导体制作在同一块半导体。PN 结在漂移运动和扩散作用的双重影响下，电子多的区电子会向空穴多的区扩散，而遗留下了代表正电的空穴。相对的，空穴会从空穴多的区向电子多的区扩散，原位置便填补了带负电的电子。这导致结周围扩散到对方的多数载流子（自由电子与空穴）都耗尽了，结区载流子变得非常少，形成了耗尽层（Space Charge Region），留下的电荷密度等于净掺杂水平。耗尽层的宽度与材料本身性质、温度以及偏置电压的大小有关。在没有外加电压情况下（平衡状态、零偏置），跨结形成了电势差（内建电势，built-in potential）。 若施加在 P 区的电压高于 N 区的电压，称为正向偏置。在正向偏置电压的外电场作用下，N 区的电子与 P 区的空穴被推向 PN 结。这降低了耗尽区的耗尽宽，降低了 PN 结的电势差。 随着正向电压的增加，耗尽区最终变得足够薄以至于内电场不足以反作用抑制多数载流子跨 PN 结的扩散运动，因而降低了 PN 结的电阻。 跨过 PN 结注入 P 区的电子将扩散到附近的电中性区。 所以 PN 结附近的电中性区的少数载流子的扩散量确定了二极管的正向电流。正向偏置下，跨 PN 结的电流强度取决于多数载流子的密度，这一密度随正向偏置电压的大小成指数增加。 这使得二极管可以导通正向大电流。 若施加在 N 区的电压高于 P 区的电压，这种状态称为 PN 结反向偏置。 由于 P 区连接电源负极，多数载流子（空穴）被外电场拉向负极，因而耗尽层变厚。 N 区也发生类似变化。 并且随反向偏置电压的增加，耗尽层的厚度增加。 从而，多数载流子扩散过 PN 结的势垒增大， PN 结的电阻变大，宏观看二极管成为绝缘体。 以 P 型硅为衬底的 2DU 型光电二极管的原理结构图 基本的光电效应描述的是在由 PN 结组成的半导体器件上，光电效应类探测器吸收光子后，直接引起原子或分子的内部电子状态改变，即光子能力的大小直接影响内部电子状态改变的大小。 在反向电压作用下工作，在一般强度的光线照射下，所产生的电流为光电流。因而这类探测器受波长限制，存在“红外限”，截至波长为 $\\lambda_c=\\frac{h_c}{E}$， $h_c$ 为普朗克常数，E 在外光电效应（金属作为光阴极直接向外部发射电子）中为表面逸出功，在内光电效应（半导体内部以载流子光生效应为代表）中为半导体禁带宽度。也可以看出来，半导体材料决定了可以探测的波长范围。 PIN 光电二极管P-I-N 光电二极管, P-I-N Photo-Diode（PIN-PD），这是一种灵敏度比一般 PN 结光电二极管要高的光检测二极管它是针对一般 PD 的不足、在结构上加以改进而得到的一种光电二极管。 P-I-N 结光电二极管实际上也就是人为地把 P-N 结的势垒区宽度加以扩展，即插入一层低掺杂的纯度接近于本征半导体材料 I 层来取代势垒区，而成为了 P-I-N 结。产生光生载流子的有效区域增大，扩散的影响减弱，并且结电容也大大减小，所以其光检测的灵敏度和响应速度都得到了很大的提高。 雪崩光电二极管 APD为了能探测到微弱的入射光，我们希望光电探测器具有内部增益，即少量的光生载流子在倍增电场作用下能产生较大的光生电流。 在以硅或锗为材料制成的雪崩光电二极管通过施加高的反向偏置电压，射入的光被 PN 结吸收后形成光电流，施加反向偏压电压后会产生雪崩电离效，即可显示出内部电流增益效应，进而实现探测效果的放大，因此这种二极管被称为“雪崩光电二极管”。 为了解释雪崩电离效应，我们得先了解 PN 结在添加反向偏置电压时的情况： 反向偏置时会形成极其微弱的漂移电流，电流由 N 区流向 P 区，并且这个电流不随反向电压的增大而变化，称为反向饱和电流。 这是因为反向电流是由少数载流子跨 PN 结形成的，因此其值取决于少数载流子的掺杂密度。 由于反向饱和电流很小， PN 结处于截止状态，所以外加反向电压时， PN 结相当于断路。 当反向电压逐渐增大时，反向饱和电流不变。 但是当反向电压超过一定值时，PN 结的电阻突然减小，反向电流急剧增大， PN 结将被击穿。 因为反向电压过大，位于 PN 结中的载流子会拥有很大的势能，足以和中性粒子碰撞使中性粒子分离出价电子而产生空穴-电子对，然后导致链式反应，类似于雪崩，这样会导致 PN 结反向电流的急剧增大，发生雪崩击穿（Avalanche Breakdown）。 APD 典型结构 最简单的 APD 结构是在 PIN 光电二极管的基础上，对 P 区和 N 区都进行了重掺杂，在邻近 P 区或 N 区引进 N 型或 P 型倍增区。掺杂浓度越强所需电场越弱。 当掺杂浓度足够高时，在 PN 结两端加入弱电场就会使中性粒子中的价电子脱离原子的束缚，从而成为载流子，导致 PN 结的击穿。 由于其具有低功耗、小型化、高速、高可靠等技术特点，在微弱光及单光子探测领域占有重要地位，在量子通信、激光雷达以及激光三维成像等热点领域都有广泛应用。 单光子雪崩二极管 SPADAPD 的工作模式分为线性模式和盖革模式两种。在线性模式工作状态， APD 的偏置电压低于其雪崩电压，对入射光电子起到线性放大作用，反向电压越高，增益就越大。APD 对输入的光电子进行等有限增益放大后形成连续电流，获得带有时间信息的激光连续回波信号。 在盖革模式（Geiger Mode）下，偏置电压高于其雪崩电压，APD 增益迅速增加，此时单个光子吸收即可使探测器输出电流达到饱和，即在高于 APD 击穿电压的具有单光子探测能力的光电探测雪崩二级管 (Single Photon Avalanche Diode，SPAD）。 一旦触发，施加在 SPAD 的反向偏置电压不变的话，雪崩持续进行，产生无限的增益，即一个光子引起连续的电流，所以放电一旦开始，就需要迅速自淬灭，通过配套淬灭和读出电路对雪崩倍增过程进行淬灭和恢复控制，从而实现单光子探测。这意味着哪怕周围昏暗的环境或远处照射过来的光线致使射入传感器的光子强度很弱，通过雪崩倍增现象传感器仍旧能够将光子增幅并将其识别为大量的光子。 探测到的 SPAD 光计数值，实际上对应于同时检测到的一个或者多个光子事件的发生，这种事件发生的确切数目是无法被分辨出来的（事实上是点击事件探测器）。但可以在时间的尺度上利用对 SPAD 的猝灭和充电机制的预测，来估计所探测到的光子的数量。例如在时间尺度上，撞击的光子数是呈指数型增加变化的。 APD 盖革模式工作原理 目前 SPAD 中最常使用的半导体材料是 Si 材料和 InGaAs 等 Ⅲ-Ⅴ 族化合物材料。SPAD 具有高探测效率、低暗计数率、低成本等特点，在量子通信、激光雷达等领域得到广泛应用。 SPAD 的像素电路设计中包括主动猝灭和充电、屏蔽和门控策略： 猝灭和充电：单个入射光子可以激活 SPAD，从而产生持续的电流。但正在进行放电的 SPAD 不需要再对光敏感，而又要探测未来的下一个入射光子，有必要实现猝灭，再次将 SPAD 重新设置为截止或光敏状态，中间间隔的时间为死区。有源猝灭和充电可以被用来优化一个 SPAD 的检测周期，通过控制减少死区时间，从而提高检测周期的最大计数率。此时有源电路可以用来阻止雪崩的发生，并且可以比被动电阻方法更早地给 SPAD 充电。这不仅限制了流经二极管的电荷量，从而提高二极管的使用寿命，而且这种方法还可以减少寄生脉冲的发生。 掩膜：可以被用来实现选择性的禁用或者导通阵列中的特定像素的探测单元，该方案通常用于具有多个像素共享电路的设计中，以避免因特殊噪声像素的过载而导致的整体性能降低的问题。这也可以备用实现对 SPAD 进行开关控制，从而可以防止不必要的雪崩的发生，或者可以将像素单元与读出电路断开，消除潜在的串扰。 门控：像素体系结构中一个独立的设计元素，它指的是在有限的时间内控制 SPAD 的开关，这个时间窗口可达到皮秒量级。其最大意义在于可以实现时间分辨探测。例如在具有重复（脉冲）照明的装置中，门控允许在重复周期的某个特定周期内选择性地捕获光子，从而实现了在皮秒级移动门控窗口来精准控制检测时序的功能，或滤除不感兴趣时间的那部分光子响应。 硅光电倍增管 SiPMSPAD 阵列通常可分为两类： 一类直接将单独的 SPAD 组成阵列，通过光子出现的频率来测算光场强度，该种方式灵敏度高，但后端的电路复杂度也略高。 另一类则将 SPAD 并联，成为一个单独的模块，进而可以探测到光强信息，称为硅固态倍增管（SiPM）也称为多元光子计数器（Multi-Pixel Photon Counter， MPPC），是一种基于多元微通道技术的硅基固态电子倍增器件。 它由成百上千甚至上万个 SAPD 和淬灭电路并联组成 SiPM 的二维像素单元，其中每一个像素单元都可作为单独的光子计数器使用，灵敏度只是略低于 SPAD 阵列，但逻辑电路也较简单，增益高、偏置电压低、成本低、集成度高、抗干扰能力强、对磁场不敏感、结构紧凑等特点，已在正电子发射断层扫描技术、高能物理学实验核医学等不同应用中部分替代了传统的光电倍增管，也在如激光光谱学、量子信息技术、激光雷达技术等单光子或少量光子探测技术中得到应用。 材料和波长探测器能探测到的波长取决于自身使用的材料，通常使用 Si、Ge、InP、InGaAs、InGaAsP 等不同种类三五族元素。 905nm 波段的激光目前的主流方案是配合硅基材料，硅基材料的晶圆成熟，成本低。905nm 波长下 SPAD 的工作电压低，可采用低压电路，价格低廉，灵敏度高，且后端的处理电路相对 APD 更简单，采用阵列化的方式，探测效果逐步可以媲美甚至超越 APD，随着 SPAD 阵列的规模不断做大，该产品路线已经日益成为玩家们首选。 而 1550nm 波段的激光则需要铟镓砷等材料探测，铟镓砷等材料由于工艺难度、晶圆尺寸和使用场景的限制，成熟度没有硅基高，厂商通常使用线性 APD 或者线性 APD 阵列作为探测元件，成本较高。 在 SPAD 和 SiPM 阵列之间，厂商通常通过不同的需求来适配不同种类的产品。SPAD 系统成本较 APD 低，且体积更小适合大规模量产，可采用低压电路，灵敏度高，且后端的处理电路相对 APD 更简单。SiPM 电路结构简单，系统成本和探测成本均较低。SPAD 和 SiPM 有望替代 APD 成为主流。 探测器的灵敏度、是否能获得光强信息、价格、接收器的信息处理效率都是厂商需要斟酌的内容。 类型 PIN PD APD SPAD SiPM/MPPC 增益 1 &lt;100 1e6 1e6 探测范围 短距 中长距 中长距 中长距 电路结构 复杂 复杂 复杂 简单 成本 探测器成本低 系统成本高 探测器成本高 系统成本高 探测器成本高 系统成本高 探测器成本中 设计冗余 信号完整性 信号完整性 温度补偿 信号完整性 淬灭电路 温度补偿 光谱范围 硅：&lt;1200nm 铟镓砷：&lt;2600nm 硅：&lt;1150nm 铟镓砷：&lt;1700nm 硅：&lt;1150nm 铟镓砷：&lt;1700nm &lt;950nm 探测速度 快 快 中，受限于恢复时间 中，受限于恢复时间 工作电压 &lt;10V &lt;200V &gt;150V &lt;80V 噪声 探测器噪声低 系统噪声高（受限于放大器） 探测器噪声低 系统噪声高 （受限于放大器） 探测器噪声高 探测器噪声高 系统噪声低 其他单光子探测器 光电倍增管 PMT: 光阴极是由逸出功较小的碱金属化合物镀膜形成，光阴极在一定能量的光子照射下发生外光电效应，将光子转化成发射的电子，电子在电场约束下通过电子光学系统进入倍增级，电子通过电场加速后轰击倍增级表面的二次电子材料实现电子的倍增，电子信号经过多级倍增达到 1e5~1e9 倍的放大。 光子探测器其实不只是应用于激光雷达中，也存在其他构型，除了半导体二极管，还有： 基于外光电效应的光电倍增管。是基于外光电效应和二次电子发射理论的真空器件，广泛应用于微弱光子探测。因为处在阳极 Anode 和阴极 Cathode 之间，所以英文命名为打拿极 Dynode。光阴极是由逸出功较小的碱金属化合物镀膜形成，光阴极在一定能量的光子照射下发生外光电效应，将光子转化成发射的电子，电子在电场约束下通过电子光学系统进入倍增级，电子通过电场加速后轰击倍增级表面的二次电子材料实现电子的倍增，电子信号经过多级倍增以后可以达到 1e5~1e9 倍的放大，最后放大后的信号被阳极收集输出。包括打拿极 PMT、微通道板（Micro Channel Plate，MCP） PMT 等。 超导器件。基于超薄超导材料制备的 SNSPD 的基本原理是超导纳米线吸收光子后会出现有阻的局域非平衡点“hot-spot”，从而导致超导纳米线两端产生电压脉冲信号，通过光电转换实现单光子探测。SNSPD 理论上具有接近 100% 的系统探测效率。包括超导纳米线单光子探测器（Superconducting Nanowire Single-Photon Detector，SNSPD）、超导临界温度跃迁单光子探测器（Transition Edge Sensor，TES）等。 量子器件。包括量子阱（Quantum Well，QW）单光子探测器、量子点（Quantum Dot，QD）单光子探测器。 非线性器件。包括自发参量下转换（Spontaneous Parametric Down Conversion，SPDC）单光子探测器、频率上转换单光子探测器等。 二维材料 2D APD：二维层状材料与传统的体材料相比，具有自钝化表面、强光物质耦合、可调费米能级和机械灵活性等优良特性，并且材料特性可随着厚度不同而不同。包括二维层状石墨烯材料、二维过渡金属硫化物和二维黑磷。 CMOS/CCD：PMT 和 APD 都属于点探测器，只能探测光子信息，可以通过扫描方式测光谱。我们熟悉的相机中的 CCD 和 CMOS 属于面阵探测器，可以成像。 各种倍增级特性，不同类型的 PMT 针对不同的应用场景需求 微通道板 MicroChannel Plate PMT 与打拿极 PMT 的不同之处在于其采用微通道板代替传统的分离式多级倍增极。MCP 内包含成百上万个微通道（直径一般为 6μm～25μm），每个微通道里都涂有二次电子发射材料，可视为一个单独的二次电子倍增器。目前技术比较成熟的 MCP-PMT 为近贴聚焦型，相对打拿极 PMT 来说具有增益高、抗磁能力强等突出特点。 MCP 光子探测器原理结构示意 Reference 程碑彤, 代 千, 谢修敏,等. 单光子探测器的研究进展[J]. 激光技术, 2022, 46(5):9. 潘京生. 微通道板光子探测器及其时间分辨的影响因素[J]. 激光- 与光电子学进展, 2021, 58(17):1700006. 马鹏阁. 多脉冲激光雷达[M]. 国防工业出版社, 2017. 激光与红外杂志：单光子探测器研究现状与发展综述 USTC课件：光电探测器 wikipedia：光电效应 wikipedia: 耗尽层 wikipedia：PN结 wikipedia：光电二极管 wikipedia：雪崩光电二极管 滨松中国：光电倍增管的基础及应用（中文版） 滨松中国：光电倍增管的基本原理 光电汇：固态激光雷达的前世今生 智能汽车资源网：关于激光雷达中光电雪崩二极管（APD）的应用 华强电子网：光电APD探测器 讯石光通讯网：雪崩光电探测器(APD)的现状及前瞻 知乎专栏：李工谈元器件：什么是光电二极管？光电二极管相关知识详解，图文结合，通俗易懂 麦姆斯咨询：SPAD会成为未来激光雷达的光电探测标配吗？ 罗姆半导体社区：硅光电二极管的结构与特性 智能汽车资源网：激光雷达探测器详述 诺为光科：光电倍增管大家族概览 欢迎在我的专栏「自律走行」中查看更多「聚焦激光雷达」系列文章 聚焦激光雷达（一）——扫描器 聚焦激光雷达（二）——激光器 聚焦激光雷达（三）——接收器 聚焦激光雷达（四）——光学元件 聚焦激光雷达（五）——处理器","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"lidar","slug":"lidar","permalink":"http://www.yvonshong.com/tags/lidar/"}]},{"title":"聚焦激光雷达（二）——激光器","date":"2023-03-28T13:00:00.000Z","path":"2023/03/28/focus-on-lidar-2/","text":"之前我们讲述了激光雷达扫描器件的原理，而作为激光雷达的发射器，我查阅了很多教材、论文、厂家说明文档、行研报告和科普文，发现没有一篇写得比较系统的科普文章，因为并没有找到读到一篇就能讲透的文。教材讲得很深入，但不同教材侧重点又不同，为了深入剖析激光雷达，梳理我自己的知识系统而写本篇。如有问题，请各位不吝指正。欢迎点赞关注后再收藏。 激光器原理所有激光器都包含以下三个组件：1、泵浦源；2、受激介质；3、谐振腔。 受激介质位于激光器内部，取决于不同的激光器结构设计，受激介质是一种包含可将激发光的能量转换为激光的原子的物质，可能是气体混合物 、固体晶体棒或玻璃纤维。激光介质在获得泵浦源从外部获得的能量供给时，受激产生能量辐射。 被激发的介质位于谐振腔两端两个镜子的中间位置，其中一个镜子是半透半反镜，受激介质产生的能量辐射在谐振腔内放大，与此同时，只有特定的辐射光能够穿过单向透镜，形成一束辐射光，这一辐射光束即是激光。 激光的原理 泵浦源泵浦源的作用是对增益介质进行激励使其辐射发光。具体而言，泵浦源提供能量激励原子跃迁到高能级，以实现粒子数反转（使高能态粒子数多于低能态粒子数），被激发的粒子会自发对外辐射激光从而由高能级向下跃迁，回到稳定形态。 激光的产生应满足两个基本条件：有较好的发光效率；泵浦源的光谱分布与激光增益介质的吸收光谱相匹配。常见的有以下 4 种:光学激励(光泵浦)、气体放电激励、化学激励、核能激励。 光学激励：利用外界光源发出的光来辐照激光工作物质以实现粒子数反转的，整个激励装置，通常是由气体放电光源(如氙灯、氨灯)和聚光器组成。如固体激光器等。 放电激励：对于气体激光工作物质，通常是将气体密封在细玻璃管内,在其两端加电压,通过气体放电的方法来进行激励，整个激励装置通常由放电电极和放电电源组成。如惰性气体放电灯（灯内充入氙、氪等惰性气体）、金属蒸气灯（灯内充入汞、钠、铒等金属蒸气）、卤化物灯（碘钨灯、镊钨灯、半导体激光器等。 化学激励：化学激励是利用在激光工作物质内部发生的化学反应过程来实现粒子数反转的，通常要求有适当的化学反应物和相应的引发措施。 核能激励：核能激励是利用小型核裂变反应所产生的裂变碎片、高能粒子或放射线来激励激光工作物质并实现粒子数反转的。 半导体泵浦源单元器件的主要封装形式包括单管（单发射腔）、bar 条。单元器件的综合特性决定了最终泵浦源模块的输出光功率、转换效率以及体积等。单管只有一个发光区，是将激光芯片封装后形成的发光单元，通常在 3~300μm。 bar 条可以看做是多个半导体单管并排在同一衬底上形成的激光器单条，通常 1cm 长，泵浦功率更高。 通过光束整形和传输，耦合成具有各种不同泵浦光功率密度、光束传输模式、光斑形状和光强分布的泵浦源，进一步，bar 条按排列形式，耦合成具有各种不同泵浦光功率密度、光束传输模式、光斑形状和光强分布的泵浦源。 由于半导体激光器叠阵工作时会产生大量的废热，因此必须采用冷却手段降低器件温度，防止温度过高导致激光器失效和使用寿命缩短。目前主要有两种冷却方式：帕尔贴形开放式制冷以及水等高效载冷剂方式。具体采用哪种散热制冷方式应该根据器件的输出功率、工作环境和应用方式确定。 提高半导体激光泵浦源单元器件输出功率和转换效率的方法主要从芯片结构上采用大光腔外延结构、宽条形结构、腔面钝化、增加腔长等措施，同时提高激光器的材料生长质量和优化散热封装技术也是关键。 媒质被泵浦源激发，然后发光的物质，其物理特性会影响所产生激光的波长等特性。 气体激光 $CO_2$ 激光是以 $CO_2$ 气体为媒质的激光。在填充有 $CO_2$ 气体的管内，配置电极板，以产生放电。电极板连接外部电源，使其可投入高频率电力作为激发源。因电极间放电而在气体中产生等离子体， $CO_2$ 分子会变换为激发态，该数量增加后开始受激辐射。此外，为了让光往返而产生振荡，相对设置一对镜面，则构成了谐振腔。光会在全反射镜和输出镜之间往返，放大后输出为激光。振荡波长一般为 10.6μm。气体成分构成为 $CO_2$ 在 10% 以下、氮 $N_2$ 在 30% 左右、氙 $Xe$ 在百分之几、其余为氦 $He$ 。各气体有其各自的功能，根据构造和激光的特性不同而改变成分。 固体激光固体激光器基本上都是由工作物质、泵浦系统、谐振腔和冷却、滤光系统构成的。 固体激光工作物质是绝缘晶体，一般都采用光泵浦激励。目前的泵浦光源多为工作于弧光放电状态的惰性气体放电灯，泵浦灯在空间的辐射都是全方位的，因而固体工作物质一般都加工成圆柱棒形状，所以为了将泵浦灯发出的光能完全聚到工作物质上，必须采用聚光腔。固体激光器的泵浦系统还要冷却和滤光，也有使用激光二极管作为光泵浦的。 YAG 激光器和 YVO4 激光器 半导体激光 半导体激光器的典型 EEL 结构 可以看到，它是一个半导体 PN 结二极管。因此半导体激光器也被称为激光二极管 （Laser Diode, LD）。有源区 Active Region 是一层薄的光波导芯层 ，厚度通常小于 1μm。上下两侧为折射率较低的波导包层 Cladding，分别为 P 型和 N 型半导体。激活区左右两侧为掩埋层 Burying，其作用是限制激活区的条宽 ，以降低工作电流。通常基横模 LD 的条宽仅为 25ｍｍ。经典的 FP 型激光器反射镜面由半导体晶体的解理面构成，典型腔长仅为 0.5mm ，芯片典型宽度仅为 0.30.5mm。芯片两面制备了减小接触电阻的金属层，即欧姆接触层 Ω Contact 。当电流从 P 面注入二极管时，就可以从它的解理腔面中发出激光 。可见，半导体激光器具有体积小、重量轻的突出优点。 半导体激光器增益谱很宽，FP 腔没有纵模选择的功能，因而普通的 FP-LD 难以实现单纵模工作。众所周知，光栅的衍射具有优越的选频特性 。人们利用半导体工艺将光栅与半导体激光器的有源区结合在一起 ，研制成功以分布反馈 （Distributed Feedback，DFB）激光器、分布布拉格反射 （Distributed Bragg Reflector, DBR）激光器为代表的单片集成单频激光器 。DFB 激光器具有极好的单纵模工作特性；DBR 激光器在保持单模工作的同时 ，具有大范围的可调谐特性 。 这两种器件在技术上和产品化方面都取得了成功 。根据多层介质膜滤波器的原理和半导体异质结生长技术，人们又研制成功垂直腔面发射激光器 （Vertical Cavity Surface Emitting Laser, VCSEL ）。它不仅具有优越的单频运转特性 ，而且大大改善了输出光束的方向性和调制响应 。 光纤激光光纤激光 Fiber Laser 使用掺杂稀土元素的光纤为媒质，通常以半导体激光器作为能量泵浦源，是长距离通信的中断放大技术发展为高功率输出激光的产物。光纤由中心传输光的核心和以同心圆状包覆核心的金属包层构成。光纤激光以该核心为激光媒质放大光。发射的光不能被硅吸收，因此需要使用铟镓砷 InGaAs 为衬底的接收器。摻杂不同稀土元素的光纤接受泵浦的波长和发射的波长存在差异。 由于光纤激光器的增益介质形状特殊且具有典型的技术和产业优势，行业中一般将其与其他激光器分开进行研究。使用光纤激光器的激光雷达具备优异的探测性能，但由于产业链尚未成熟且制造原材料价格昂贵，在大规模上车前仍需实现大幅降本。 光纤激光结构示意图 光纤激光通过激光二级管（Seed LD）产生的脉冲光作为种子光源（Seed Light），然后通过多个光纤放大器进行放大。各 LD 为低功率输出，因此具有热负荷较小的优点，实现了长寿命。此外，该 LD 数量越多，越可实现高功率输出的激光。 采用光纤光栅作为谐振腔反射镜，消除了腔镜与光纤介质之间耦合的消耗，实现了激光器核心部件的全光纤集成，提高了激光器的效率及稳定性。同时，光纤光栅可以改变反射性质选择特定频率进行输出，适用性更广泛。 光纤合束器主要作用是进行光束合成增大输出功率。光纤合束器可以分为功率合束器和泵浦合束器。功率合束器将多路单模激光合束到一根光线中输出，以提高激光的输出功率；泵浦合束器主要是将多路泵浦光合束到一根光线中输出，主要用来提高泵浦功率。 光纤激光器种类很多，从光纤结构上可分为单包层光纤激光器、双包层光纤激光器、光子晶体光纤激光器和特种光纤激光器。 从增益介质上可分为塑料光纤激光器、稀土类掺杂光纤激光器、非线性光学型光纤激光器、光纤受激拉曼散射激光器和晶体光纤激光器。 从输出激光特性上可分为连续光纤激光器和脉冲光纤激光器。 具体来看，光纤激光器的优点包括 轻量化及高灵活柔绕性：光纤体积小且可以弯曲，因此集成时可以通过光纤运输光束以实现灵活安装； 可实现大功率：光纤的几何形状具有很大的“表面积/体积”比，散热快，可以在更高功率的情况下工作，有效探测距离及精度均会提高； 光束质量高：光纤的波导结构决定了光纤激光器易于获得单横模输出，且受外界因素影响很小。激光介质本身就是导波介质所以耦合效率高；利于光纤通信系统的应用，同时可借助光纤方向耦合器构成各种柔性谐振腔，使激光器的结构更加紧凑、稳定；光纤还具有相当多的可调谐参数和选择性，能获得相当宽的调谐范围和相当好的色散性和稳定性。 缺点方面，相较于半导体激光器仅需要电激励即可实现直接的电光转换，光纤不能够直接实现电光转换，需要使用半导体激光器作为光泵浦，因此光纤激光器的电光转换效率天然低于半导体激光器。此外，光纤激光器还需要配套使用铟镓砷探测器，这将提升激光雷达的制造成本。 谐振腔 谐振腔原理示意图 谐振腔的作用是筛选一定方向光子并进行放大。介质被泵浦源激活后会产生不同方向的光子，传播方向与谐振腔横轴线不同的光子将逃逸出腔体，沿横轴线运动的光子将在腔内往返产生振荡，为把激光引出腔外，其中一面反射光栅为部分反射，透射部分成为发出的激光。反射部分留在腔体内继续振荡，与受激发粒子相遇后发生辐射，不断增殖最终形成传播方向一致、频率和相位相同的发射激光。 内腔光反馈法具有紧凑结构的高功率窄线宽半导体激光器是目前各国研究人员的关注热点，其中 DFB 半导体激光器和 DBR 半导体激光器是实现窄线宽半导体激光器的重要手段。 法布里-珀罗型 Fabry-Perot 激光器 FP 激光器示意图 法布里-珀罗激光器（FP-LD）是最常见、最普通的半导体激光器，它的谐振腔由半导体材料的两个解理面构成。其反射镜只是激光芯片末端的平面裂开表面，发出多纵模相干光的半导体发光器件，目前光纤通信上采用的 FP-LD 的制作技术已经相当成熟。 FP 激光器 3D 结构示意图 FP-LD 的结构和制作工艺最简单，成本最低，主要适用于 1310/1550nm 波段下的低速率短距离通信，传输距离一般在 20km 以内，存在损耗大、传输距离短的问题。 分布反馈式 DFB 激光器实现动态单纵模工作的最有效的方法之一就是在 FP 激光器的基础上，在半导体内部建立一个光栅滤光器件（布拉格光栅是一种周期性，作为波长选择镜的微结构，光源被注入到光纤后，只有布拉格波长的光会被光栅反射）。DFB 激光器的特点在于光栅分布在整个谐振腔中，光波在反馈的同时获得增益，因此其单色性优于一般的 FP-LD。 DFB 激光器示意图 分布反馈激光器通常将布拉格光栅结构分布于整个谐振腔中，其主要起到光反馈选模及增益的作用。主要用于高速中长距离传输。这种激光器具有优越的光谱特性和可高速调制特性等优点，使其广泛应用于高精度探测、光通信等领域。 DFB 激光器 3D 结构示意图 目前 DFB 半导体激光器主要研究在有源区附件构建光栅的二次外延分布反馈(Re-Grown DFB, RG-DFB)激光器，以及在外延芯片 P 面光波导表面或者侧壁直接刻蚀光栅，形成表面光栅分布反馈(Surface Grating DFB, SG-DFB)激光器这两种结构。这两种结构的共同点都是将布拉格光栅结构分布于整个谐振腔中，其主要起到光反馈选模及增益的作用。 二次外延分布反馈半导体激光器 RG-DFB二次外延分布反馈激光器 RG-DFB 激光器通常采用二次外延技术在 N 型或 P 型波导层生长完成后，采用光刻和刻蚀的手段在其 N 型或 P 型波导层上构建一组低折射率光栅结构，之后将芯片放入外延设备中继续完成生长工艺。这种二次外延光栅分布在有源区附近，有利于光栅与光模式场的高效耦合，可有效降低散射损耗，提高耦合效率，实现频率选择和线宽压缩，但是二次外延技术可能引入芯片结构缺陷，影响芯片的可靠性和成品率。 表面光栅分布反馈半导体激光器 SG-DFBSG-DFB 激光器是在外延芯片 P 面光波导表面 (BA-DFB) 或者侧壁 (LC-DFB) 直接刻蚀光栅，形成表面光栅分布反馈半导体激光器，可保证波导内的光模式场与光栅充分耦合反馈，利用散射效应抑制高阶模式，实现波导中单模振荡，SG-DFB 的研制难点是光栅结构的设计与制备，要充分考虑光栅基本参数对激光器性能的影响。 分布布拉格反射 DBR 激光器 分布布拉格反射激光器的谐振腔由集成于端面的反射光栅结构和增益区构成，其与法布里-珀罗(F-P)腔类似，在增益区的一端或两端构建布拉格光栅，代替 F-P 激光器的一端或者两端腔面反射镜，光栅只相当于一个反射率随波长变化的反射镜，由于光栅结构对满足布拉格条件的光模式具有极强的反射作用，因此可以通过对光栅区的耦合系数进行优化，获得理想的最大反射率和反射谱宽度，实现 DBR 激光器的单纵模、窄线宽工作。 DBR 激光器 3D 结构示意图 目前窄线宽分布布拉格反射半导体激光器主要采用表面布拉格光栅结构作为反射镜实现频率选择作用，通过合理设计光栅结构参数，获得理想的光栅反射率、反射率半宽和光栅中光波相位变化等光电特性，实现窄线宽输出的 DBR 半导体激光器。这种表面 DBR 激光器相比于传统的多次外延 DBR 激光器的优势就是避免了不同区位波导间耦合效率低下的问题，降低了制备工艺复杂程度，提高了 DBR 激光器的应用价值。 外腔半导体激光器基于外腔光反馈技术的窄线宽半导体激光器 (External Cavity Laser，ECL)，是一种采用外部光学元件对半导体激光芯片的出射光进行反馈和选频，增加谐振腔有效长度，提高激光器谐振腔的品质因子 Q 值，降低激光线宽，又因其采用无源光学元件进行频率选择和光反馈，更容易实现低相位噪声和高温度稳定性，是空间相干通信、相干探测、高精度传感等应用领域的理想光源。 ECL 可有效避免内腔集成光栅的光波衍射与散射损耗，但是其对外部光学选频元件耦合光路与工作环境的稳定性要求较高，其中外部光学选频元件作为 ECL 的核心装置，主要包括: 1、采用激光全息技术在特殊光敏玻璃中制作的体全息光栅、体布拉格光栅等衍射光栅元件；2、低损耗 F-P 波导、镀膜反射镜及采用飞秒激光技术加工的光纤光栅波导等波导型反馈元件。 以下两种外腔反馈激光器都是采用外部光反馈元件实现激光频率的选择和线宽的压缩，线宽水平都能达到 kHz 量级。而外腔光栅反馈半导体激光器的优势就是通过调整光栅位置就能实现波长调谐，有效降低半导体激光器线宽，并获得低噪声光谱特性，同时由于光路耦合效率高，更易于实现高功率输出，应用前景更加广阔。 外腔光栅反馈半导体激光器选用衍射光栅作为反馈元件的外腔激光器通常会采用 Littrow 或 Littman 结构，这两种结构外腔激光器的谐振腔通常由半导体激光芯片、光学透镜或反射镜、闪耀光栅或者全息光栅等光学元件构成。 Littrow 结构和 Littman 结构 外腔半导体激光器结构示意图 Littrow 结构 ECL 通常由半导体芯片、光学透镜和衍射光栅构成，通过改变光栅角度 θ，使某一特定波长光波反馈回半导体激光芯片，大幅提高其余波长光波的衍射损耗，同时改变谐振腔整体长度，实现波长稳定的窄线宽激光输出。在获得窄线宽输出的同时，可获得相对较高的输出功率。除此结构，还有直接采用体(全息/布拉格)光栅作为光反馈元件的外腔激光器。 Littman 结构 ECL 通常由半导体芯片、光学透镜、衍射光栅和反射镜构成，其中反射镜起到调谐器作用，光栅固定不动，通过改变反射镜角度，将入射光沿入射光路返回，光波经过光栅二次衍射后，边模抑制比大幅提高，激光线宽进一步窄化，但其结构比 Littrow 结构 ECL 复杂，导致功率损耗大，不易于实现高功率输出。 Littrow 结构和 Littman 结构 外腔半导体激光器 3D 结构示意图 外腔波导反馈半导体激光器基于外腔波导反馈技术的窄线宽激光器，主要通过耦合外部低损耗波导或光纤光栅波导，增加激光器谐振腔的长度，提高激光器谐振腔的品质因子 Q 值，达到降低激光器线宽的目的。 外腔波导反馈半导体激光器 3D 结构示意图 垂直腔面发射激光器图为其典型结构图，其上下分别为分布布拉格反射（DBR）介质反射镜，中间（InGaAsN）为量子阱有源区，氧化层有助于形成良好的电流及光场限制结构，电流由 P、N 电极注入，光由箭头方向发出。其激光垂直于顶面射出，与激光由边缘射出的边射型激光有所不同。 VCSEL 结构示意图 它是在由高、低折射率介质材料交替生长成的分布布拉格反射器（DBR）之间连续生长单个或多个量子阱有源区所构成。 典型的量子阱数目为 3~5 个，它们被置于驻波场的最大处附近，以便获得最大的受激辐射效率而进入振荡场。 在底部还镀有金属层以加强下面 DBR 的光反馈作用，激光束从顶部透明窗口输出。 VCSEL 3D 结构示意图 因此相较于边射型激光器，VCSEL 激光器具有低阈值电流、稳定单波长工作、可高频调制、容易二维集成、没有腔面阈值损伤等优点，在半导体激光器中占有很重要的地位。 波长激光发射器影响激光雷达产品的核心性能。激光器的原理是增益介质（工作物质）通过吸收激励源（泵浦源）的能量而产生光子，通过光学谐振腔的放大形成激光光束。增益介质和光学谐振腔共同决定了所发出激光的波长。对于激光雷达激光器而言，性能上希望激光器实现较高的发射功率密度、较低的温升、较小的温漂系数、以及较高的光束质量等指标，成本上希望本身激光器的加工以及后续的配套都能实现低成本化。 功率密度：功率密度决定同样尺寸的器件能发出多强的激光。目前供应商均致力于通过多节方案，即将半导体激光器内的多个有源区通过隧道结串联起来，来成倍提升功率，同时大幅提高器件发光效率。 温漂系数：半导体均存在一定的光热效应，不同温度下，激光器发出激光的波长会有微小的漂移，漂移的幅度被称为温漂系数。实际应用中，激光雷达前端的滤波片亦需要将这部分“漂移”的波长范围考虑在内，被迫提升滤波宽度，影响激光雷达的信噪比。因此激光器厂商们致力于通过各种方式降低激光器的温漂系数。 光束质量：即光斑的形状和能量分布，最好是规整圆形以方便测距使用。 光谱宽度：又称为激光线宽，即激光的色彩纯度。激光雷达接收端会用滤波片将其他波长的光过滤掉，探测激光的线宽越窄意味着抗干扰性越强，信噪比越高。 根据激光波长分类，适用于汽车激光雷达系统的激光器主要可以分为 850nm、905nm 以及 1550nm 三种方案，不同波长方案的选择主要需要从涉及到安全性、性能及成本的多个维度考量。 功率问题：通常由其对人眼的安全性决定；外界光的干扰情况；激光器本身的制备难度和成本问题等。 人眼安全： 905nm 及以下波长的激光接近可见光，不能被人眼晶状体和角膜吸收，可穿透人眼的透明部分直达视网膜，这期间人眼屈光介质能将入射光束汇聚成极小的光斑，灼伤风险大。人眼安全峰值功率为 6W。探测距离一般为 150m~200m。而 1550nm 激光在经过人眼角膜等部分就被大量吸收，不会触及视网膜。在同等人眼安全要求下，可以采用比 905nm 激光雷达高 40 倍以上的发射功率，进而大幅提升探测距离，通常在 200 米以上。 抗干扰性：850nm 方案为主流技术路径中水汽穿透性最好的方案，因此最大功率有限，导致产品探测距离较近。受限于安全功率，850nm 方案的有效探测距离较近。但因为波长更短，850nm 激光更难被空气中的水汽吸收，这有助于提高在潮湿场景下的自动驾驶可靠性。1550nm 所在的波段太阳辐射强度相对较弱，面临的光干扰更小，可获得更好的探测效果。 硅光芯片适配度：1550nm 激光可在硅基介质中传播，是光通信中最常见的一种波长，可完美的与硅光产品配合，更容易实现芯片化。 成本和生产效率：相比 905nm 激光器可直接采用半导体激光芯片耦合封装制备，1550nm 须采用光纤激光器来提升光束质量和功率，光纤激光器结构复杂。 发射和接收所用半导体材料：波长在 800-1000nm 范围的接收端可以用半导体材料，发射端用砷化镓；而 1000nm 以上波长的光由于发射端用磷化铟 InP 的 EEL，由于硅基光电探测器在 1000nm 以上波长工作时的光敏感性极低，接收端需要用锗或者铟砷镓 等材料的探测器，且供应链成熟度仍然不高，产品良率也仍需提升，导致其整体成本远高于 905nm 激光器。 发光方向通常 905nm 波长激光可选择半导体激光器。能够被硅吸收，可使用以硅为衬底的探测器。半导体激光器相较于前辈如固体、气体、液体激光器等有体积小、重量轻、功耗低、可靠性高、寿命长等特点。根据半导体激光器的发光方向可以分为出光方向平行于衬底平面的边发射激光器 (EEL) 和垂直于衬底平面的垂直腔面发射激光器(VCSEL）。这其中，EEL 激光器凭借其成熟的产品和供应链体系，极高的功率密度，成为目前主流的激光器形式。 边发射激光器 EEL 和面发射激光器 VCSEL EEL边发射激光器中就包含 FP、DFB、DBR、双异质结，量子阱等激光器。EEL 的光斑是椭圆的，特点是功率高——光电效率高、照度高（峰值功率 125W），但是激光的光谱稍宽。技术成熟且具备高发光功率密度， 950nm 的 EEL 方案是当下激光雷达厂商的主流选择。 成本上，生产成本方面， EEL 激光器由于激光从侧面发射，使用过程中需要进行切割、翻转、镀膜、再切割的工艺步骤，需要单颗一一贴装，人工成本较高。 配套成本方面，由于 EEL 发射的光斑为椭圆形，整形难度较高，并且需要分立的光学器件进行光束整形，依赖产线工人的手工装调，成本高一致性难以保障。 VCSEL无论是常规的 FP 腔半导体激光器 ，还是高性能的 DFB、EBR 激光器，激光振荡的方向都与生长的 PN 结有源区平行，激光都从半导体材料的解理面输出 。 这样的结构充分利用了有源区的增益 ，具有效率高、输出功率大的优点 。但是也有缺点，一是发光区为一个小的长方形 ，输出光束发散角大 ，且呈长椭圆形 。在许多应用中，无论是与光纤耦合，还是用透镜准直 、聚焦，都希望圆形光束 ，这就需要在外部做复杂的光束整形。二是在激光器生产中必须采用解理工艺 ，批量生产时难以机械化和自动化，工艺复杂，成本高。因此，从芯片表面发射激光的激光器成为一个重要的研究课题。 VCSEL 全称（Vertical-Cavity Surface-Emitting Laser），是垂直腔面发射激光器。它与边发射激光器最大的不同点是：出射光垂直于器件的外延表面，即平行于外延生长的方向。最初用于光通信领域，比如光模块中，后来开始应用于消费电子领域的 3D 感测方面，比如人脸识别，2017 年苹果将其用在 iPhone 人脸识别模组，VCSEL 也开始受到消费电子领域的大规模关注。目前来看国外在 VCSEL 芯片方面还是较为领先，近些年国内多家厂商发展迅速，并且开始逐渐小批量或者批量生产，多家 VCSEL 芯片也得到了资本的较多关注。 VCSEL 技术的许多优点可以总结如下： 波长稳定性：VCSEL 中的激光波长非常稳定，因为它由很薄的（1~1.5个波长厚的）F-P 腔固定。与边射型激光器不同，VCSEL 仅能以单个纵向模式运行。 波长均匀性和光谱宽度：生长技术的改进使得 VCSEL 3 英寸晶圆的腔波长标准偏差小于 2nm。这使得 VCSEL 2-D 阵列的制造可以使得阵列元素之间的波长差异很小（全宽半峰值光谱宽度 &lt;1nm）。相比之下，边射型激光器的条形阵列由于缺乏内在的稳定波长机制，从一个条到另一个条存在明显的波长变化，导致光谱宽度较宽（全宽半峰值光谱宽度为 3~5nm）。 波长对温度的敏感性：VCSEL 的发射波长比边射型激光器对温度变化的敏感度低约 5 倍。原因是在 VCSEL 中，激光波长由单个纵向模式腔的光学厚度定义，而这个光学厚度的温度依赖性很小（腔的折射率和物理厚度对温度具有较弱的依赖性）。另一方面，边射型激光器中的激光波长由增益峰波长定义，其温度依赖性要强得多。因此，高功率阵列（发热大）的光谱线宽在 VCSEL 阵列中比在边射型激光器阵列中窄得多。此外，相对于 20°C 的温度变化，VCSEL 的发射波长变化小于 1.4nm（边射型激光器为约 7nm）。 高温运行（泵浦系统无需冷却）：VCSEL 器件可以在没有冷却的情况下运行，因为它们可以在 80℃ 的温度下运行，这种方法使得冷却系统变得非常小巧、坚固和便携。 单位面积输出功率更高：边发射激光器的最大功率密度约为 0.5kW/cm2，因为必须保持激光器之间的间隙以便冷却流动，而 VCSEL 现在可以提供约 1.2kW/cm2 的功率密度，未来可能提供 2-4kW/cm2 的功率密度。 光束质量更好：VCSEL 发射圆形光束。通过适当的腔体设计，VCSEL 也可以发射单横模（圆高斯型）光束。与边发射激光器相比，这种简单的光束结构大大降低了耦合/光束成形光学器件的复杂性和成本，并提高了到光纤或泵浦介质的耦合效率，这是 VCSEL 技术在低功率市场上的一个关键卖点。 可靠性更高：由于 VCSEL 不容易受到灾难性光学损伤（COD）的影响，因此它们的可靠性比边发射激光器高得多。 制造可行性和良率：VCSEL 的制造可行性一直是该技术的一个关键卖点。由于边发射激光器具有制造过程复杂和灾难性光学损伤相关的可靠性问题，因此其良率较低（从 2 英寸晶圆中能获得约 500 个边发射 980nm 泵浦芯片）。另一方面，VCSEL 的良率超过 90％（从 2 英寸晶圆中获得约 5000 个 VCSEL 芯片）。事实上，由于其平面属性，VCSEL 制造与芯片加工相同。 可扩展性：对于高功率应用，VCSEL 的一个关键优势是它们可以直接加工成单片 2D 阵列，而边发射激光器则不可能（只有 1D 单片阵列）。此外，需要复杂且热效率低下的安装方案才能将边发射器条堆叠在一起。 封装和散热：将大型高功率 VCSEL 二维阵列以“junction-down”配置安装很简单（类似于微处理器封装），使热移除过程非常高效，因为热量只需穿过几微米的 AlGaAs 材料。 成本：由于简单的加工和散热技术，封装二维 VCSEL 阵列比等效的边缘发射器条形堆栈更容易。现有的硅行业散热技术可以用于高功率阵列的热移除，这将显著降低高功率模块的成本。 而 VCSEL 十分方便量产，且可在制造过程中的各个阶段进行测试，生成良率可控，降低制造成本。VCSEL 易于和面上工艺的硅材料微型透镜整合，成本较低。除功率密度较 EEL 低外，在线宽、温漂系数、光束形状等指标上均优于 EEL，随着自动驾驶技术的快速发展以及激光雷达成本的下探，VCSEL 方案的能量密度及发光效率都将逐年提升，未来 VCSEL 方案将替代 EEL 成为行业主流。目前禾赛科技和 Lumentum 合作已经在 AT128 转镜式激光雷达上搭载了 VCSEL 激光器。 Reference 方祖捷. 单频半导体激光器原理、技术和应用[M]. 上海交通大学出版社, 2015. 马鹏阁. 多脉冲激光雷达[M]. 国防工业出版社, 2017. 陈良惠, 杨国文, 刘育衔. 半导体激光器研究进展[J]. 中国激光, 2020, 47(5):19. 马骁宇, 张娜玲, 仲莉,等. 高功率半导体激光泵浦源研究进展[J]. 强激光与粒子束, 2020(012):032. 郎兴凯, 贾鹏, 陈泳屹,等. 窄线宽半导体激光器研究进展[J]. 中国科学F辑, 2019. 孙国玉, 杨君婷, 包明冉,等. 高功率光纤激光的发展现状与应用[J]. 现代物理, 2020. 杜悦宁, 陈超, 秦莉,等. 硅光子芯片外腔窄线宽半导体激光器[J]. 中国光学, 2019(2):13. wikipedia: laser pumping Princeton Optronics: Vertical-Cavity Surface-Emitting Laser Technology ProLabs: Laser Sources For Optical Transceivers White Paper 中国科学技术大学课件：半导体发光器件发光器 中国大百科全书：泵浦源 知乎专栏：第十一章-半导体激光器 华泰证券： 解构激光器核心元器件，国产化破冰而立 激光雷达行业深度报告：技术路线逐渐清晰、国产激光雷达占得先机 光电汇：3分钟了解窄线宽激光技术——“单色性”趋于极致的激光器 半导体行业观察：VCSEL激光器技术科普！ 长三角激光联盟：干货，垂直腔面发射激光器最全科普！ 自动驾驶欲“抛弃”激光雷达？窄线宽半导体激光器来救场 欢迎在我的专栏「自律走行」中查看更多「聚焦激光雷达」系列文章 聚焦激光雷达（一）——扫描器 聚焦激光雷达（二）——激光器 聚焦激光雷达（三）——接收器 聚焦激光雷达（四）——光学元件 聚焦激光雷达（五）——处理器","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"lidar","slug":"lidar","permalink":"http://www.yvonshong.com/tags/lidar/"}]},{"title":"欧拉角、四元数、旋转矩阵、旋转向量的相互转换（C++、python）","date":"2023-03-23T12:00:00.000Z","path":"2023/03/23/rotation-transformation/","text":"记录 C++(Eigen), Python(scipy)的旋转表达式之间的转换。 C++ Eigen欧拉角转其他123456789101112131415// 初始化欧拉角Eigen::Vector3d&nbsp;eulerAngle(roll,pitch,yaw);// 欧拉角转旋转向量Eigen::AngleAxisd rollAngle(roll, Eigen::Vector3d::UnitX()); Eigen::AngleAxisd pitchAngle(pitch, Eigen::Vector3d::UnitY()); Eigen::AngleAxisd yawAngle(yaw, Eigen::Vector3d::UnitZ()); Eigen::AngleAxisd&nbsp;rotation_vector = yawAngle * pitchAngle * rollAngle;// 欧拉角转四元数Eigen::Quaterniond q = yawAngle * pitchAngle * rollAngle;// 欧拉角转旋转矩阵Eigen::Matrix3d&nbsp;rotationMatrix = yawAngle * pitchAngle * rollAngle; 四元数转其他123456789101112// 初始化四元数Eigen::Quaterniond&nbsp;quaternion(w,x,y,z); // Halmiton!// 四元数转旋转向量Eigen::AngleAxisd&nbsp;rotation_vector(quaternion);// 四元数转旋转矩阵Eigen::Matrix3d rotationMatrix = quaternion.toRotationMatrix(); Eigen::Matrix3d rotationMatrix = quaternion.matrix(); // 四元数转欧拉角Eigen::Vector3d&nbsp;eulerAngle=quaternion.matrix().eulerAngles(0,1,2); 旋转矩阵转其他123456789101112131415// 初始化Eigen::Matrix3d&nbsp;rotationMatrix;rotationMatrix&lt;&lt;x_00,x_01,x_02,x_10,x_11,x_12,x_20,x_21,x_22;// 旋转矩阵转旋转向量Eigen::AngleAxisd&nbsp;rotationVector(rotationMatrix);Eigen::AngleAxisd&nbsp;rotationVector = rotationMatrix;rotationVector.fromRotationMatrix(rotationMatrix);// 旋转矩阵转欧拉角Eigen::Vector3f eulerAngle = rotationMatrix.eulerAngles(0, 1, 2); // 旋转矩阵转四元数Eigen::Quaterniond&nbsp;quaternion(rotation_matrix); 旋转向量转其他12345678910111213// 初始化Eigen::AngleAxisd&nbsp;rotationVector(rotationAngle, Eigen::Vector3d(x,y,z))Eigen::AngleAxisd&nbsp;yawAngle(rotationAngle, Eigen::Vector3d::UnitZ());// 旋转向量转欧拉角Eigen::Vector3d&nbsp;eulerAngle=rotationVector.matrix().eulerAngles(0,1,2);// 旋转向量转旋转矩阵Eigen::Matrix3d&nbsp;rotationMatrix=rotationVector.matrix();Eigen::Matrix3d&nbsp;rotationMatrix=rotationVector.toRotationMatrix();// 旋转向量转四元数Eigen::Quaterniond&nbsp;quaternion(rotationVector); Python scipyhttps://docs.scipy.org/doc/scipy/reference/generated/scipy.spatial.transform.Rotation.html 12345678910111213141516171819202122232425from scipy.spatial.transform import Rotation as R # quaternionquaternion = [0, 0, np.sin(np.pi/4), np.cos(np.pi/4)] # [x,y,z,w] JPL!scipy_r = R.from_quat(quaternion) quaternion = scipy_r.as_quat() # rotation matrixrotation_matrix = [[0, -1, 0],[1,0,0],[0,0,1]]scipy_r = R.from_matrix(rotation_matrix) rotation_matrix = scipy_r.as_matrix() # rotation vectorrotation_vector = np.pi/2 * np.array([0, 0, 1])scipy_r = R.from_rotvec(rotation_vector) rotation_vector = scipy_r.as_rotvec() # eular angleeular_angle = [np.pi/4, 0, 0]scipy_r = R.from_euler('zyx', eular_angle, degrees=True) euler_angle_degree = scipy_r.as_euler('zyx',degrees=True)","tags":[{"name":"slam","slug":"slam","permalink":"http://www.yvonshong.com/tags/slam/"}]},{"title":"聚焦激光雷达（一）——扫描器","date":"2023-03-12T04:00:00.000Z","path":"2023/03/12/focus-on-lidar-1/","text":"之前撰写过相机硬件的系列文章，从滤镜、镜头、快门、 CMOS 到 ISP 芯片，几年前写过一篇激光雷达入门介绍 Yvon Shong：走进自动驾驶传感器（一）——激光雷达，当时只是初步提及了激光雷达的一些基本性质。 而这几年激光雷达作为逐渐成熟的自动驾驶/高阶辅助驾驶传感器，价格逐步下降，产品也层出不穷，笔者于去年入职了中国激光雷达第一股，禾赛科技（内推禾赛科技自动驾驶、光电芯片等岗位），伴随着制造商和供应链逐渐成熟的进程，激光雷达有了更繁复的分类和功能，所以也想对激光雷达进行一次系统性的大拆解，撰写激光雷达系列文章。 本系列文章将从扫描器，发射器，探测器到处理模块，从硬件到软件算法等模块，来介绍激光雷达。欢迎关注本专栏，您的帮助从点赞本文章开始 ヽ(ﾟ▽ﾟ)ノ。 之前的文章 ， 在之前的文章中，我们粗略的提及了激光雷达扫描结构的不同，激光雷达的扫描结构主要分为： 机械式、混合固态（MEMS振镜式、转镜式、棱镜式）、纯固态（FLASH、OPA）。本章节将详细介绍激光雷达细分的扫描结构和原理，以及一些新型的技术。 机械式机械式激光雷达是指其发射系统和接收系统一起随着转轴进行肉眼可见的转动，也就是将多个激光点在垂直方向上排布形成扫描竖线，由电机控制旋转，形成扫描面，长时间内保持转速稳定，便可以进行稳定周期的 360 度扫描。因为带有机械旋转机构，所以机械激光雷达外表上最大的特点就是个头较大自己会转。 如今机械激光雷达技术相对成熟，但价格高昂，性能的提升依靠增加收发模块来实现高线束，导致了整套系统元器件成本非常高，体积大，量产可能性低，光路调试装配复杂，生产周期漫长，机械旋转部件在行车环境下的可靠性不高，平均失效时间 1000h-3000h，远低于车规要求的 13000h。 半固态MEMSMicro Electro Mechanical System 激光雷达其本质是一种硅基半导体元器件，在硅基芯片上集成了微振镜，通过电流控制小尺寸的悬臂梁结构，使微振镜悬浮在前后左右各一对扭杆之间，通过使微振镜结构产生平动或扭转，偏转激光光束而实现平面的扫描。 该模块将光束扫描所需的微型反射镜、MEMS 驱动器、MEMS 传感器进行集成于微小的 MEMS 振镜模块，优势显而易见，运动部件少可靠性提升、体积小、扫描频率快、无机械组件、可量产，摆脱了笨重的旋转电机和扫描镜等机械运动装置，减少激光发射单元的数量，毫米级尺寸的微振镜大大减小了激光雷达的尺寸。同时 MEMS 模块可采用半导体工艺规模化生产进而降低成本。并且减少了机械结构部件，在光学素质、功耗等方面都有优势。 在悬臂梁上的微振镜 而 MEMS 式结构的问题也比较明显，硅基 MEMS 悬臂梁振镜结构非常脆弱，在耐久性、抗冲击上存在不足，容易失效。受限于 MEMS 微振镜的镜面尺寸， 接收端的收光孔径远小于机械激光雷达，而光接收峰值功率与接收器孔径面积成正比，导致功率进一步下降，信噪比降低，有效探测距离缩短。同时由于几何尺寸限制了其震荡幅度， 振镜转角有限，限制了激光雷达的视场角，需要激光雷达厂商采用光源扩束、多个激光器拼接，甚至采用多个 MEMS 振镜等特殊的结构来扩大 FOV，这对点云拼接算法和点云稳定度，对产品的结构和光路设计、安装调试的要求都比较高。 驱动方式目前市场上主流的 MEMS 振镜驱动方式可分为电磁驱动、静电驱动。 电磁驱动具有较大的驱动力和驱动位移，由于需要制作外围线圈，通常尺寸较大，便于提高激光雷达性能，但在严苛环境下可靠性风险也会增加，同时对温度比较敏感。 静电驱动则利用带电导体之间的静电作用实现驱动，功耗低、速度快、兼容性好，但摆角较小。 其他方式电热驱动响应较慢，压电驱动对温度敏感，均不适合用于激光雷达。 扫描维度MEMS 振镜从扫描维度上也区分为一维和二维扫描。一维转镜产品的扫描角度通常可以达到 60°，镜面直径可以达到 3mm，而二维转镜产品的扫描角度仅为快轴 30°，慢轴 24°，且镜面直径为 1mm，考虑到线光斑自身的形态， 要满足一维扫描要求，MEMS 振镜的尺寸通常也需要做到更大。 驱动方式和扫描维度的技术路线上，没有绝对的优劣，激光雷达厂商通常会根据零部件的特性设计自己的光源数量和光路结构实现扬长避短。对激光雷达厂商来说，振镜的尺寸、摆角、以及扫描频率、稳定性以及成本都是需要考量的重要指标。 收发光路同轴方案具有相同的输入输出光路，收发模块集成于一处，发出的激光触达被测物体后返回并再次通过 MEMS 振镜被探测器接收，优点在于只接收沿着原光路返回的光信号，因而有较好的日光抑制性，信噪比高；同时接收器采用单颗 APD 即可，成本可控；如果采用多个激光收发模组拼接，不同模组之间相对独立，可以同时进行扫描互不干扰。但同轴方案中由于微振镜口径大小直接决定接收器能收到多少反射回来的激光能量进而影响探测效果，所以通常尽可能的将微振镜尺寸做大，而大尺寸的 MEMS 振镜在稳定性、抗冲击性、震动频率以及成本上表现不佳，除此之外，同轴方案需要精密光学对准，工艺、成本和生产效率也面临挑战。 非同轴方案即收发模块分开部署，返回的激光不经过 MEMS 振镜直接进入到探测器中，可采用小尺寸 MEMS 振镜，同时光学对准调试的要求相对较低。但该方案会面临外部环境的光干扰，通常需要阵列化的 APD 或者 SPAD 来实现好的探测效果，定制化的接收芯片对技术要求高，同时也可能会产生较高的成本。 双 MEMS 振镜AEye 公司采用双 MEMS 振镜扫描，发射与接收光路分离设计。 AEye激光雷达专利中的双MEMS振镜扫描 双 MEMS 的根本原理是采用点光源，用两个振镜分解水平方向和垂直方向上的扫描。 Luminar专利中用两个电机带动的多边形扫描器(多边形镜16和平面镜14) 而一排激光器组成线光源可通过一维扫描实现面扫描，搭配一块转镜即可，转动模块进一步精简，便是接下来要介绍的转镜式。 转镜式转镜方案是最早实现前装量产上车的技术方案，在性能和稳定性上具备优势。相比机械式的整体旋转，转镜方式使收发模组固定，电机带动反射镜或棱镜转动，从而将激光反射至空间的一定范围，进而实现光束的扫描。 转镜方案的优势在于结构更紧凑，稳定性高，功耗低，安装难度相比机械式显著减小。早在 2017年 Ibeo 和法雷奥发布首个车规级激光雷达，即基于转镜架构的 4 线激光雷达 Scala。而禾赛的 AT128 已成为国内前装量产的畅销产品。 激光发射和接收装置固定，仍有旋转模块但比较小，可以减少产品体积，并且降低成本；旋转模块只有反射镜，重量轻，电机轴承的负荷小，系统运行起来更稳定，寿命更长，符合车规。 AT128 内部构造 然而转镜式激光雷达在运行中要求光学转镜实现连续高速旋转，对于电机的高温耐久稳定性、可靠性、寿命、磨损，光学系统控制机制和转轴精度，高转速对轴承及油脂的选择，需要大量的耐久试验及超高的工艺水准，转镜的配重等均提出了较高的要求。同时由于仍然存在较大的机械转动部件，扫描频率上限偏低，对恶劣环境的承受能力以及耐久性有限，扫描件也无法通过半导体工艺大批量出货实现降本。 双楔形棱镜采用空间激光通信领域的旋转双楔形棱镜方案（或称旋转双光楔)方案，激光雷达的收发模块固定，通过电机带动双棱镜进行高速旋转，激光在通过第一个楔形棱镜后发生第一次偏转，通过第二个楔形棱镜后发生第二次偏转，只要控制两面棱镜的相对转速便可以控制激光的扫描形态，产生不同角度的折射光线，从而实现FOV范围内，更高线束的覆盖。 大疆是国内唯一一家选择双楔形棱镜方案的公司，旗下 Mid 系列、Horizon 系列和 Tele 系列均采用这种方案。 大疆双楔形棱镜方案结构图 该方案优点是，一，只要两个楔形棱镜的相对速度控制得当，那么在同一位置通过长时间扫描就可以几乎覆盖整个区域，分辨率也就几乎没有上限，适合像测绘这种对扫描精度要求高、时效要求低的应用场景。而大疆 Livox 最初的激光雷达产品就是主要面向测绘、工业、安防等市场。二，激光收发器数量减少，相对于机械式成本相应大幅降低。三，收发模块固定，电机只需带动双棱镜旋转即可，避免了类似传统机械旋转式激光雷达的多次装调问题，量产能力也相应得到提高。 扫描时间越长点云密度越高 此外，双楔形棱镜方案扫描出来的点云图呈现花瓣型，属于非线性扫描，点云数据离散度高，属于非结构性数据。对于自动驾驶公司以及车企来说，这种非线性扫描方式有两大缺点：一是点云图示中心的位置密度大，而在周边较稀疏，直接导致信息的收集以及成像会在边缘的积淀，很难通过算法去补偿。二是每次扫描后成像范围不一样，会导致雷达在高速移动中成像不连续，影响可靠性。 对于使用神经网络等 AI 技术的自动驾驶公司来说，使用这种雷达需要使用新算法。如果某自动驾驶公司此前使用机械激光雷达已经积累了几万公里的数据，并以此训练了神经网络，在新雷达上并不能使用，需要重新积累感知数据，研发感知算法。并且处理这种非线性扫描也需要更大的算力。 从应用来说，双棱镜的方案更适合静态场景，比如扫描静态物体，V2X，测绘，低速机器人等，在车载领域存在软硬件层面的难点。 MMTMicro Motion Technology 由赛瞳科技 Cepton提出并使用，是在收发光学系统后端通过磁场变化精确控制金属摆臂的位移，通过改变电磁场实现微振动，从而控制收发系统的扫描方向，即采用类似扬声器的音圈技术，专有的光学阵列会连接到音圈，当音圈通电时会产生微动，在不降低功率密度的前提下实现大视场扫描，无物理摩擦，保障了扫描组件的长期可靠性。 MMT 专利图 光源与探测器都是从镜头直出直入，无需任何扫描镜，不像微振镜或者旋转镜会反射光，从而产生衰减和偏振现象，可靠性有保证。收发共轭的设计极大程度上简化了空间光路，能够在保证测距性能的前提下，实现小型化低成本和高可靠性的解决方案。这种设计具有最简单的光路，可产生最高的效率和最少的组件数量。MMT 兼具横向和纵向分辨率，垂直方向分辨率可以达到市面上激光雷达的 4 到 5 倍。 这种独特的成像方法有以下优点：借鉴了相对成熟的喇叭技术，它不像电机和轴承，不产摩擦、没有部件损耗；光源与探测器都是从镜头直出直入的，没有镜子，避免产生衰减和偏振，可靠度高、可实现大视场角扫描、功率低、体积小；收发光路对称以及没有空间光路转折的设计，保障耦合效率的同时，进一步降低光学组件成本，不存在摆进漏光反射等常见光学问题。 固态FlashFlash 路线类似于照相机，在特定时间发射出覆盖整片探测区域的激光，通过面阵化的接收器计算每个发射器的光对应的距离信息，完成对周围的探测。该技术路线消除了所有运动部件，容易通过车规，且可以采用芯片级工艺，成本相对较低，此外扫描速度快。 禾赛 FLASH 激光雷达产品 FT120 缺点在于面光源能量分散，视场角和探测距离此消彼长，难以实现远距离探测。由于 Flash 激光雷达激光单点面积比扫描型激光单点大，难以控制发热，因此不得不降低其功率密度，进而影响到 Flash 激光雷达的探测精度和探测距离；抗干扰能力不佳，环境适应性相对差。所以难以满足远距离探测的要求，通常在补盲场景下使用。 另外一类 Flash 路线厂商采用逐点/逐行扫描 VCSEL+SPAD 阵列实现 Flash 方式探测，并通过控制光束形状或激光发射阵列的开关方式等改进，来提升 VCSEL 的发射功率，同时配以其他技术提升探测距离。 如以色列激光雷达公司 Opsys Tech 推出 Micro-Flash 技术，采用可寻址的 VCSEL 阵列，让 VCSEL 以极高的频率逐个发光，每个发光点发射的激光经过一系列透镜后返回照亮特定的 SPAD 阵列像素，通过 TOF 方式感知距离，进而实现类似扫描的探测效果。技术方案发展方向，集中在提高 VCSEL 激光器功率，通过 SPAD, SiPM 提升光子探测能力，提升探测距离。 OPAOptical Phased Array，实现光学相控阵的方法有很多，目前以硅基光子集成技术为主，还有采用液晶、锆钛酸铅镧陶瓷（PLZT）、铌酸锂、纳米天线等的空间光调制（Spatial Light Modulator，SLM）。 硅光波导该方案通常将激光直接输入至光波导芯片，经过分光器构成的功分网络将光束分散到各个移相器中，利用介质材料的热光效应或载流子色散的电光效应对经过每个移相器的光进行调制，再传导至波导光栅形成的天线阵列对外发射。利用光的干涉在空间远场相干叠加合成具有特定光特定方向的较强能量主光束，然后再通过调制阵列相位差即可控制激光光束的方向实现扫描，相比传统机械是没有任何机械结构，雷达扫描速度快，精度高，可控性好。 基于热光效应的相位调制器原理较为简单，在波导过程中对每根光波导进行加热，从而通过硅的热光效应产生相位差。此方法原理虽然简单，且响应时间基本达到微秒级，但是存在功耗的问题，目前看每个波导需要 10mW 左右的功耗，考虑到 1000 个天线以上的阵列设计，整个 OPA 需要 10W 左右的功耗，继而产生发热问题，同时硅材料在 -20~40 度的区间范围内会存在体积的膨胀，温度补偿也会存在一定困难。 基于电光效应即通过载流子浓度的变化改变材料折射率，调制输出光波的相位和幅值从而实现电光调制。但电光效应也会使光打在光栅上会出现偏离，耦合的损耗较大，光进入波导时会损失 50% 的能量效率，出光时又会损失 20% 左右，整体光使用率比较低。 光学相控阵扫描方式通常被认为是激光雷达终极目标。该种方案优势显著：（1）纯固态，体积小，易过车规，去掉了所有的机械扫描部件甚至光学元器件，标定简单，安装校准成本几乎可以忽略不计；集成度高，信噪比高；对温度和振动的适应性更强，成本更低。（2）扫描频率高，一般可达到 MHz 甚至 GHz 的扫描频率，扫描精度高，可以达到千分之一度量级以上；探测灵活，目前对感兴趣的目标区域可以进行高密度扫描，安全性提高，节约算力，可利用通信领域的多波段分束/合束技术，OPA 方式还可实现多波段同时扫描，进一步提升点云密度和探测效果。（3）降本潜力大，可以采用半导体工艺规模化生产，同时结合硅光技术可以很容易和芯片化的收发部件结合，替代复杂的光路、透镜、收发模组等，进一步降低成本。OPA 硅光在技术上与 FMCW 具有非常好的共通性，可进行进一步集成。 优点之外，该方案的挑战也较为明显： 光学损耗：由于光在从外部光纤/激光器进入到光芯片、在光芯片中传输、以及照射到光栅上扭转方向垂直向外发射的过程中都会产生较大的损耗。损失掉的光会转化成热，容易烧损精密的光栅结构。做大光栅天线阵列的过程中，芯片中的总线光波导能承受的功率亦经受考验，对光芯片材料的选择和结构的设计提出了更高的要求； 视场角（旁瓣干扰）：相控阵芯片发射的光束经过互相干涉后除形成主方向的探测光束（主瓣）之外，易形成阵列干扰，使得激光能量被分散，形成其他方向的光束（旁瓣：光栅衍射除了中央明纹外还会形成其他明纹），这一问题会让激光在最大功率方向以外形成旁瓣，分散激光的能量，OPA 激光雷达在减少旁瓣效应，加工工艺、探测距离等技术难题上还不成熟，仍需要底层材料体系和芯片的工艺的突破。通常情况下，使用 OPA 芯片探测过程中会将旁瓣遮挡来保证主瓣不受干扰，因此主瓣和旁瓣之间的角度也决定了该 OPA 激光雷达的视场角。而光学相控阵中的天线阵列（小光源）的密度越高，旁瓣和主瓣之间的夹角越大，意味着激光雷达的视场角也越大。但天线阵列的密集分布将伴随着信号串扰、散热、以及移相器的布置等问题，考验开发者的设计和工艺制造能力； 工艺和集成：发射器端：相控阵由紧密排列的间距约为 1μm 光学天线阵列组成，并在宽角度范围内发射相干光，通过调整每根光线发出的光的相相对相位，可改变生成的干涉图，若要在 100m 处分辨尺寸为 10cm 的物体，需要一个工作波长为 1μm 的 OPA，并具备有至少 1000 根天线组成的电路，其中每根天线的间距为 1μm，OPA 的其中一个关键指标就是提高天线通道数。接收器端：硅光芯片技术可以和相机 CMOS 工艺完全兼容，但仍然需要一些特色工艺的开发，难度高于传统 CMOS 工艺。而如果想激光器芯片要将电信号转化为光信号产生激光，和传输光子的光波导通常采用不同的材料。 液晶相控阵 Liquid Crystal (LA)通过外加电压改变液晶的取向，实现不同阵元的相位调节，可以获得远场光束的偏转效果。液晶的光学相控阵有驱动电压较小、易于大面积阵列集成的优点。 液晶实现相控阵存在很多工艺，如液晶包覆平面波导 LC Clad Waveguide、液晶覆硅 LCOS（Liquid Crystal On Silicon）、液晶超表面 LC Metasurface、液晶偏振光栅 LCPG 等。 液晶光学相控阵结构原理 液晶光学相控阵的最大扫描角度大约±10°，扫描速度在毫秒量级。使用铁电液晶材料的空间光调制器，增大了液晶的响应速度， 响应时间可达到 200 μs。 液晶光学相控阵激光雷达具有很多优势，不需要机械扫描部件，有很大的潜力应用于现代新型激光雷达，但是液晶光学相控阵的扫描角度、扫描速度有待进一步提升，以使满足激光雷达在人工智能领域对于高速、大角度扫描的需求。 Spectrum Scan光谱扫描技术是由澳大利亚激光雷达公司 Baraja 推出，利用不同波长的光在介质中折射率的不同，在红外波段快速切换光的波长实现扫描效果。该方案没有运动部件，成本低廉，更容易适应恶劣的环境。 光谱扫描技术：利用光的折射原理，可实现固态化扫描 Baraja的随机调制连续波（Random Modulation Continuous Wave, RMCW）技术实现了业界领先的抗干扰性能和瞬时速度测量性能。不过该方案中的多光谱激光器加工难度大成本高，且想实现大范围视场角具有一定难度。 其他电光传感器 Electro-Optical电光传感器指利用电来调制光实现扫描的效果，分为克尔盒 Kerr Cell、泡克耳斯盒 Pockels Cell，分别利用的是以下效应。 泡克耳斯效应 Pockels effect 是指光介质在恒定或交变电场下产生光的双折射效应，这是一种线性电光效应，其折射率的变化和所加电场的大小成正比。德国物理学家弗里德里斯·泡克耳斯于1893年研究发现的。但这种效应只存在缺少反演对称性的晶体中，例如铌酸锂 LiNbO3，钽酸锂 LiTaO3，硼酸钡 BBO，和砷化镓 GaAs 等，或存在其它非中心对称的介质，例如在电场极化高分子和玻璃中出现。电场极化高分子中含有特别设计的有机分子，它们具有比高非线性晶体高 10 倍的非线系数。 克尔效应 Kerr effect，也称二次电光效应，是物质因响应外电场的作用而改变其折射率的一种效应。 克尔效应与泡克耳斯效应不同，前者感应出的折射率改变与外电场平方成正比，后者则与外电场成线性关系; 前者可以在液体或非晶物质出现，后者只出现于没有对称中心的晶体物质。 很多物质或多或少会出现克尔效应，但在某些液体会更显著。 这效应最先由苏格兰科学家约翰·克尔（John Kerr）在1878年发现。 声光传感器 Acousto-Optical声光调制器（AOM）也称为布拉格单元或声光偏转器（AOD），通常使用透明晶体或玻璃片作为光传播的介质，控制电信号驱动连接的换能器振动，从而在单元内产生声波。通过声波的振荡机械应变（光弹性效应）改变某些晶体或玻璃材料的折射率，从而引起折射率的周期性变化。我们可以将这些视为一种光栅，入射波将通过它传播并因此散射。当输入光束以正确的角度进入介质时，散射光将产生干涉并沿一定角度产生强烈的衍射光束，并承载与输入光束不同的强度。这种效应类似于X射线反射发生的布拉格散射。AOM还能够根据声波的速度适应各种带宽。研究人员能够通过操纵输入声波的强度、频率、相位、偏振和偏转来控制出射光束的特性。 Reference Patens of Cepton: Optical designs using cylindrical lenses for improved resolution in lidar systems Patents of Velodyne: Systems and methods for improving detection of a return signal in a light ranging and detection system Patens of Baraja: Optical beam director Patens of AEye: Ladar transmitter with optical field splitter/inverter Patens of Luminar: Lidar system with polygon mirror wikipedia: Pockels_effect wikipedia: Kerr_effect wikipedia: Acousto-optic_modulator Acousto-Optic Modulator (AOM): Altering Light With Sound 开源证券：激光雷达技术篇：百花齐放到量产落地 华西证券：硅光：“超越摩尔”新路径，厚积薄发大未来 车东西：大疆激光雷达，车厂为何不爱？ 九章智驾：远离参数之争，深度解读Livox 激光雷达车规之路 赛瞳科技CTO于航：激光雷达扫描架构以及满足车规级可靠性标准的量产方案 [锋子聊车： 科普 一文看懂激光雷达LIDAR基本工作原理] 固态激光雷达研究进展 lilac的老父亲：全固态激光雷达的核心器件，原来是光控相控阵芯片 液晶空间光调制器（SLM）结构及原理详解（一） 千亿级的激光雷达市场，OPA激光雷达的投资机会在哪里 欢迎在我的专栏「自律走行」中查看更多「聚焦激光雷达」系列文章 聚焦激光雷达（一）——扫描器 聚焦激光雷达（二）——激光器 聚焦激光雷达（三）——接收器 聚焦激光雷达（四）——光学元件 聚焦激光雷达（五）——处理器","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"lidar","slug":"lidar","permalink":"http://www.yvonshong.com/tags/lidar/"}]},{"title":"Get started with Obsidian","date":"2022-01-28T04:00:00.000Z","path":"2022/01/28/get-started-with-obsidian/","text":"Obsidian 是根据卢曼卡片盒方法论构建的次世代笔记系统，基于本地 markdown 编辑和双向链接特殊语法。具体使用方式可以参考《卡片盒阅读法》和 Notion。 官网 obsidian.md ，目前支持 Windows, macOS, Linux, iOS, iPadOS, Android.同步支持 Obsidian 应用内付费同步， 苹果生态支持 iCloud 同步，可自建其他云盘同步和 Git 同步。 我个人的使用方案是： Windows, Linux(Ubuntu 20.04), macOS, 都使用 Onedrive 同步； 手机上不使用。 安装官网 obsidian.md 启动 Launch可以直接在 https://obsidian.md/download 下载 deb。 Linux 下是 AppImage，每一次启动时都需要在 terminal 敲击命令，而不是点击图标，所以可以自制 launch 文件。 icon: 首先下载好 Obsidian 的图标; 新建 Obsidian.desktop 文件: 123456[Desktop Entry]Name=ObsidianExec=/home/song/OneDrive/Desktop/Obsidian-0.13.14.AppImageIcon=/home/song/Desktop/obsidian.pngType=ApplicationStartupNotify=true Exec 指向应用文件 Icon 指向应用图标 修改权限：对文件 右键 &gt;&gt; 属性 (Property) &gt;&gt; 权限 (Permissions) &gt;&gt; 允许作为程序执行文件 (Allow executing file as program)，打勾。 移动该文件到 /usr/share/applications 便可以在应用列表下搜索到该应用 OneDrive 进行同步可以直接使用 Obsidian 第三方插件 Remotely Save https://github.com/remotely-save/remotely-save Ubuntu 安装 OneDrivehttps://github.com/abraunegg/onedrive/blob/master/docs/ubuntu-package-install.md 可以跟着以下教程 在 ubuntu 20.04 上安装 Onedrive。 Update /etc/apt/sources.list 1sudo gedit /etc/apt/sources.list 在 /etc/apt/sources.list 末尾添加一行: 1deb https://download.opensuse.org/repositories/home:/npreining:/debian-ubuntu-onedrive/xUbuntu_20.04/ ./ Download and add the release key 12wget https://download.opensuse.org/repositories/home:/npreining:/debian-ubuntu-onedrive/xUbuntu_20.04/Release.keyapt-key add ./Release.key Update your apt package cache 1sudo apt-get update Install ‘onedrive’ 1sudo apt install onedrive auth the application 在命令行中输入 onedrive 然后打开最后列出的授权链接 Enter the response url ,在链接中同意便可。 同步更多同步，具体可参考该文。 完全同步 1onedrive --synchronize 此后如果 OneDrive 网盘或者 ~/OneDrive 文件夹里的文件/文件夹有变动，再执行该命令会进行双向对应的变动/同步。 选择性同步 如果你不想同步整个网盘，而是某个文件夹，比如 Obsidian，使用前提是 OneDrive 网盘和本机 ~/OneDrive 文件夹都有这个文件夹使用命令： 1onedrive --synchronize --single-directory Desktop/Obsidian 单向同步 在某些情况下(如备份网站数据)，可能只需要上传到 OneDrive。这样我们可以使用以下命令： 1onedrive --synchronize --upload-only 该命令只会单向同步本机 ~/OneDrive 文件夹，不受 OneDrive 网盘文件变动影响 卸载客户端123cd ~/onedrivemake uninstallrm -rf ~/.config/onedrive","tags":[{"name":"obsidian","slug":"obsidian","permalink":"http://www.yvonshong.com/tags/obsidian/"},{"name":"onedrive","slug":"onedrive","permalink":"http://www.yvonshong.com/tags/onedrive/"}]},{"title":"当时的月亮","date":"2021-12-31T22:00:00.000Z","path":"2021/12/31/the-moon-back-then/","text":"「敬通雅好辞说，而坎壈盛世，显志自序，亦蚌病成珠矣。」 又是一年的结束，如果说这一年最有印象的，便不得不提随心飞，从 2020 年 6 月底飞到 2021 年 6 月底的东航周末随心飞，借此去拜访过数个古都的博物馆，也曾数谒两广大快朵颐，看了北国雪下的碧瓦飞檐，看了南国海上的彩色浮标。还有春寒料峭的生日时，在中俄边境荒芜的草原公路上，独自开车狂飙三天。关于随心飞的故事，希望后续有机会能剪出一个合辑的视频。 2021.04.11 呼伦贝尔 | 额尔古纳独自前往黑山头 了无人烟的黄昏之时 一年的随心飞结束后，我把以前自 2013 年高中毕业旅行时起，攒过的机票，船票，火车票，装裱到了画框里。 2021.10.23 上海 | 画框装裱着过往的机票船票火车票 回看往昔的时候，我时常会想，那些票据，那些影像，成为了我生活真实感的连接附着物，记录着我走过了很长的路，途经了很多的不知道是否名为客居的城市，才终于真真切切地来到了你面前。那一天的夕阳，在我挂满拍立得的墙上渲染出金黄，在徽章墙上熠熠生辉。 2021.10.23 上海 | 去博物馆、展馆、活动等各种纪念徽章 来上海之前，或者说再往前一段时间，因为实习和工作的缘故一直在北京。有段时间很喜欢「好妹妹乐队」的那首《一个人的北京》，可能是这首歌小心翼翼得夹杂着年少时对于帝都的向往，魂牵多年雪后故宫的夙愿实现，以及离开北京前在我俩生日去拜谒小波的墓的道别，这些对我来说都过于浪漫了。 2020.11.28 北京故宫 | 东华门出来 金水河上倒映的晚霞 诺大的北京城，安放了很多人难以言说又形态各异的自我，和因此产生的无数璀璨碰撞，致使我时常说着不喜欢北京，却很喜欢在北京生活的近乎两年的时光。城市是客观中立的存在，生活是自己的主观感受，更乃至于我仍然对北京怀着初相遇时的那种探索与欣喜，而偶尔会仰望夜空。 当年朋友坚持留下来，对我说：北京多好！那么多的博物馆、沙龙，只要你感兴趣，都可以去看！ 去看朋友的那个星期，我是转了不少小众博物馆，也去了不少独立书店。 临走我说：「还是首都好啊！我去了 xxx，xxx，还真不错的。」 「是么！我都没去过。好像也没时间，也没心情了。」 然后我们聊的东西好像总是不在一个频道上，我像是一个还偶尔抬头看看月亮的凡夫。 他就像一个去过月球的人，然后再也不抬头看看夜空。 ———— 知乎：高房价的最大悲哀是什么？ - Ming Ali 的回答 毕业的时候，我觉得上海是我心中综合意义上最好的城市。可是也会无从逃避地觉得对一个城市的回忆积压得太多了，承载不过来。成都无归如是，丢盔弃甲般逃离北京如是，而上海亦如是。在这里发生了太多的别离，为何如今只剩下落寞的我一个人了呢。我在这里领悟，我也在这里失去。以至于随心飞结束后，我几乎每个周末两天都躺在家里，绝无迈出大门一步，然后有一天忽然看到上面这段文字，「他就像一个去过月球的人。然后再也不抬头看看夜空。」 我开始在反思，那我对上海是不是也是这样呢？ 人生需要不停的对自我进行建构和解构，这些关于城市的体验在不断被我创造然后消解，只是目前就像是阶段性的瓶颈期，许多情绪无处安置。 日本毕业时念想着 2020 年东京奥运会再回去看一次花火大会，而今是再也不会主动去约定不成熟的下一次了。也许有约定带来的束缚，因为这对我来说是承诺，不能敷衍。 抑或「明年保了寿命，谁说一定，有伴侣与东京。明年即使有热血，初樱初雪，又如何约定」。生活依旧很难拥有强烈的情绪起伏，成为了情绪稳定的人，或许是知道了什么东西不能改变，知道了人的边界，很多东西不以人的意志为转移。但依然会希望生活会有一些波澜，因为那些涟漪的闪光才让我印象深刻，点缀出人生的高光时刻，才是我活过的证明。而人需要去成长，接受新鲜体验，才能延续心理时间，为记忆埋下锚点，时间它只负责溜走，不负责予你成长。如果当这一切都停止时，首先体验到无聊，其后是空虚，倘若那些随手抓取的碎片化反馈，比如某一个青春挥霍的夜晚，下班游完泳后，和友人骑车找小店，趟过夏夜凉风的温度触感，比如某一次下班时晚霞温柔治愈的明暗色彩。若那些片刻不能起作用，最后导向的就是抑郁。毕竟或许大多数人，终究是要在平凡中寻找生活的意义。而它是一种一旦放弃主动意志，就开始接受惩罚的体验过程。 那段时间还在看《花束般的恋爱》，EVA 剧场版也来到了终结，内心又继续蒙上了几分抑郁。 现代社会总是喜欢把一个人的心理成长归结于原生家庭，当然是不无道理的，当你想要去探究自己内心成长的轨迹，或者是聆听他人的倾诉时，总会隐隐约约看到其父母在这段河流中的倒影。写过了那么多文反思内心的文章，而如今在我构建世界观中对我影响最大的 EVA 的剧场版也完结了。我也以为我终于能够开始正视我内心关于原生家庭在成长过程中带来的影响，现在的我有能力去安慰内心深处曾经的那个小孩，抚平当时的褶皱了。可是当自己需要进行更深入的分析的时候，我仍然产生了抗拒，可能是我仍还没有做好准备，还需要等我下回分解。 《花束般的恋爱》讲的是兴趣爱好百分百契合的男女麦和娟的恋爱长跑故事。麦在进入社会工作后，就好像所谓的「在社会里洗澡」了一样，飞快地丧失了艺术欣赏和社会共情的能力，对难民议题无感，对文学无感。而麦后面还一直觉得两人只是生活观念不同，或者是「她怎么还想维持学生时代的恋爱」。我个人是觉得男主麦说的很对，两个人怎么可能一直沉浸在热恋时期的状态，彼此总是会长大，总是会经历不同的阶段。就像花一样，会有破土萌芽，会有盛放，也会有淡化凋落。可是电影最后的矛盾冲突点，在曾经约会告白的店里娟和麦的分手，我还是哭得好厉害。那一幕里娟和麦正在因多年的生活态度分歧和之间情感的处理方式而剧烈争执与妥协，却看到了同时店里来了一对年轻的小情侣，正重复着他俩当时朦胧的故事，彼此会因琐碎的情绪共鸣而欢呼雀跃。 2021.10.16 北京中华世纪坛 | 《花束般的恋爱》里也提到过的木乃伊展 看《花束》的前一天晚上，我正好约见了大概五年未见的朋友，聊了很多彼此的近况，包括说朋友亲戚总是给我介绍不在上海的对象，我斩钉截铁的说，「人得在上海才行。」嗯，「人得在，上海才行。」 是啊，我这句话没有错，我现在依然也能十分确定着这一点，毕业之后的人际关系在天时地利人和的诱导下，建立在良性的现实面对面互动中。而身居上海至少是满足了产生连接的天时与地利。多么精致的理性思考。 可我哭得撕心裂肺的点在于，我是不是也已经忘了，当年能够为了喜欢可以跨过山海，可以翻过围栏，出现在你面前。「所爱隔山海，山海皆可平」在平凡无果的岁月下，是不是已经揉成了「明日隔山岳，世事两茫茫」。就像是曾经一直想要构建一个融洽的自我，在这瞬间将被刺破。抱着这样无果的，失去目标的生活的态度，我又继续在家里颓废了好几个月不出门。 「如今天无雨，空留我在此。」 期间也不乏朋友想要给我介绍合适的对象，换一个词来说的话，就是相亲。虽然和他人建立连接，对他人给予帮助，对我来说都并不是困难的事。但是有一些事情在我心中仍设有阻碍。 IC 实验室有一期关于相亲话题的视频:《bilibili: 宁可单身，绝不相亲：现在的年轻人为什么讨厌相亲？》。其中主要的三点是：（1）相亲是价值匹配，包括多方的评估，涉及双方自己、双方对对方、中介人对双方(还没算双方父母)，所以才会那么多破事。（2）相亲的目的是婚姻，爱情只是不一定有的副产物。而婚姻是抵抗风险的社会关系契约，需要的是物质基础。（3）如果把抗风险的社会关系作为目的的话，婚姻就是工具，而当代年轻人更多追求的是内心的情感诉求。 我一直认为家庭是一种抵抗风险的经济合作组织形式，而婚姻是与社会的契约，是和自己，和彼此，和彼此家庭，和社会签订的契约，以此保证你和彼此，和彼此家庭，和小孩的利益。签订契约的人受周围的人和社会关系的监督，守护不可破的誓言。因此社会承认对双方的共同财产的保护，对子女的权利与义务。 而我们需要区分目的和途径，人是目的而非工具、手段。结婚是为了达到幸福生活的方式方法，而不是目的，相亲亦如是。可是现代人的社会关系推动得太快了，觉得当前聊的不行大不了就换下一个，这个就不再联系了。对我来说相亲之后的不联系，就像是潘多拉的魔盒，如果打开的话，就很容易适应那种随随便便的态度。这也是我略微抵触相亲的原因，有了连接关系的人，曾经想要掏心掏肺的人，真的就可以相忘于江湖了么？没有结局的故事带给我的只能是不可结缘，徒增落寞。 毕竟，我也曾经这样做过，自我保护的本能让我忽视曾经发生过的故事，可是理智与事后无数次的反思却不让我这么做。也是多少隔阂和刺痛让我明白了狐狸对小王子说的那句「如果你想要建立羁绊，就得承受流泪的风险。」或许这种修改记忆的本能就是我产生虚无感的由来，以至于为什么会需要仪式感和实物的连接附着。所以我需要从根本上抗拒这种形式，抗拒打开这样的魔盒，那么努力地在为了自己鲜活存在而留下不会被修改的痕迹，我不想内心却仍因放纵而跌入人和人关系的深渊。 2021.05.22 广东汕头南澳岛 | 彩色的浮标 话说回来，朋友在试图给我介绍对象的时候，总是会灵魂发问，「你喜欢什么类型的？」我一直拙于回答此类的问题，曾经我追求 moment，但是后来发现，瞬间并不能永恒，即使是心动也会迎来热寂。如今我诉诸于品行相关的闪光点，觉得需要有互相吸引的个人品质，然后会在某个神启的瞬间坠落。 明日香对真嗣说：「你为我做的那盒午餐便当非常好吃，我想那时我喜欢上你了。」 可是直到有一天看到罗翔老师说：「陀思妥耶夫告诉我们，要爱具体的人，不要总是想着去爱抽象的人。知识分子的一个经常性的倾向，就是我们喜欢抽象概念，胜过具象的事物。但是一个越爱抽象人的人，往往越难对具体的人表现关爱。因为抽象的人是美好的，抽象的人存在于理念之中，但具体的人都是有缺陷的。 所以这就是为什么你越感到抽象人的美好，你越会发现具体人、你身边人的可恶、可耻、卑鄙。但是真正的爱一定是对具体人的爱。所以这就是为什么在现代社会，人越来越孤独。因为你的朋友圈越来越多，你感觉认识你的人和你认识的人越来越多，你甚至可以跟 3000 公里以外的人聊天，但是你却跟你身边的人没有话聊。而真正的感情是要投入时间的，真正的情感一定是要附着在一个具体人的对象。」 我顿时如醍醐灌顶。因为「一个人喜欢怎样的人」这种问题，一直是 case by case 的问题，可以提炼出共同点，但也永远无法泛化到所有个例中。比如你说你喜欢吃橘子，但给你一颗酸的橘子，你就会喜欢么。而很多人有硬性要求，就像招聘的时候 HR 要求学历，直接过滤掉一些人。但对我来说人和人创建的连接是没有办法那么理性的，可能大家心里会有一个平均分的概念，对另一半的外貌，学历，工作，家庭等等因素会有单项评分，可是不同项的权重就是个很主观的概念，以及这个评分过程忽视了最重要的一点，忽略了人与人之间的羁绊，毕竟人是目的，不是手段。 于是我总是拒绝，总是退缩，社交关系处于精疲力尽的状态，然后继续蜷缩在房间里不出门。 还有一次，室友问我要不要养猫，我拒绝了，我说我还没有做好准备。可事实是我前两次在路边救回来猫的时候，我又何曾做过了准备。初中的时候，周末在路边沟渠里救了一只小猫咪；在日本研究生毕业前也在马路中间救过 sakura。好像也并不是什么都需要预先做好准备的。或者说，也有很多，是你做好了准备也并不会如期开始。 我曾经一直靠着大师兄朱炫的一段话来开导我无人光顾的剧场：你把该想的都想好，舞台上的山水云雾，明月大江，身上穿的长袖冠帽，金刀铁马，都准备得稳妥，帘子一开，就等一个人落泪。我知道很多人像你，很努力的准备，开幕奏乐，结果位子空着，鼓声越来越急，回荡在不大不小的剧场里，铜锣一响，你发现，人没来。其实感情有时候，就是挺无奈的。我以为曲声一响，就有梦幻，我以为俯下身来，就有娟红。铃声在响，你很着急。 可这么多年了，我也并没有在空荡荡的剧场等到谁，蹑手蹑脚地走进来。也未曾见到剧场的灯光恰到好处的勾勒在她或圆或尖的脸额上，因为风寒而微微发红的鼻头，因为温暖而微微饱满的唇肉。马尔克斯在《霍乱时期的爱情》中提到，「社交生活的关键在于学会控制恐惧，婚姻生活的关键在于学会控制厌恶。」你不能去等待那个人到来，因为你根本就不知道「那个人」究竟是谁。克服你的恐惧，做出属于你自己的选择，做好足够的铺垫，然后把故事推向高潮。 2021.06.12 鄂尔多斯库布齐沙漠 | 我看见沙漠下暴雨 我们在棚下扎营 情绪的解局出现在，总是喜欢反复注销注册微博的好朋友，某一天又重新关注了我，然后我翻到一句毫不相干的微博「我很想你 但我要继续前进」。 「但我要继续前进」。 人生总是有很多未曾走过的道路，娶了红玫瑰，久而久之，红玫瑰就变成了墙上的一抹蚊子血，白玫瑰还是「床前明月光」。娶了白玫瑰，白玫瑰就是衣服上的一粒饭粘子，红的还是心口上的一颗朱砂痣。可是没有办法呀，我知道那样的曾经的状态很美好，但我仍然觉得我在朝着我想要前进的方向迈进，我也会很喜欢我未来的状态，当下的我，只是为曾经为记忆为过去感慨那么一瞬间，只是这一瞬间，在我疲惫的生活中显现得漫长。 过去总是美好的，因为一个人从来都意识不到当时的情绪。它后来扩展开来，因此我们只对过去，而非现在，拥有完整的情绪。 ——弗吉尼亚.伍尔芙 好啦，我，还要继续前进，去成为我想要成为的大人。这一段回头看时显得如此病态的经历，我也曾多次经历过，也与此多次斗争过，我也知道破局之法是要走出去，物理的走出去。可是人身处在隧道的时候是很难意识到这一点的，就像是得了病而不自知的病人。「病识感」指的是一个人能否意识到自己的问题，比方今天如果你是一个有病识感的人，当你咳嗽、发烧，你会意识到自己可能感冒了，该去看个医生。但没有病识感的人，他对所有自己的征兆没有反应，会做出各种出于幻想的解读。 所以我们需要有抽象，我们更需要有具象。抽象是对自己的，抽象不是对别人的。当你看到了人的美好，你要努力让自己变得美好，而不要因为人的美好，就要强求你身边的人变得美好。因为连你自己都不美好，你为什么要强求别人呢。你自己都做不到，你为什么要强求别人呢。但你看到了抽象的美好，它提供了一个标本，来改造你自己，让你自己能够更关心你身边的人。 ————罗翔 值得庆幸的是，我又独自走出来了。我并不需要从外部获得力量，并不把自我价值建立在他人的评价的基础之上，但是，我也是一直在凝视着深渊，我也难保我每次都能战胜它。毕竟，如今只剩下我一个人在这里落寞了。 也有朋友会多次劝说我回成都，我也有过动摇，关于父母关于家庭关于朋友，而今现在我是为了自己做出的选择。就算是一些支线选择了 hard 模式，但是又不愿意就此放弃，因为如果这样，会觉得这是我自由意志的投降，是我向生活的折腰，我可以不顾他人对我的看法（事实是他人并不会有想法），但我过不了我自己这一关，我会长期背负着这次临阵脱逃，长期背负着失败的挫败感，然后它成为了我林中没有走过的另一条路，每每念起，都会在想平行世界里的那个人怎么样了。毕竟，我也曾经去过月亮。去过月亮的人，又怎会甘愿继续仰视呢。 而想要面对这样的人生，我开始掌握了更多的武器，或者说是方法论。对于工作，能够进入无我的状态。当你有幸做你愿意做的、目标明确、难度适宜的活动时，就有可能做到精神力完全投注，这种状态在心理学里被称为心流。而心流和正念，是自我练习进行强化的。需要给自己制定双月 OKR，之前的我只理解了「双月」，而没有深究 OKR 更专注于 objective 的这点，因为实现 object 的方式可以各不相同，但都得是为了达到目标。 人们总是这么说，「我想挑战自己」。这些挑战都是假的，爬山是假挑战，你不用去爬山的。有很多事情是人们必须做、应该做的，但是他们不做。因为他们害怕，或者他们很难做成，或者不擅长做，那些才是挑战。挑战是你必须做的事情，而不是你编造的事情。 ————纪录片《假装我们在城市》 因此得制定一个大目标，并且该目标得遵循事物发展的一般规律，我深有同感的是我司的前后期工作方式，以前是工程师在车上调试，到后来招聘到了更多 testops 专门进行测试。 在大目标之下得划分小目标并进行排期。虽然做东西不能一蹴而就，但可以实现最小化可实行产品（Minimum Viable Product），意思是用最快、最简明的方式建立一个可用的产品原型，通过这个最简单的原型来测试产品是否符合市场预期，并通过不断的快速迭代来修正产品，最终适应市场需求。 在进度和排期时，需要按项目评估预算（包括时间金钱和资源），然后按设立的 milestone 进度核算预算。 当遇到当下解决不了的问题时，需要发展的眼光来看待问题。 也开始带实习生，会需要自己保持写文档的习惯，项目的文档同时也是一种结果对展示和推广，而且需要建立属于自己知识库的文档，并梳理出层级结构和双向链接。 今年关于工作最大的变动是四年前的种子开始开花结果，研究生读书的时候，闭门造车，和大家一起在实验室调车，想一起做个 demo。四年前的这个时候，有了从实验室走出来去接触产业界的想法，来我司实习并拿了 return offer。四年间我从学生毕业变成了社会人，开始被捶，开始注重方法论，开始对工作有了自己的体验和观点。我司也从最开始小作坊模式，逐渐完善成了在四个国家十余个工作地点的跨国千人公司，我们和公司一起在成长。 可是真正产品化的无人驾驶离我们依旧还很遥远，登陆纳斯达克上市也只是三步走的第一步，可是在这一天，我们是值得骄傲的，我们在科技史上登上了聚光灯下的舞台，「从今天开始，我们也不用再羡慕那些硅谷的传奇，因为我们就是那传奇。」 2021.04.15 美国纽约时代广场 | TuSimple Nasdaq Listed 轮播员工照 而平日里我也和几位高中同学组了每周的分享会，持续三年多了，主题从聊技术聊专业（带数学公式图表那种），到聊经济聊创业，聊民主聊婚姻聊人口。我们在不同话题不断碰撞的时候也在不同丰富自我的表达与领域边界。可惜的是之前多次尝试汇总输出，目前只能做到整理自己的所学所讲。输出内容是一个燃烧自我的过程，你需要燃烧自己的所见所得，你需要燃烧自己毕生所学，可是总有燃烧完的一天呀，所以我们需要不断的学习，才能保证不断的输出。 所以接下来的一年，需要走出随心飞的抑郁情绪，并继续提高自己讲故事的能力，持续思考自己的 objective，制定内容输入和输出的目标。 2021.07.31 河北张家口阳原 | 《bilibili: VLOG#15 开阳古堡 | 银河下的摇曳露营》 2021.10.03 浙江舟山嵊泗列岛泗礁 | 《bilibili: VLOG#16 嵊泗 | 黄金体验》 要把碎片化的想法进行反思总结串联起来，然后还要写得足够深刻，是每年最痛苦的事情了，痛苦的点首要在于这是一种躺在手术台上的自我解剖，执刀者是我，受验者也是我。而且还要将所有飘飞的情绪沉淀下来，讲成连续的故事，十分考验文字功底，这又是属于创作的痛苦。今年剪辑了几期视频，补上了前年的《VLOG#14 北欧 | 彩云易散琉璃脆》和去年的 《VLOG#17 渔山岛 | 山川碧落和人间烟火》，虽然不算满意，但也在继续前进。不过每次回看我往几年的年终总结，我都能震惊于我当时居然能写出这样直击我灵魂的反思，以至于说是总结，此后的我却能常读常新。 那颗曾让我辗转反侧的月亮，终究变成了刘勰在《文心雕龙》中比作的 「蚌病成珠」 。「敬通雅好辞说，而坎壈盛世，显志自序，亦蚌病成珠矣」。蚌开壳进食，沙粒嵌入蚌体，蚌受刺激而病，这被刘勰领悟为蚌受到伤害，用生命的汁液一点一滴裹起了它的「病」，才产出璀璨的珠。","tags":[]},{"title":"键盘摄影（十）——滤镜的种类和作用","date":"2021-09-21T12:44:00.000Z","path":"2021/09/21/keyboard-photography-10/","text":"有一次忽然意识到，如果想要一个长曝光，浅景深，低 iso 的图，需要物理减光，所以滤镜也算是相机曝光要素中的一部分，为此也整理了一下现在的滤镜的种类，和各自的原理作用。以下内容整理自《关于滤镜-这篇就够了 上/ 下 》。 UV 镜 Ultra Violet通常为无色透明的，不过有些因为加了增透膜的关系，在某些角度下观看会呈现紫色或紫红色。UV 镜滤光片的主要功能是用于吸收波长在 400nm 以下的紫外线，而对其他可见/不可见光线均无过滤作用。它之所以能够过滤紫外线是因为镜片中含有铅。 在胶片年代，由于胶片的化学特性，其对阳光中的紫外线尤其敏感，在紫外线强的地方，使用胶片拍摄出来的照片普遍偏蓝、泛白。严重影响了照片品质。在镜头前加一块 UV 镜，可以有效过滤掉紫外线提高照片的清晰度。 到了数码时代，由于数码机的核心显像部件不再像胶片那样对紫外线过于敏感，因此已无需再对紫外线进行过滤了，所以主要起保护镜片之用。 偏光镜 Polarizers偏光镜对拍摄风景照片有着十分重要的作用。它的主要用途是消除不同表面的反光，令蓝天更蓝、树木更绿；此外，它也可以减少水面及橱窗的倒影。 要理解偏光镜的原理，先要明白光线是以波形传播，正常的光波震动的方向并不限于单一平方向，而是不规则地从四方八面而来。但在特殊情况下，也就是经过反射，光波震动的方向就会变为单一方向。 偏光镜镜片主体由极细的水晶玻璃组成光栅。旋转时，偏振镜的光栅将那些不与它平行的偏振光线阻挡。由于偏光镜只容许光线在单一震动方向通过，在调整偏光镜的角度后，其他震动方向的光波就会被 “过滤” 掉。当偏光镜和反射光形成某一个角度，反射光就自然被消除，达到减少反光的效果。 偏光镜是非常有用的一类滤镜。它的作用是过滤反射的杂光，让画面光线变得更纯净，减少杂光对画质带来的影响。可以使得天空更蓝、消除水面或玻璃等表面的（后期无法消除的）反光。消除非金属表面的偏振光，从而提高画面的饱和度，拍摄时使用 CPL 蓝天更蓝、白云更白。加了偏光镜可以大幅减少水面、玻璃甚至人脸都常出现反光，这样就能反光面后的物件细节及色彩都会重新呈现。 由于偏光镜只容许光线在单一震动方向通过，光线的强度因此随之减低。使用的时候，需要旋转偏光镜到合适的角度，才可以看到效果。同时也减弱了光，一般和无偏光镜相比，在同一个曝光值拍摄下，会减光约 1-1.5EV 曝光，必要时需要上三脚架。若是用于超广角镜头上，也可能会发生暗角的情况。 减光镜 Neutral DensityND 镜可以将投射在感光元件的光量平均地减少。当你相机的设定（光圈、快门和 ISO）已不能再进一步减低相机的进光量，或者你想在某一个设定下获取更慢的快门值或者更大的光圈值的话，ND 镜就派上用场了。 ND 镜主要是在慢快门的设定下使用，如：在阳光下拍摄如丝绸般的流水，使流水更富动感；让移动中的对象（如人和车）变得不明显，甚至在影像上消失；增加移动对象的动态等。 ND 镜有标识，代表了它的减光强度。目前常见的有 ND8、ND64 这种，代表将快门速度降低 8 倍、64 倍。数字越大，减光强度越高。 ND 镜由于减光，会造成相机无法获取到足够的光线对焦。建议取消半按对焦，对焦、构图之后上滤镜。一些质量较差的 ND 镜会令照片偏色，不同厂商对 ND 镜减光量的表达方式也不一。 渐变镜 Graduated Neutral Density渐变镜可以将一张照片的亮度，由照片中某个位置开始（大多由上到下）逐渐减低，这种滤镜十分适合一些光差简单的风光照，例如日落照（近太阳的天空较亮，近地面的位置较暗)，应对风光摄影中明暗差距太大的情况。 在数码摄影未流行时，渐变镜可说是每个摄影者的必需品。现在不少数码相机已经具备 HDR 功能（将多张不同曝光的照片合成)，但效果与渐变镜不尽相同，所以不能完全取代。 GND 和 ND 相比，除了减光等级。同样推荐先构图对焦，后上 GND。并需要对好 GND 的减光位置。 按照过渡的区域分类，中灰渐变镜主要分为软边和硬边两种。 硬渐变中灰渐变镜主要用于平衡高反差场景中的曝光。当我们需要拍摄天空较亮，而地面较暗的风景时，这种滤镜能够避免天空部分过曝或地面部分的曝光不足。硬渐变适用于天地分界明显的场景，例如拍摄沙漠这种地平线较为平整的风景。 其特征是在透明和暗部区域之间有一个清晰的边界，所以硬渐变一般应用在画面明暗区域过渡非常明显的情况下，例如有地平线和海平线这样的画面。 软渐变其特征是拥有一个较为平缓过渡的渐变区域，软边中灰渐变镜的简便效果能够很自然地压暗现场光，而不会在画面中出现突兀的明暗分界，像是层峦叠嶂的山地风景，通常很难将天与地完全分开，而且地平线也并不是平直的。因此，在这里我们需要用软渐变中灰渐变镜来代替硬渐变滤镜，以取得相似的效果。在避免画面出现过曝或欠曝的同时，软渐变也不会在画面中留下生硬而明显的明暗分界线。 反向渐变反向渐变镜颜色最深的部分是在滤镜中间，向滤镜边缘慢慢减淡。但是对于日出日落爱好者，太阳处于画面中间，上述两款普通中灰渐变镜面对这种情况就相形见绌，而反向渐变镜则是一件利器。反向渐变镜的颜色深度由中心向边缘递减，中心部分颜色最深，而边缘部分则最浅。这种设计很好地应对了日出日落时，地平线部分最亮，天空和海面（地面）则相对较暗的情况，因而能够避免画面局部过曝现象的产生。日出日落时分，太阳光的亮度在画面的中间时使用效果最明显，在实际拍摄的时候使用滤镜颜色最深的部位挡住画面最亮的地方，从而平衡画面反差。 暖色镜 Warming 、冷色镜 Cooling暖色镜和冷色镜能改变照片色温，可用来纠正光线、或者让照片展现出奇妙的色彩。例如，在阴天时增加一些温暖色调，令照片看起来更像在日落时分拍摄的。 今时今日，绝大多数的数码相机都可通过设定白平衡来调整色温，已取代上述滤镜的功能。如果使用 RAW 格式拍摄，也可以在计算机上进行白平衡后期调整。但在某些情况下，例如照明状况不佳，或者是水下摄影等场合，这些颜色滤镜仍然会大派用场。比如水底摄影、特殊灯光下的摄影。 色彩镜 Coloring包括红色、橙色、黄色、绿色、蓝色、黄绿滤镜等。 红色滤镜：在画面效果中可以使景物的红色部分隐掉变浅，蓝色、绿色、紫色部分景物影调变深。具有强烈的消雾气作用，常用于白天拍摄模拟夜间的效果，充满浪漫气氛。 橙色滤镜：在风景摄影中可以使淡黄、橙色、红色物体的引调变器增加物体的蓝色影调，增强景物的反差效果。常用于人像摄影，使照片效果更加强烈。 黄色滤镜：可以使地面与天空的景色形成巨大的反差，让处在远处的景物更加清晰。 绿色滤镜：主要调整黄绿光，吸收红蓝紫光，用于对自然界绿色色调进行区分，压暗天空和肌肤的影调。 蓝色滤镜：主要用于凸显空气中的雾气，模糊远处的景物。 抗光害滤镜抗光害滤镜是拍摄星空的专用滤镜，因为城市光污染主要为汞灯、钠等。抗光害滤镜可以显著过滤这两种灯光发出的波长，减少人造光源的光污染。 当然星空摄影还是建议直接去低光污染的区域。。。 近摄镜近摄镜又叫微距镜，作用是让镜头可以拍摄微距的效果（丐版近摄环）。原理其实就是在镜头前，放了一块放大镜。缺点是：装上了之后，镜头无法对焦无限远。 折返滤镜此类滤镜，是在滤镜上放置一些不透明的小图案。在拍摄之后，由于光学作用，会在虚化的斑点中呈现出图案。 图源卡色官网 图源卡色官网 柔焦镜柔焦镜在早前也叫柔光镜，使用这种滤镜可以制造出一种轻柔朦胧的效果。这类滤镜主要有三个用处： 人像拍摄：柔化整体，更好的将皮肤的皱纹、粗糙质感变得柔滑。 星空拍摄：过滤掉低亮度星星，增大高亮度星星的星点范围。可以更明显的拍摄星点和星座。 风光拍摄：营造童话、梦幻般的效果。 柔焦镜用于人像拍摄（人像朦胧，柔化皮肤等）From 卡色官网 柔焦镜下的星空（让亮星更亮）From 卡色官网 梦幻般的景色效果 From 卡色官网 星光镜星光镜的作用在对一些点状光源，有拉丝的效果。可以运用在风景、人像的一些场合，也可以用来拍摄珠宝、静物等用途。 特殊效果滤镜（星光镜，柔光镜等）。随着后期软件的发展，此类滤镜在慢慢淡出历史的舞台。 Reference 镜头滤镜基础实用知识大扫盲，使用入门必看 单反相机九种常见滤镜介绍 关于滤镜-这篇就够了（上） 关于滤镜-这篇就够了（下） 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"走进自动驾驶传感器（三）——卫星导航系统","date":"2021-09-21T07:36:00.000Z","path":"2021/09/21/approach-autonomous-driving-sensor-gnss/","text":"之前写了自动驾驶用到的相机传感器、激光雷达、毫米波雷达，现在终于写，大学需要专门开一门课写一本书难度的传感器——GNSS 。在此期间阅读了几本 GPS 教科书，理清了 GPS 的整个数据流，以及涉及到的相关技术，如有错漏恳请不吝指正。（也求个点赞不要只收藏(╯‵□′)╯︵┻━┻） 无人驾驶想要获得全局定位，一定是相对于某一固定坐标系的，而地球上范围最广的坐标系便是地球坐标系，想要获得这么宏达层面上的观测，便必须依靠 GPS 卫星的数据。 如果我们事先知道卫星每一时刻相对于地球的位置（地面监测站监测后告诉卫星，卫星一直广播自身星历），然后观测自身距离多颗卫星的位置（用户接收机接收到多颗卫星的信号，得知相对距离），便能知道自身在地球坐标系的位置。 打个简单的比方，在一条单向高速公路上，前车一直在广播它距离起点的位置（这个是路边监控告诉它的），而我们能够测得距离它的位置，所以我们也就知道了自身距离起点的位置。GPS 中是需要观测到至少四颗卫星，来解算三维坐标和用户设备时间和卫星时间的差异。 这之中涉及到了坐标系和时间标准的统一，所以我们可以用 GNSS 来进行给自身定位，给时间高敏感度的设备进行授时（比如服务器时间）；而如果用户装有双天线，便可同时知道自身的朝向；而同时由于卫星或用户在移动，接收到的电磁波发生了多普勒效应，可以用来测速；而我国的北斗还提供了低成本的短报文服务。 GPS 可以观测得到空间坐标系的三维坐标值，加上陀螺仪和加速度计，便可以得到在空间中的完整姿态，在此对惯性导航先不赘述，待笔者写完 IMU 传感器后再来详细剖析惯性导航。 时空参考坐标系全球定位系统的基本任务是确定用户在空间的位置，首先需要设立适当的坐标系。 空间系统天球坐标系为了确定卫星，宇宙飞船等在宇宙空间的位置和飞行状态，首先需要确定一个在宇宙空间可视为不变的参考系。空间卫星不被地球自转影响，但是观测站和用户都会跟随地球自转。 假设以地球的质心为球心，半径为无穷大的球（天球）存在于宇宙空间，选天球中心为天球坐标系的原点，而地球绕其极轴自转就像是个大陀螺，由于陀螺的定轴性，地球的极轴在宇宙空间的指向（赤道平面法向量）是稳定不变的，可以选作固定不变的轴来作为天球坐标系的坐标轴。 而地球绕太阳公转的轨道平面（黄道平面）也是稳定的平面，黄赤交角即为春秋分点，两点和质心的连线可以定义坐标系的另一条轴，然后构成右手坐标系，地心天球坐标系，简称天球坐标系，其不随地球的自转而变化。 天球赤道和黄道 岁差和章动然而黄赤交角不变是一种理想假设，陀螺仪的自转轴在干扰力矩的作用下存在进动和章动，地球也是一样，存在日月岁差和章动。 日月岁差是日月行星引力共同作用的结果，使地球自转轴在空间的方向发生周期性变化。在天体上，以这种规律运动的北天极通常称为瞬时平北天极或简称为平北天极，与之相应的天球，赤道和春分点称为瞬时天球，平赤道和瞬时平春分点，简称平天球，平赤道，平春分点。 北天极除了这种有规律的长周围的运动外，在天体力各种天体力的影响下，还存在有短周期的变化，他叠加在岁差运动上，使得瞬时北天极（真北天极）绕瞬时平北天极（真北天极）旋转，大致行程椭圆轨迹（叠加起来便类似正弦轨迹），称之为章动。 只考虑岁差为平，考虑章动为真。 春分点的漂移方向和章动影响 以上两种天球坐标系都是动坐标系，它们相差一个章动角，并非静止的惯性坐标系。为此需要建立一个指向保持稳定不变的天球坐标系，用它来代表惯性坐标系，这就是人为定义的协议天球坐标系，以 2001 年 1 月 15 日时的指向为标准历元。 地球坐标系然而实际上，由于地球内部存在着复杂的物质运动，地球并非刚体，北地极在地球表面随着时间的变化而不断变化，这种现象称为地球极移（极移）。 为此在一系列瞬时地球坐标系中人为定义了一个特殊地球坐标系（协议地球坐标系），使其 Z 轴朝向某一固定的基准点，它随地球自转，在地球球体中的指向不再随时间而变化。 有了地心和极轴，再靠零度经线和赤道的交点定义出另一条轴，则可以建立地心地固坐标系（ECEF），然后根据测定的地球海拔高度的测量，建立世界大地测量系统（WGS-84，或者 更适合各地的 datum，如 IGS，推荐 epsg 网站可以了解更多 datum），球坐标式的表达则是我们熟悉的经纬高（高度的定义也取决于使用的 datum），然后变换到地面某一点为原心则是站心坐标系（ENU / NED）。 用不同的方式将地球投影到一张平面图上，可得到不同投影展开的平面地图（比如等角正切方位投影，等积斜切方位投影，等距正割圆锥投影，等积正割圆锥投影，等角正割圆锥投影，等角正切圆柱投影 Mercator Projection，等角横切椭圆柱投影， UTM 投影等）。 各种常见地图投影方式 地心地固坐标系、站心坐标系和墨卡托投影、UTM 地图投影详情可以参考之前写的高精度地图（一）——地理坐标系。 时间系统前述各种天球坐标系和地球坐标系的给定，无不和时间瞬时相关，卫星的位置在过程中是变化的。并且 GPS 定位是通过接收机接收的信号，测定卫星到接收机的信号传播时间，来确定接收机到卫星的距离，进而确定接收机的位置。因此在给定卫星的位置坐标时，必须给出相应的瞬时时刻。 一般来说时间参考系统的物理实现，必须具有可观测的周期运动，这种周期运动应具备连续性稳定性和复现性，三者缺一不可。在实践中所选择的周期运动现象不同，便产生了不同的时间系统。 恒星时、平太阳时、世界时恒星时的原点定义为春分点通过本地子午圈的瞬时。而春分点有真春分点，和平春分点之别，相应的也就有了真恒星时和平恒星时之分。 平太阳时的原点定义为平太阳通过观察者所在子午圈的瞬时。 由于平太阳时的地方性，地球上不同经纬圈上的平太阳时各不相同，地球上零经度子午圈（格林尼治子午圈）所对应的平太阳时，且以平子夜为零时起算的时间系统成为世界时。 原子时、协调世界时、GPS 时现代物理学发现物质内部原子的跃迁所辐射或吸收的电磁波频率具有极高的稳定性和复现性。所以根据这一物理现象所建立的原子时，便成为了当代所理想的时间系统。 原子时的秒长比世界时的秒长略短，这就是原子时比世界时每年约快一秒多。两者之差逐年积累，为了避免原子时与世界时之间产生过大的偏差，同时又要使两种时间系统同时并存，就有必要建立一种兼有两种时间系统各自优点的新的时间，这就是从 1972 年起所采用的协调世界时。 全球定位系统为了满足精密定位与导航的需要，在系统设计与试验之初就建立了自己专用的时间系统 GPS 时，它由 GPS 主控站的高精度原子钟守时与授时。 GPST 属于原子时系统，它的秒长即为原子时秒长，GPS 的原点与国际原子时相差固定秒数。 实际上 GPS 时由于设备内存问题，会周期性进行重置，时间计数器最多只能向前计数 1024 周，即大约 19.7 年。 经过 1024 周后，此计数器会进行重置，GPS 时间将重新开始向前计数。第一次重置发生在 1999 年 8 月。 第二次重置发生在 2019 年 4 月 6 日。 Unix 时间戳而用户的计算机设备通常也会包含 Unix 时间戳，Unix 时间戳是从 1970 年 1 月 1 日（UTC/GMT 的午夜）开始所经过的秒数，不考虑闰秒。在大多数的 Unix 系统中 Unix 时间戳存储为 32 位，这样会引发 2038 年问题。 GNSS 介绍发展GPSGPS 是军民合用的系统，但它针对军用和民用提供了不同的定位精度。军用为 3 米，民用信号增加了干扰机制，使精度下降到 100 米。鉴于 GPS 在民用中发挥越来越重要的作用，美国政府 2000 年初取消了 GPS 的干扰机制，使民用信号的精度提高了 10 倍以上，大大方便了民用用户的使用，也为 GPS 的普及奠定了基础。 为了更好地进行国际间的兼容和 交互操作，实现全球民用卫星导航系统的无缝隙连接，美国第三阶段发射的卫星，附加 GPS 第四个民用信号 L1C，该信号能够与伽利略公开服务信号互操作，并与日本准天顶系统（Qzss）共用。 Beidou第一代北斗系统由三颗卫星提供区域定位服务。从 2000 年开始，该系统主要在中国境内提供导航服务。2012 年 12 月，北斗一号的最后一颗卫星寿命到期，试验系统停止运作。 北斗二号系统是一个包含 16 颗卫星的全球卫星导航系统，分别为 6 颗静止轨道卫星、6 颗倾斜地球同步轨道卫星、4 颗中地球轨道卫星。 2012 年 11 月，第二代北斗系统开始在亚太地区为用户提供区域定位服务。由三种不同轨道的卫星组成，包括 24 颗地球中圆轨道卫星（覆盖全球），3 颗倾斜地球同步轨道卫星（覆盖亚太大部分地区）和 3 颗地球静止轨道卫星（覆盖中国）。北斗三号系统于 2020 年 7 月 31 日开通。 我国的北斗系统采用三频信号向用户广播导航数据。三频信号可以更好地消除高阶电离层延迟影响，提高定位可靠性，增强数据预处理能力，大大提高模糊度的固定效率。而且如果一个频率信号出现问题，可使用传统方法利用另外两个频率进行定位，提高了定位的可靠性和抗干扰能力。 北斗卫星导航的短报文通信服务 也是一项实用性很强的原创功能。这一特色功能也是有容量限制的，所以并不适合日常通信功能，而是作为紧急情况通信比较合适，作为求救使用。 Glonass俄罗斯的格洛纳斯卫星采用频分多址技术，这是与其他主要导航系统明显的一个区别。所有的格洛纳斯卫星都发射同样的伪随机码，但采用不同的频率发射。具有某些抗干扰和抗互相关的特性，以及更简单的选码判据，可以防止整个卫星导航系统同时被敌方干扰，因而具有更强的抗干扰能力。频分多址技术的缺陷就是用户接收机的体积大而且造价昂贵，应用普及度还远不及 GPS，主要是因为俄罗斯长期以来不够重视开发民用市场。 格洛纳斯有两种导航电文，S 码电文和 P 码保密电文，两种电文的速率都是 50 位每秒。主要用途是提供卫星星历和频道分配方面的信息。 格洛纳斯所用的坐标系是 1990 年苏联所制定的 PZ-90 参考坐标系，与 GPS 所用的 WGS-84 也不相同。GPS 系统时与世界标准时间 UTC 相关联，而 GLONASS 则与莫斯科标准时间 UTC+3 相关联，除了存在跳秒外，与 GPS 时间之间还有数十纳秒的差异。 Galileo欧盟的伽利略系统采用了与 GPS 类似的码分多址技术来区别不同的卫星。为了提供更多的服务，伽利略信号结构比 GPS 的民用码信号复杂，其信号传输速率从 50 位每秒到 1000 位每秒不等。伽利略系统提供含有测距码和数据信息的导航信号，测距码由每颗卫星上的高稳定度星钟产生，数据信息则由地面上行注入站向卫星发送。导航电文的内容包括星钟、星历、识别码和状态标识等，以及能使用户预测星钟和星历精度的“空间精度信息”。 组成一、地面监控部分GPS 地面监控部分主要由分布在全球的 1 个主控站，4 个注入站和 6 个监测站组成。 GPS 地面监控部分的分布 地面监控部分部分数据流动为：卫星运行-&gt; 监测站观测 -&gt; 主控站计算 -&gt; 注入站注入 -&gt; 卫星得知星历（广播给地面接收机） 地面监测站监测站是在主控站控制下的一个数据自动采集中心，其主要装置包括 GPS 双频接收机、高精度原子钟、计算机、环境数据传感器等。 监测站的主要任务是通过接收机对 GPS 卫星进行连续观测和数据采集，收集积分多普勒观测值、卫星时钟、工作状态数据等数据。同时通过环境传感器采集有关当地的气象数据，传送给主控站。 主控站负责协调和控制地面监控部分的工作，通过接收、处理所有监测站传来的数据，计算卫星星历、时钟修正、状态数据、信号电离层延迟修正等，编算导航电文并传送到注入站，诊断卫星状态，调度卫星。 坐落于美国科罗拉多州 Falcon 空军基地的主控站是地面监控部分，甚至整个 GPS 的核心。具体实现以下功能： 采集数据、推算编制导航电文。采集监测站所测的伪距和积分多普勒观测值、气象参数、卫星时钟、卫星工作状态、各监测站工作状态参数、根据搜集的全部数据，推算各个卫星的星历、卫星钟差改正数、状态数据以及大气改正数、传送到注入站注入。 给定全球定位系统时间基准。计算各个卫星的钟差，以确保各颗卫星的原子钟与主控站的原子钟同步，维护 GPS 的时间基准； 协调管理所有地面监测站和注入站系统，诊断所有地面支撑系统和天空卫星的健康状况，并加以编码向用户指示。 调整卫星运动状态，启动备用卫星。根据观测到的卫星轨道参数以及卫星姿态参数，发生偏离时发出调整卫星轨道的控制命令，确保卫星沿预定的轨道和正确姿态运行；监视卫星是否工作正常，并在卫星出现故障、失效的情况下启动备用卫星。 地面注入站导航卫星注入站是指向在轨运行导航卫星注入导航电文和控制指令的地面无线电发射站，是导航卫星系统地面运行控制的组成部分。注入站的主要设备报考一套直径 3.6m 的天线，一台 C 波段发射机和计算机。 注入站接收主控站送来的导航电文和卫星控制指令，经射频链路上行发送给各导航卫星。 导航电文通常包括预报的卫星轨道参数（即卫星星历表）、卫星时钟偏差参数以及轨道和钟差的改正参数等。 卫星控制指令通常包括有效载荷控制指令和卫星平台控制指令。 二、空间星座部分GPS 空间卫星星座，比如保证在地球各处能同时观测到高度角为 15° 以上的至少 4 颗卫星。GPS 全球定位系统的空间星座由 24 颗工作卫星构成，其中 3 颗为备用卫星，部署在 6 个轨道平面，平均高度约为 202002km，运行周期为 11h58min。 卫星主体呈柱形，星体两侧装有两块双叶向日定向太阳能帆板，全场 5.33m，接收日光面积为 7.2m²，以保证卫星正常工作用电。 星体底部装有多波束定向天线，其波束方向图能覆盖约半个地球。星体两端面上装有全遥测遥控天线，用于与地面监控网通信，还装有姿态控制系统和轨道控制系统。 核心设备是高精度铯原子钟（稳定度 10^-14~10^-14），为 GPS 提供高精度的时间标准。 GPS 卫星采用多种编号识别系统，在导航定位种通常采用 PRN 编号（伪随机噪声码 pseudo random noise code） 卫星星座轨道分布 三、用户设备部分GPS 接收机部分主要由接收机硬件（主机、天线、电源）、数据处理软件、微处理机和终端设备组成。 空间星座部分和地面监控部分为卫星确定了准确位置，然后需要多颗卫星广播给用户自身信息，用户通过 GPS 接收机接收到多颗的卫星轨道信息（相当于用多个卫星建立了一个坐标系）和时间（计算出到各个卫星的距离），于是用户就知道了用户相对于卫星星座的位置，而卫星星座相对于地球的位置是已知的，所以就能知道用户在地球的具体位置。 信号接收处理单元是 GPS 接收机的核心单元，接收来自天线的信号，经过中频放大，滤波和信号处理，实现对信号的跟踪、锁定、测量，由跟踪环路重建载波解码得广播电文并获得伪距定位信息。根据需要，GPS 接收机可以设计成 1~12 个通道供选择，每一个通道在某一时刻跟踪一颗卫星，当次卫星被锁定时，便占据这一通道。现已广泛采用并行多通道技术或同时相关型通道技术。 性能衡量用户使用 GPS 时的性能，主要参考以下指标。 准确性：准确性用来衡量定位结果与目标的真实相接近的程度，是定位结果与真实位置值的差异，而精度可以理解为重复性。列入对于静态定位而言，若接收机的多次定位结果基本集中于一点，则说定位精度很高，尽管可能偏离真实值一定距离。 正直性（可靠性、完整性）：定位系统在出现故障时能及时警告用户，以免用户被非正常工作的定位系统所误导。 连续性：系统在一段时间内能连续地同时满足所规定的准确性和正直性要去的概率。 有效性：定位系统能同时满足准确性、正直性和连续性要求的时间百分比。 首次定位所需时间：接收机启动后到获得第一个定位结果所需要经历的时间； 灵敏度：衡量接收机能接收到多弱的 GPS 信号。 城市峡谷中的性能：在城市峡谷中时，接收机在一定时段能实现定位的个数与该时段内总的定位历元数之比成为定位有效率。 原理星历数据描述任意时刻卫星在空间的位置的一组参数称为卫星星历。 GPS 卫星在空间的瞬时位置作为已知参数，以星历的方式，在卫星绕地球运行的过程中，连续不断的向地球地面用户播发，用户通过测量对卫星的相对距离，进而确定自己在地球上的位置实现高精度的定位和导航。 为了理解和运用 GPS 卫星的轨道信息，需要了解有关卫星的运动规律，轨道的描述，以及卫星位置的计算。而卫星的运动规律和轨道描述为天体物理学开普勒三大定律相关的知识，具体可以参考 GPS 定位笔记 4 (轨道理论和星历和历书)， 在此不做展开。 利用 GPS 进行导航和定位就是根据 GPS 卫星发布的卫星轨迹信息，结合用户的观测资料，通过数据处理来确定用户的位置，速度乃至姿态等参数，所以星历（精确描述轨道的一组参数）是实现精确定位与导航的基础，GPS 卫星星历的提供方式一般有两种，一种是预报星历（广播星历），另一种为后处理星历（精密星历）。 预报星历是一组这样的数据，它包含相对于某一参考历元的开普勒轨道参数和必要的轨道摄动改正项参数。 GPS 卫星的广播星历更新频率很快，每小时就发布一组最新的星历。 广播星历一共有 16 个星历参数，其中包含一个参考历元，6 个相应于参考历元的开普勒椭圆轨道参数，和 9 个反应摄动力影响的改正项参数。 GPS 卫星轨道参数示意图 参考时刻的平近点角 $M_{so}$ 平均运行速度差 $\\Delta n$ 轨道偏心率 $e$ 轨道长半轴的方根 $\\sqrt{a_s}$ 参考时刻的升交点赤经度 $\\Omega_0$ 参考时刻的轨道倾角 $i_0$ 近地点角距 $\\omega$ 升交点赤经变率 $\\dot{\\Omega}$ 轨道倾角变率 $\\dot{i}$ 升交距角的调和改正项振幅 $C_{uc}, C_{us}$ 卫星地心距的调和改正项振幅 $C_{rc}, C_{rs}$ 轨道倾角的调和改正项振幅 $C_{ic}, C_{is}$ 星历参数的参考历元 $t_{oe}$ 星历数据的龄限 $AODE$ 为了满足大地测量学和地球动力学，对高精密度定位的要求，需要精确地刻画某时刻的卫星轨道参数，即后处理星历。后处理星历是一些国家的有关部门根据各自建立的 GPS 卫星跟踪站所获得的 GPS 卫星精密观测资料，采用确定预报星历相似的方法，计算出以前任意观测时刻的卫星星历。它是一种根据观测资料事后计算的时间和星历对应的精密轨道信息库。 卫星信号用户 GPS 接收机接收到的 GPS 卫星广播的信号，测定由卫星到接收机的信号传播时间延迟，或测定卫星载波信号相位在传播路径上变化的周数解算出由接收机到卫星之间的距离（应含误差，而被称为伪距），从而确定 GPS 接收机的位置和时间改正数。 GPS 卫星播发的信号包含三种成分，即数据码、测距码和载波信号。数据码中包含多种与导航有关的信息，这些信息是卫星的星历，卫星钟差改正数，测距时间标志及大气折射改正参数，以及由 C/A 码捕获 P 码得到的其他导航信息，这些信息为 GPS 导航定位提供数据基础，故又称为导航电文。 GPS 卫星信号示意图 GPS 卫星信号采用了组合码调制技术，即将编码脉冲（即导航电文或者基带信号）先调制到伪随机码，即经过伪随机码扩频成为组合码，再对 L 波段进行双向调制，然后由 GPS 卫星天线发射出去，使用两个载波频率发射，是为了对大气层效应产生的附加延时进行双频矫正。 GPS 发射信号构成原理图 导航电文导航电文是二进制编码文件，按规定格式组成数据帧，按帧向外播放，每帧电文含有 1500bit，播送速度是每秒 50bit，所以一帧电文的播放时间是 30 秒。 每帧电文还有 5 个子帧，每个子帧含有 10 个字，每个字为 30bit，所以每一子帧共含有 300bit，按上述比特率 50bit/s 速度播发，每幅子帧需播放 6 秒。 导航电文格式 第 1、2、3 子帧中含有该卫星的广播星历和卫星星钟修正参数，每小时更新一次，第 4、5 子帧中存放所有空中 GPS 卫星的历书，信息量比较庞大，故子帧 4、5 各含 25 页。4、5 子帧是空中全部 GPS 卫星的历书，它的内容仅在地面注入站注入新的导航数据后才更新，现也有技术根据设备接入互联网网络获取附近基站拿到过的所有卫星历书。 导航电文的内容 遥测字 TeLemetry Word：包含捕获信息的前导，遥测电文（地面监控系统注入数据的状态信息、诊断信息和其他），指示用户是否选用该卫星。 转换字 How-hand Over Word：提供用于捕获 P 码的 Z 计数（从每周六-周日子夜零时起算的时间计数），可以实时了解观测瞬时在 P 码周期中所处的准确位置，预先确定码的移动量，使本机产生的伪随机码的码元与即将到来的卫星信号 P 码码元相匹配。 数据块 1：卫星时间计数器 WN，调制码标识（C/A 或 P），卫星测距精度 URA，数据是否正常，电离层延迟改正参数，时钟数据龄期，卫星时钟参数对应的参考时刻，卫星钟改正参数。 数据块 2：开普勒六参数，轨道摄动九参数，卫星星历参考时刻，广播星历外推时间间隙。 数据块 3：全部 GPS 卫星星历概略模式，健康状况和 GPS 星期编号，方便用户利用码分址较快的捕获其他合适的卫星信号。 坐标计算方式用户的 GPS 接收机收到轨道信息轨道参数后，计算出卫星在地球坐标系中的位置，然后地球 GPS 接收机通过测码伪码或测相伪距的处理方式，实时测量卫星到用户的距离。由于存在卫星和接收机时间不完全同步，且载波信号受到电离层和对流层的折射影响，所以测得的距离称为伪距。 于是利用 GPS 进行定位，在几何意义上的解释就显得非常简单清晰，GPS 卫星在地球坐标系中的位置坐标已知。 比如 $(x_i,y_i, z_i)$ 为卫星 i 在协议地球坐标系中的位置，而我们测得的到卫星 i 的距离为 $\\rho_i(\\Delta t)= \\sqrt{(x-x_i)^2 + (y-y_i)^2 + (z-z_i)^2 }$ 而接收机又收到了四颗卫星便能联立解方程组，解得关于三维坐标和用户钟差的方程。 测码伪距观测量：测量 GPS 卫星发射的测距码信号到达用户接收机天线的电波传播时间。因此这种观测方法也称为时间延迟测量。 测相伪距观测量：卫星载波信号由发射到被接收，其间载波信号传播的相位称为载波相位观测量（测相伪距观测量）。由于载波频率高波长短，所以载波相位测量精度高。 开普勒积分计数伪距差： 卫星相对于地面的 GPS 接收机存在着相对运动，因此接收到的信号中存在着多普勒平移。利用多普勒平移测得相对距离。 干涉法测量时间延迟：目前广泛采用前两种（码相位观测量和载波相位观测量）进行定位测量，第 3 种多普勒积分计数法静态定位需要数小时的观测时间，一般应用于大地测量之中，在动态应用中多普勒测量，可用来计算测站的运动速度。而用最后一种干涉法测量时所需的设备相当昂贵，数据处理也十分复杂，它的广泛应用上待进一步的研究开发。 误差影响与消除卫星星历误差由于卫星在空中运行受到多种摄动力影响，地面监测站难以充分可靠的测定这些摄动力的影响，使得测定的卫星轨道会有误差。 同时监测系统的质量，如跟踪站的数量及空间分布轨道参数等的数量和精度轨道计算时，所用的轨道模型及定轨软件的完善程度，应会导致星历误差。 此外用户得到的卫星星历并非是实时的，而是由 GPS 用户接收的导航电文中对应于某一时刻的星历参数而推算出来的，由此也会导致计算卫星位置产生误差。 为了尽可能削弱星历误差，对定位的影响一般常采用同步观测求差法（卫星星历误差对相距不太远的两个测站的定位影响大致相同，因此采用两个或者多个近距离的观测站对同一个卫星进行同步观测，然后求差）或轨道改进法（在数据处理中引入表示表述卫星轨道偏差的改正数，并假设在短时间内这些改正参数为常量，并将其作为待求解量与其他位置参数一并求解，从而较正星历误差）。 卫星时钟误差卫星上使用高精度的原子钟，但由于这些钟与 GPS 标准时之间会存在着随时间变化的频偏频飘，导致星钟和 GPS 标准时之间的不同步偏差。主要通过接收机对星钟误差，进行二项式拟合求解来进行消除。 电离层误差电离层的折射率与大气电子密度成正比，和穿过的电磁波频率平方成反比，对于频率确定的电磁波而言，电离层折射率仅取决于电子密度。 电离层的电子密度随太阳及其他天体的辐射强度，季节，时间，以及地理位置等因素的变化而变化。 为了减弱电离层的影响，在 GPS 定位中通常采用以下措施， 利用双频观测加以修正。 利用电离层模型加以修正。 利用同步观测值求差。 对流层误差对流层与地面接触，并从地面得到辐射热能，其温度一般随将，除了与高度变化有关外对流层的折射率与大气压力，湿度和温度密切相关。减少对流程折射，对电磁波延迟影响的措施主要为： 当基线较短时气象条件稳定，两个测站的气象条件相似，利用基线两端同步观测量求差，可以有效的减弱甚至消除大气层折射影响。 利用在观测站附近实测的地区气象资料，完善对流层大气改正模型，可以减少对流层对电磁波延迟的影响的 90%。 多路径多路径效应通常也叫做多路径误差，接收机存在接收到卫星发射的信号外，尚可能收到天线周边建筑物或者水面的一次或多次反射的卫星信号，这些信号叠加起来会引起测量参考点位置的变化，从而使观测量发生误差。 反射波除了存在相位延迟外，信号强度一般也会减小，其原因是一部分能量被反射面所吸收，同时由于反射面会改变波的极化特性，而接收天线为右旋圆极化天线对于改变了极化特性的反射波，存在着抑制作用。 多路径误差取决于反射物距测站的距离和反射系数，以及卫星信号的方向等条件因素，无法建立起准确的误差改正模型，只能改善环境或者选择造型适宜屏蔽良好的天线，或者延长观测时间，改善接收机电路设计。 接收机噪声天线观测误差、接收机钟差、天线相位中心的的位置偏差、载波相位观测整周期未知数、地球自转、相对论效应。 精度码GPS 的精度级别分为两种： SPS（Standard Position System 标准定位系统）：最常见的定位系统，水平方向精度为 30 米，使用 C/A 码。 PPS（Precis Position System 精密定位系统）：过去只提供给军事或国家使用，使用 P 码，精度达水平 15 米，垂直 27.7 米。 民用通常只是 SPS，使用粗码 （C/A 码），指定单位设备可使用 PPS，更甚至可以接入 RTK 差分服务。 测码伪距测量误差 (URE) 差分定位 Differential GPS是首先利用已知精确三维坐标的差分 GPS 基准站，求得伪距修正量或位置修正量，再将这个修正量实时或事后发送给用户，对用户的测量数据进行修正，以提高 GPS 定位准确度。 差分定位示意图：卫星，基准站，移动站 根据差分 GPS 基准站发送的信息方式可将差分 GPS 定位分为三类，即：位置差分、伪距差分和相位差分。 这三类差分方式的工作原理是相同的，即都是由基准站发送改正数，不同的是，发送改正数的具体内容不一样，其差分定位精度也不同。 位置差分： 最简单的差分方法，由于存在着轨道误差、时钟误差、SA 影响、大气影响以及其他误差，接收机解算出的坐标与基准站的已知坐标是不一样的， 存在误差。基准站利用网络将此改正数发送出去，由用户站接收，并且对其解算的用户站坐标进行改正。 最后用户坐标已消去了基准站和用户站的共同误差，例如卫星轨道误差、 SA 影响、大气影响等，提高定位精度。适用于基准站和用户站观测同一组卫星的情况，用户与基准站间距离在 100km 以内的情况。 伪距差分： 伪距差分是用途最广的一种技术。几乎所有的商用差分 GPS 接收机均采用这种技术。基准站的接收机知道自身的精确位置，便可知到卫星的距离，并将此计算出的距离与含有误差的测量值加以比较。然后将所有卫星的测距误差传输给用户，用户用来改正测量的伪距。 与位置差分相似，伪距差分能将两站公共误差抵消，但随着用户到基准站距离的增加又出现了系统误差，这种误差用任何差分法都是不能消除的。用户和基准站之间的距离对精度有决定性影响。 相位差分： 载波相位差分技术又称为 RTK 技术（Real Time Kinematic），是建立在实时处理两个测站的载波相位基础上的。它能实时提供观测点的三维坐标，并达到厘米级的高精度。 基准站通过网络实时将其载波观测量及站坐标信息一同传送给用户站。用户站接收 GPS 卫星的载波相位与来自基准站的载波相位，并组成相位差分观测值进行实时处理，能实时给出厘米级的定位结果。 实现载波相位差分 GPS 的方法分为两类：修正法：与伪距差分相同，基准站将载波相位修正量发送给用户站，以改正其载波相位，然后求解坐标。差分法：将基准站采集的载波相位发送给用户台进行求差解算坐标。前者为准 RTK 技术，后者为真正的 RTK 技术。 Reference以上内容参考自 《GPS 原理与接收机设计》-谢钢-电子工业出版社 《GPS 导航原理与应用》-王惠南-科学出版社 GPS 定位技术 - 李理的博客 知乎专栏文章：GPS 定位笔记 4 (轨道理论和星历和历书) 牛老师的集思空间：地图投影介绍 欢迎在我的专栏「自律走行」中查看更多「走进自动驾驶传感器」系列文章 走进自动驾驶传感器（一）——激光雷达 走进自动驾驶传感器（二）——毫米波雷达 走进自动驾驶传感器（三）——卫星导航系统","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"gps","slug":"gps","permalink":"http://www.yvonshong.com/tags/gps/"},{"name":"gnss","slug":"gnss","permalink":"http://www.yvonshong.com/tags/gnss/"}]},{"title":"与世界连接","date":"2021-02-21T10:00:00.000Z","path":"2021/02/21/link-to-world/","text":"时间在记忆中是非线性流逝的，你的少年光景，被压缩成弹指须臾，你正在经历的故事，结束之后空留一地虚无。 这或许是时间，也或许是大脑造成的影响，举个例子，是我们对近几个月的记忆是最清晰的，越往前越是模糊，像是几年前的故事会慢慢只记得零星片段； 其实是因为没有新鲜体验，一天重复了一年，大脑为了解决存储和检索问题就压缩删除了重复文件。如果想要对抗时间带来的此般副作用： 去拥有更多不一样的体验，跳出舒适圈，去做没有做过的事情。 整理构建自己的检索系统，包括但不限定于定期反思记录，整理照片文件。 可这也只能让记忆变得清晰，但仍没有赋予意义。这其间安置我的怅然若失，给人生历程留下记忆锚点的，是仪式感。会习惯性收集拍立得，机票火车票，纪念品徽章，然后将它们挂在卧室墙上，成为了我的意义容器，使得曾经的某一刻变得不一样。 仪式感是什么呢？《小王子》里那只等爱的狐狸会说: 比如，你下午四点来，那么从三点起，我就开始感到幸福。时间越临近，我就越感到幸福。我就发现了幸福的价值 「是设定一个时刻，然后开始期待那个时刻的过程。它使某一天与其他日子不同，使某一时刻与其他时刻不同。」 「仪式感」和「年度总结」是我这几年感受到的，最有效的，抵抗时间流逝的武器，它们帮我重新构建了光阴在脑海里的数据结构，把带有艾宾浩斯遗忘曲线性质的非线性的记忆，拉直到了和里程碑一样的均匀，时间在我的年度总结里均匀地流逝，线性化成了每年一篇总结，线性化了我的双月目标，线性化成了每一次期待那个时刻的过程记录，线性化成了我每年整理我的照片，然后清空手机从头开始，整个记忆在脑海里有了按年或者是按仪式来索引的主键，毕竟，数据结构教会我们，树是远比遍历来得有序高效。 而计划与总结是从高中就开始养成的习惯，只是花了一些时间来探索将其应用到工作后的日子里。以往是会制定年度计划，然后年终再回看各个项目的完成情况，可是后来发现，一年的时间仍然还是太漫长了，比如 2020 年，就充满了无数的变数。所幸的是公司内一直在推双月 OKR, objective key results, 两个月制定一次接下来两个月的计划，并区分优先级重要性和产出形式，双月结束后对结果产出进行 review。应用在生活的时候，我发现 review 时不仅要对完成度进行评估，也要超脱这件事情，从更形而上学的层面进行理论的分析。以前一直在犯错误，总结时会堆砌太多故事情节型的回忆，可是这只能丰富我讲故事的人生素材，还需要多做因果推理型的反思，跳出当事人的角度，以元认知的方法，对自己当时的感知、记忆、思维等各种认知活动本身，进行再感知、再记忆、再思维。简单的来说，是思考我当时为什么会有这样的情绪，为什么会做出这样的决定。 我们经历的事情丰富了我们的故事素材，但也还要努力学会如何去讲故事，把握讲故事的节奏。我发现自己缺乏能够张弛有度跌宕起伏的讲述故事的能力，做研究写报告如是，剪 vlog 亦如是。所以才会对 Tim 的 Rhythm 如此有共鸣，HKRR，H，happiness，快乐，能给人带来快乐的视频会有天然的传播性。K，knowledge，知识，有足够的知识才能让视频变得有价值，给人留下印象。R，resonance，共鸣，打动人心，优秀作品普遍具有的特质，和观众产生共鸣，才能传达情感。R，Rhythm，节奏，万物都有它的节奏，当你感受到它的时候，你能将一切，都连接到一起。 接下来请听一听，我这一年里的故事。 2020 年，是我人生轨迹变化的一年，自己实现了近年来最大的阶段性目标，实现了毕业时的愿望，我终于来到了自己喜欢的城市，在看得见城市地标的地方工作生活。也曾去过很多地方，无论是曾经在日本独自去过的旅行还是在国内玩，如今每次回上海从舷窗看下这中国最大的都市圈，有了更多关于生活在喜欢的城市的感受。 2020.09.16 上海 | 不同时分的切片 关于为什么想来上海，其实是一个很漫长的故事，2013 年第一次来上海，从此这座城市给我留下了更多关于人的回忆。 今年暑假的时候去上海找同学玩，夜也要深了的时候，我搭着伙伴逛校园，我在前面像是在独白一样讲我的一些心事。 “我觉得上海是中国最好的城市诶，这么多年了你喜欢它么？” “我觉得我挺喜欢南京的。” “可是我前一段时间读一本散文集啊，卡尔维诺的《看不见的城市》，他说，其实城市和城市都是相似的，每个城市都会有它的地标，公园，学校等等等等。就像我喜欢成都，很多原因是因为我在那个城市发生了很多的故事遇见了很多的人。所以大概我喜欢南京也是因为，我爱那些在这座城市遇到的人吧。” ——2016.09.19 《那么多的人，你要去哪里》 2017 年的时候去了两次东京，对城市有了新的感受。 我还是想要在大城市生活啊，既然城市都是一样的，那为什么不去一个更好的更大的城市呢？ ——2018.06.17 《充实人生的常态是成长的阵痛 》 那时候的我在想，我以后会生活在哪一个城市呢，自己的房间有一面墙不仅要贴满拍立得，也要贴满收到的明信片。会继续练习做饭，嗯已经开始期待起来了呢，我一定会成为一个对待生活温柔的人吧。 还好算是去过一些城市，它们从方方面面刻画出了我理想的城市，最后在临近毕业必须得做选择的时候，算是了然，上海是我心中综合意义上最好的城市，包括政治，经济，文化，气候等等因素。且不说它的经济中心，无数的展子，更不用说熟悉的南方的气候，还常能看见蓝天。单是走在干净的街道上，便足以令我心生愉悦。 说起来这一年能来上海，并搞定了落户，也是托了很多人的福，两年前和伙伴去若松的 JR 上，当时我拿了 TuSimple 的 offer，他找到了 Horizon Robot 的工作，两个公司都在北京，但听说他司在上海安亭注册新公司了，我忽然灵机一动，说是不是可以把合同和社保都挂在上海，人先在北京上班，这样就能有上海留学生落户资格了？于是就这样操作了，交了远超半年的社保，一直没有机会常驻。而今年疫情期间，老板觉得远程工作，线上会议同步，其实影响也不大，终于允许了派我过来。得到应允后的第二周我便动身，在 25 岁生日的第二天，来到了上海。然后三个月内搞定了落户拿到了新身份证。 算上这一次搬家，大概是第十一次来上海了，朋友送我的生日礼物是个烤箱，比我还先到我的住处，第一次抱着常驻的心理，更或者说会努力想在此定居？开始了在这里真正意义上的生活。卧室的窗户可以远远的看到陆家嘴三件套，配合远处复旦的一排排树林，总有一种当年路过新宿御苑的感觉。 ​​​​ 东京新宿御苑 2020.12.30 上海 | 阳光打在一墙的拍立得上 我做到了关于生活的设想 可其实我也说过，从一开始，城市是关于和人的回忆的现代载体，结果是上海太容易让人难过了，好几年在这里的见面都充满了太多阶段性告别的意味 ​​​。人都是会有去留的，为什么会留下那么多难过的回忆，如今却只剩下我独自面对了呢。 由于在上海 Office 上班，经常会需要回北京和同事进行一些进展的同步。某一次回京，碰巧认识几年的网友们组织线下聚会，其中有多年未曾见过面的社群组织者，也有一起玩过好几次的伙伴。伙伴还在清华读研，次年才毕业，和我聊起时说，很少看见毕业工作那么久后还过得很开心的人。当时的我不以为然，我觉得我一直在扮演着情绪稳定的成年人，虽然偶尔会跳出日常，但其实是那种，每次有人跟我吐槽身边的糟心狗血的事情时，我心里也会有“我已经很久没有此般波澜起伏”的感慨。过后我却开始在反思，为什么会是这样，是的，我终于有了从方法论上的领悟和进步，从元认知的角度分析自己。 为什么会一直维持情绪稳定，上一次情绪崩溃又是多久呢？ 可是当这样进行反思的时候，自己也难免不会陷入到了负面的情绪里面，会追忆起上一次的失望与挫败等等故事细节，凝视深渊的时候深渊也在凝视着你。可见情绪稳定也并不是必然的，只是大部分事情并没有产生刺激。 而我为什么会想去认知自我，是因为当年经历过这样的痛苦，独自与自我进行博弈，然后迷失在了过程中。所以能与一些人感同身受，并且事后反思我有发现克服的正确方法，见过黑暗也才能不害怕黑暗，所以才能对负面情绪免疫；而当我看到朋友有类似遭遇的时候，我的内心想法是想要帮助他们。因为不仅要学会如何避开情绪的陷阱，也要学会如何从情绪的陷阱里面爬出来。 25 岁生日，正是前往上海的前一天，在北京生活的最后一天，我独自去王小波墓前扫墓，朋友问我生日约了谁玩呢，我很郑重其事的回答说：「约了我自己」。也正是因为我能直面当时的我，终于学会了接纳自己，接纳包括自己在内的很多事物的不完美，接纳当时内心受尽挫折的自己，才能和当下的自己愉快地相处，也才会一直秉承生活不仅是需要有工作学习朋友家人，也需要有与自我相处时间的信念。并在这个过程中，持续地向内寻求力量，而不靠外界的评价来建立对自我的肯定，或是从中获得满足。其间当然也要能够修正自我的认知，比如不是为了吸引人而去变得更好，而是觉得变成那样好像很不错，才能够在心中指引方向，然后不撞南墙不回头，为此骄傲，为此我才是我。 2020.04.11 北京 | 王小波墓前 年末的时候，我看见之前实习时的老板分享他的感悟，人生的三个基本功，爱，韧，纳。初级阶段时是 真诚的「爱」自己的家人、朋友和组织 靠毅力「对抗」挫折 接纳包括自己在内的很多事物的不完美 终级阶段是 领悟人类共同体 挫折是进化的必经之路，欣喜而好奇的看待每一次挫折 接纳死亡 我觉得从中二时期的我，已经基本完成了对自我的建树，虽然有很多问题仍然会困扰我很久，但我今年更清楚明了了，人生的下一个阶段是与世界产生连接，认知事物的运作逻辑，重视人与人之间的关系。 也会经常自我探索，我喜欢什么样的人，想要和什么样的人建立怎样的连接。之前朋友说我要求太高，总是追求心动的 moment，现在想来我觉得应该仍是曲解了自己。 北卡罗来纳大学教堂山分校的 Barbara Fredrickson，在十几年的时间里持续研究“爱”这种感情和身体关系之间的关系。在这个过程中，她偶然发现在我们感受到“爱”这种情感的时候，我们会有一些神经和荷尔蒙的变化，而这些变化是短暂的。因此，她对“爱”这种感情提出了自己的研究成果：所谓“爱着一个人”的感受，并不是持续不断被我们体会着的。持续不断的爱是不存在的，只存在一瞬间一瞬间的爱。&nbsp; 这位心理学家把爱定义为一个个“发生了积极共鸣的微小瞬间”（micro-moment of positivity resonance）。在这些非常微小、转瞬即逝的时刻，两个人之间发生了美好的、令人产生正面感受的共振、回音，是在那些时刻里，我们把自己的感受称为“爱”。 moment 是神启，是点亮花火的瞬间，可是瞬间是并不能永恒的。需要的是彼此共同进步，维持或者继续创造吸引对方的品质，包括但不限定于过去曾经经历过的事情拥有了足够丰富的模型，对待事物有自己的看法，对未来有跳出舒适圈的勇气，敢于去冒险。有了持续的吸引，才能去持续创造那些瞬间，拥有共同的记忆。 这也就意味着，即便我们在说“我爱你”的时候，我们认为这是一种“持续的状态”，但事实上，我们体会到这种情感的方式仍然只能是通过一个一个的瞬间。 即便是最美好的一段关系，我们也不可能无时无刻体会到“爱”的存在。爱的本质，可能就是不连续的、断裂的、前后不一致的。 ——《持续不断的爱是不存在的，爱是一个个不连续的微小瞬间。| KY 研究：持续相爱的秘密》 可是这一年在和朋友的关系上感慨良多，或许是有与好朋友渐行渐远的草蛇灰线，无论因果，会开始有大家目的不趋同而产生的拉扯感，是一种节奏上的不一致，这种节奏不是指学习就业成家等人生阶段上的节奏，可能会是再具化到拟定目标完成目标的节奏，设定时限的长短和行动实现上的张驰，这一点我想得还不是很清楚？但我认为好朋友间的渐行渐远只是彼此之间的舒适距离在变大而已，但重要的是，我们需要达到舒适距离的共识，而不是放任自流，觉得一切随缘。一段良好的关系并不是说彼此频率一直一致，而是愿意去阐释，共同面对分歧达成共识。毕竟，任何关系都是需要维护的嘛。如果不认真对待一个朋友觉得随意可以失去，那么你就会失去所有朋友。 工作上开始学会界定问题，审视流程。在毕业入职两周年的时候，我反思这两年，工作上很多东西并不是说一定要按照做题一样标准解法去做的，工作更结果导向，我工作有一段时间一直被捶还有点原因是我一直就毫无岔路的想死胡同走到底。而人生还有很多问题是没有解的。从认知到我的方法有问题，再上一层，是明白事物方法论的重要性，不管是学习新东西，还是做研究做项目，掌握方法论加以练习，都能解决很多事情。 毕业之后的人生和在学校时的生活完全不同的点在于，学生时代，是靠累积时间和经验来获得升级，就算不付出太多，也能从大一升到大二；毕业之后，人生是靠无数挑战组织而成的，是面对无数闯关打怪，同时开多个副本，比如找工作、落户、结婚、买房、装修、买车等等等，并且有些只有打过了这一关你才能去往下一关；而当我意识到我现在就是在一关面前卡了很久，而时间的累积并不能帮我解决这个问题，那时，我终于毕业了。 开始明白人生的阶段性，开始意识到生活是由无数挑战支撑起来的，开始意识到树立短周期目标和 review 的重要性，开始明白方法论。开始区分相关性和因果性，也开始区分手段和目的，比如说我们在不同阶段面临的不同挑战便是手段而不是目的，我们并不是为了去完成关卡达成挑战而活的。就像皮克斯的电影《心灵奇旅》，twenty-two 坐在路边台阶，仿佛升格般看着生活日常时，我太感同身受了，我就是为了去拥有那些无数瞬间，去进入我管它叫做 inner peace 的状态。 2020.8.30 西藏林芝 | 南迦巴瓦峰前坐了六个小时 2020.8.15 浙江宁波 | 渔山岛民宿，狭长的走廊，窗外是一幅大海 那些，就是我的 moments 。 虽然上一个阶段的我做得还不够好，可是我终于觉得我毕业了，不会再局限于学生思维，不会再有靠年龄增长，便能自动升入高年级的幻想。 在无数次旅行中也开始沉淀我看待世界的方式，比如《VLOG#14 北欧 | 彩云易散琉璃脆 》中我明白了物哀，幽玄和诧寂。比如八月份英仙座流星雨的时候，去渔山岛看银河的旅程，我却是感悟到了和「时令」不太一样的东西。以前我写过一篇文章，讲自己独行，或者约会，或者组织集体活动时我会玩什么，《当我们约会时我们会玩什么》。当时我的核心观点是「时令限定」，而这次，讲一件具体的事情的话，当时我们躺在草坪里看银河，等待流星的划过，朋友说怎么能多看到几颗星星，我说，不要玩手机就行了。 宇宙从不屈服于任何意志，你只能遵循它的节奏，流星雨时你只能躺在草地上，听着音响放着 bgm，对着天空聊天就行了。万事万物都有它的频率，或者说是节奏，所以你会在一年里依次看过春夏秋冬，我们需要做的，是知晓它们的节奏，然后去适应，踩准它的频率，才能在旅途上获得与万物的共鸣。 能够了解自己的内心，能够与他人产生连接，能够对世间万事万物的运作规律感到好奇；但是人世间并不是只有自然科学，也有人与人之间的复杂连接产生的人文科学，比如之前一直喜欢看《观察者网》的王骁，他直言方法论，“看国际政治，要看体系怎么运作，基本权力结构是什么，主导意识是什么，有哪些利益集团，各个集团动机是什么”。比如又怎样才能像沈逸老师一样用长难句清晰的描述出人与社会之间的冲突矛盾，可能是我接下来五年十年想要去解决的问题。解决了和自我的相处的问题，需要去解决和人连接的问题。自己能和世界产生连接，和意识到自己能产生连接，是完全不同的，所以此间的方法论与归因才会如此困惑我。要如何才能发现它们的节奏，与世界共鸣，这就是我想要的连接。 2021 年，我知道我选择了一条 hard 模式的道路，可我是否依然会甘之如饴地不撞南墙不回头，我不知道，但我会为此坚持我的选择，并在这个过程中享受属于我的那些伟大时分。","tags":[]},{"title":"走进自动驾驶传感器（二）——毫米波雷达","date":"2021-01-24T05:59:00.000Z","path":"2021/01/24/approach-autonomous-driving-sensor-radar/","text":"在上一篇文章中 Yvon Shong：走进自动驾驶传感器（一）——激光雷达 ，我们介绍了激光雷达这款传感器的数据和特性，接下来我们要介绍的是目前市面上大部分高级驾驶辅助系统（Advanced Driver Assistance Systems）都搭载了的毫米波雷达。 由于最后本文篇幅长达两万字，并且在整理毫米波雷达传感器资料的时候，综合传感器硬件手册，网上相关资料，官网设备资料，信号处理教材，仿佛又重新学了一遍信号处理，所以将关于毫米波雷达性能指标部分复杂的公式推导放置在了文章最后，并且保证了符号定义的连贯性，保证大家可以从信号处理的基础回忆起，看懂每一个公式。 值得注意的是，本文中涉及到的 FMCW 毫米波雷达，其原理和 FMCW 激光雷达 完全相同，若您对 FMCW 激光雷达感兴趣，可阅读文章中公式推导部分。 欢迎大家点赞关注收藏（点赞求求了 Orz，上一篇收藏数远大于点赞），如需转载请私信联系。欢迎关注本专栏！以下为大纲，方便后续查阅： 毫米波雷达介绍 分类 频段 硬件结构 结构 参数指标 数据 特点 应用 市场 信号处理基础知识 FMCW 雷达原理 距离估算 速度估算 角度估算 Reference 毫米波雷达是工作在毫米波波段探测的雷达，频段一般为 30 GHz ~ 300 GHz， 波长 1~10mm，介于微波和厘米波之间，兼具有微波雷达和光电雷达的一些优点。目前各个国家对车载毫米波雷达分配的频段各有不同，但主要集中在 24GHz 和 77GHz，少数国家（如日本）采用 60GHz 频段。 在电磁频谱中，这种波长被视为短波长，也是该技术的优势之一。毫米波雷达相比厘米波雷达具有体积小、易集成和空间分辨率高的特点。 所以处理毫米波信号所需的系统组件（如天线）的尺寸也确实很小。短波长的另一项优势是高准确度，77GHz 左右（对应波长约为 4mm）的毫米波系统将能够检测小至零点几毫米的移动。 毫米波雷达基本工作原理是利用高频电路产生特定调制频率（FMCW）的电磁波，并通过天线发送电磁波和接收从目标反射回来的电磁波，可以同时对多个目标进行测距、测速以及方位角测量；测速是根据多普勒效应，通过计算返回接收天线的雷达波的频率变化就可以得到目标相对于雷达的运动速度，和飞行时间，来得到目标物距离。而方位测量（包括水平角度和垂直角度）是通过天线的阵列收到同一目标反射的雷达波的相位差计算得到目标的方位角。 毫米波雷达基本工作原理示意图 和脉冲雷达系统相比，调频连续波雷达的一大优势是发射功率低，尺寸小，成本低廉，测量目标的距离和速度的性能与周围环境的光照情况无关，并不需要额外的辅助光源提供照明。其较高的工作频率意味着整体解决方案的尺寸更小。 FMCW 雷达收发同时，理论上不存在脉冲雷达所存在的测距盲区，且可直接测量多普勒频移和静态目标概率，并且发射信号的平均功率等于峰值功率，只需要小功率的器件，具有容易实现、结构相对简单、尺寸小、重量轻以及成本低等优点。 分类距离雷达按照测量的距离划分为： 短距离雷达：探测范围比较大，但是探测的距离比较短。 长距离雷达：探测范围窄，距离长达 250m。 电磁波辐射方式可分为脉冲方式以及连续波两种工作方式，其中连续波又可以分为： 频移键控 FSK：最常见的是用两个频率承载二进制 1 和 0 的双频 FSK 系统 相移键控 PSK：调制后载波与未调载波同相和反相（相位差 180°）承载二进制。 单频连续波 CW 调频连续波 FMCW 毫米波雷达不同工作方式 FMCW 调频连续波雷达的不同调制形式不同调频方式的雷达硬件构成基本相同，只有小部分电路模块、电路参数与信号处理算法有所区别。对于单个静止物体的测量，锯齿波调制方式即可满足；对于运动物体，多采用三角波调制方式； 正弦波调制使用较少。 频段汽车领域的雷达应用在自动驾驶领域的毫米波雷达主要有两个频段 24GHz 频段24.0GHz 到 24.25GHz，窄带带宽 250 MHz，波长大于 1cm，严格来讲属于厘米波雷达。频带还包括一个带宽为 5GHz 的超宽带（UWB）2022 年 1 月 1 日以后，UWB 频段将无法在欧洲和美国使用，只有窄带频段可以长期使用。 24GHz 毫米波雷达应用频段示意图 77GHz 频段其中 76-77GHz 频段可用于远程车载雷达，并且该频段有等效同性各向辐射功率的优势，同时满足高传输功率和宽工作带宽，可以同时做到长距离探测和高距离分辨率。波长更短所以收发天线面积大幅减小，雷达体积更小。77-81GHz 短程雷达（SRR）频段是新加入的频段，可提供高达 4 GHz 的宽扫描带宽，非常适合需要高范围分辨率的应用。 77GHz 毫米波雷达应用频段示意图 硬件结构汽车使用的雷达不像军事雷达体积那么庞大，是小型传感器，可以很容易地安装在前格栅或保险杠下面。 毫米波雷达基本结构组成示意图 高频信号由压控振荡器产生，通过功率分配器将一部分经过额外放大后馈送至发射天线，另一部分耦合至混频器，与接收的回波混频后低通滤波，得到基带差频信号，经过模数转换后送至信号处理器处理。 结构框图 单片微波集成电路（MMIC）它包括多种功能电路，如低噪声放大器（LNA）、功率放大器、混频器、检波器、调制器、压控振荡器(VCO)、移相器、包括收发系统中的发送 (TX) 和接收 (RX) 射频 (RF) 组件，以及时钟等模拟组件，还有模数转换器 (ADC)、微控制器 (MCU) 和数字信号处理器 (DSP) 等数字组件。 混频器：在 FMCW 雷达中，混频器混频器将回波信号与频率合成器产生的扫频信号相减，获得频移或中频信号（IF）。 AWR1843 核心解决方案框图 雷达天线高频 PCB 板毫米波雷达天线的主流方案是微带阵列，即将高频 PCB 板集成在普通的 PCB 基板上实现天线的功能，需要在较小的集成空间中保持天线足够的信号强度。 天线：天线通过将能量聚焦在所需方向来增加信号的强度，天线的波束宽度决定了雷达传感器的视场，比如横向绝对覆盖车道数。天线辐射不仅包括主波束，还包括副瓣。天线的旁瓣指向不同的方向，可以感知不在主波束内的目标，也可能产生误报。为了避免旁瓣检测，必须将旁瓣电平从主波束的峰值压制到 30dB 以上。 天线方向图是天线发射的相对场强的几何方向图 参数指标雷达的性能指标取决于发射信号的选择，主要有以下参数指标。 距离距离精度：用于描述雷达对单个目标距离参数估计的准确度，它是由回波信号的信噪比 SNR 决定的。 FMCW 雷达的有效噪声带宽与其调频时间成反比，调频时间越长，有效噪声带宽越低，分辨率越高。 最大探测距离：能够探测到障碍物的最大相对距离，一般为 250m。最大可测速度与相邻 chirp 信号之间的空间间隔成反比。 距离分辨率：即多个目标被雷达区分出来的最小距离，主要由信号的带宽决定的，chirp 信号带宽的增加，距离分辨率随之提高。 速度最大探测速度：能够探测到障碍物的最大相对速度，一般为 240km/h。 速度分辨率：速度分辨率随着帧持续时间的增加而提高。 角度探测视角：能够探测到的视野范围，水平范围一般为±60°，垂直视角一般为±15°。 角精度：用于描述雷达对单个目标方位角估计的准确度。 最大探测目标数：最大能够探测的目标数量，一般为 24-32 个。 角分辨率：取决于雷达的工作波长和天线口径尺寸和 TX/RX 天线的数量。 数据与激光雷达相似，毫米波雷达返回的数据是由点云组成的，每个点包含 2D/3D 位置，反射率，和径向相对速度，具体型号之间会有一定的差异，主要是设备是否支持 3D，速度测量等因素导致。 大家可以使用 Oxford 组发布的雷达数据集 Oxford Radar Dataset 进行数据集上的开发。 该雷达数据集在城市环境中采集了多段数据，使用的雷达是 Navtech 开发的一款 76Ghz~77Ghz 毫米波雷达，这款雷达通过窄波束进行机械扫描，类似机械式的 LiDAR，相对分辨率较低，波束宽度 1.8°。机械扫描每次间隔 0.9°，即每旋转一圈获得 400 个角度向测量。机械旋转速度约 4Hz, 距离分辨率 4.32cm, 最大测距 163m。 Oxford Radar RobotCar Dataset 特点和 LiDAR 相比Radar 和 Lidar 的之争是话题热点，但实际上，这些传感器是互补的。昂贵的激光雷达能够利用目标对激光的反射产生高分辨率成像，能够提供精确的形状和位置信息，但是在恶劣的天气条件下无法工作。 雷达不具备产生高分辨率图像的能力，但是它具有基于多普勒现象的高精度速度估计。此外，雷达波长允许它在恶劣的天气条件下感知目标，最重要的是制造成本低。 优势 体积小，安装之后对汽车外观的影响不大； 纵向目标探测距离与速度探测能力强； 对于静态和动态目标均能作出高精度测量； 全天候、全天时工作，不论昼夜，穿透能力强，不受天气状况限制。 劣势 无法成像，无法进行图像颜色识别； 行人反射波较弱，对行人分辨率不高； 探测距离近，垂直角度受限，对高处物体以及小物体检测效果不佳； 距离多普勒耦合以及收发隔离难； 在有体积要求的毫米波雷达上，垂直与水平方向天线紧密排布会相互产生严重的信号干扰； 信号处理算法的可靠性、实时性需要保证，传统的毫米波雷达 ECU 可能无法胜任大规模点云的处理。 数据存储需求将会加大，需要额外添置存储单元。 应用连续波调频（FMCW）雷达已广泛应用于汽车领域，包括从安全到舒适性能的各个方面，例如盲点检测、换道辅助、自动巡航控制和停车辅助等。无论天气和周围的光照条件如何，雷达都能够可靠、准确地探测和定位障碍物。 高级驾驶辅助系统(ADAS)目前，制造商主要基于视觉传感器技术和毫米波雷达系统来实现驾驶辅助。远距离雷达（LRR）支持多种功能，能轻松处理 30 到 200 米的距离，近距离雷达（SRR）能检测低于 30 米的距离。 邻近感测利用雷达的高距离分辨率及其近距离探测障碍物的能力，可用于开车门或后备箱时的防撞功能，也可用于泊车辅助。 驾驶员生命体征监测FMCW 雷达接收信号的相位对目标位置的微小变化极为敏感，可用于提高道路安全性，可估计出目标的振动频率（比如由呼吸和心跳引起的振动）监测驾驶员的心率和呼吸频率来持续监测驾驶员的生命体征。这种小尺寸传感器简单易用，比如它可以嵌入到驾驶员座椅的靠背中。 手势识别可用于基于手势的非接触式界面，包括基于手势打开车门/后备箱和控制信息娱乐系统。 市场毫米波雷达的核心芯片来自国外厂商，几乎垄断。从毫米波雷达芯片国内外企业的市场占有率来看，目前国际市场主要被恩智浦、英飞凌、德州仪器等芯片设计公司占据。国内的毫米波雷达芯片业目前还未形成规模。 在全球毫米波雷达市场上，占主导地位的是德国、美国、日本等国家，被博世、大陆、法雷奥、德尔福、电装、奥托立夫等厂商垄断；国内毫米波雷达依赖进口，全球范围内 77GHz 毫米波雷达芯片并没有稳定的供应体系，由于相关知识产权与合作协议的原因，英飞凌、飞思卡尔、意法半导体等芯片商对中国并没有放开 77GHz 雷达芯片的供应，因此国内 77GHz 毫米波雷达的开发受到一些限制，24GHz 毫米波雷达是主流方向。 据麦姆斯咨询研究表明，2016 年中国汽车预装毫米波雷达的数量达到 105 万个，其中 24GHz 雷达占比 63.8%，77GHz 雷达占比 36.2%。博世和大陆全球毫米波雷达市场占有率均为 17%，并列第一；电装、海拉并列第二，市场份额为 11%，前七大供应商巨头市场占有率达到 73%。 注意！！！ 以上是对一个传感器的基本认识，如果您只是想使用雷达数据，而不关心毫米波雷达的原理，阅读可到此为止。 为了理解传感器的性能指标，我们需要信号处理基本知识理解学起，了解每个公式的含义，这便是本篇文章后半部分的主要核心。 信号处理基础知识单波参数波长 Lambda：从一个波的一点到下一个波的同一点的物理长度。 频率 Frequency：每秒经过的波的数量，以赫兹为单位。频率越高，波长越短。 带宽 Bandwidth：信号连续频带中最高和最低频率分量之间的差值。 振幅 Amplitute：信号的强度，与配置雷达输出功率和感知接收信号相关。雷达信号的幅度越大，雷达的可见度越高。 雷达散射截面 Radar Cross Section：一个目标单位截面积反射雷达能量的能力，取决于目标的物理几何形状和外部特征。 调频信号 chirp雷达主要有两种体制，脉冲雷达和连续波雷达，更具体的分类已在前文中提及。 调频连续波：信号的频率随着时间增加的正弦波信号 第一个是时域信号，第二个是频域信号，可以看出调频信号的频率和信号的持续时间 $T_c$ 是呈线性关系，因此这样的调频连续波又称为线性调频连续波（LFMCW）。 FMCW 有几个主要的参数需要注意，分别是带宽 B，斜率 S，信号持续时间 $T_c$ 。途中的信号斜率 S=B/Tc=100 MHz/us。 中频信号（IF signal）无线通信领域根据频率讲信号分为三种，第一是射频 Radio Frequency，中频 Intermediate Frequency，以及基带 Baseband。 射频负责接收及发射高频信号，基频则负责信号处理及储存等功能，中频则是射频与基频的中介桥梁，使信号能顺利由高频信号转成基频的信号。中频只是表示信号频段的程度词。 通过混频之后出来的中频信号其实不止一个，通过乘法器之后有几个频段的信号，我们还需要经过低通滤波器筛选出我们需要的信号。 IF 信号的模型图 雷达发射信号与回波信号之间的频率差就是中频信号，这里的中频信号是一条直线，表示频率单一。目标的距离不一样，返回的时间也就不一样，因此中频信号也就不一样，可以说距离和中频信号是成映射关系的。 雷达测距的最基本公式是： $$R=c * \\tau /2$$ c 是光速， $\\tau$ 是电磁波往返的时间。 因此中频信号为： $$f_{c} = S\\cdot \\tau= S \\cdot 2R/c$$ 调频斜率 $S=B/T_c$ $\\tau$ 通常来讲特别小，如探测距离 300m 时调频周期 $T_c=40us$ ， $\\tau/T_c=5%$ 中频信号采样中频信号还是模拟信号，要送入处理器处理必须经过 ADC 采样成数字信号。 中频带宽被 ADC 的采样频率限制，因为信号持续时间不可能无限小： $$f_{c}\\geq \\frac{2BR}{c\\cdot T_c}$$ 可得雷达的最大探测距离为： $$R_{max} = \\frac{f_{c} \\cdot c}{2S} = \\frac{f_{c} \\cdot c\\cdot T_c}{2B}$$ 即在 ADC 采样率不变的情况下，雷达的探测距离随着信号的斜率成反比关系，如果发射周期固定不变，那么雷达探测距离和信号的带宽成反比关系。 如果两个波具有相同的距离分辨率，对于相同的最远探测距离，斜率大的波所需要的 ADC 采样率更高，但是换来的好处是波周期短。因此在选择和设计的时候，需要平衡选择。 中频信号的相位信息对单一信号进行傅里叶变换时，也能体现出时域信号的频率信息和相位信息。 相同频率不同相位的信号进行傅里叶变换 混频器输出的中频信号的初始相位则是两个输入的初始相位之差。 A-D 点（C-F 点）之间的相位差是： $$\\Delta \\phi =2\\pi f_c \\tau=4\\pi R/ \\lambda$$ 中频信号的实际函数表达式为： $$Asin(2\\pi f_c t+\\Delta\\phi)$$ $$f_c=\\frac{2SR}{c} = \\frac{2BR}{c\\cdot T_c}$$ $$\\Delta \\phi =4\\pi R/ \\lambda$$ 傅里叶变换关于傅里叶变换，强烈推荐 Heinrich 的专栏文章，傅里叶变换的目的就是把时域信号映射到频域上进行分析： Heinrich：傅里叶分析之掐死教程（完整版） 掐死傅里叶变换教程图 FMCW 雷达原理单频的连续波谱(Continuous Wave)，可以通过多普勒效应产生的频率偏移来估算相对速度，但我们只发出相同的正弦或余弦信号，接收到的波也是呈周期性变化的，所以我们无从知道从发出到接受到底经过了多少个波长，从而无法确定信号从发出到接受所经历的时间(Time of Flight)，也就无法测算距离。 信号的频率随时间变化呈线性升高的线性调频脉冲 于是，我们引入了调频/调幅(FMCW/AMCW)，使发出信号的频率或者幅度处于不断的变化中，使得既可测距又可测速。在汽车领域，我们一般使用调频技术。 脉冲 FMCW 和正弦 FMCW 时间域变化图 FMCW 雷达在扫频周期内发射频率变化的连续波，被物体反射后的回波与发射信号有一定的频率差，经过混频之后得到几个频率不同的中频信号。不同的中频即代表不同的距离，通过测量频率差可以获得目标与雷达之间的距离信息。 傅里叶变换（FFT）之后的中频频谱 调频连续波雷达最常用的两种波形方式是锯齿波和三角波，锯齿波形一般只使用上行坡道，而三角形波形使用上行坡道和下行坡道。 锯齿波 多普勒效应 多普勒效应是波源和观察者有相对运动时，观察者接受到波的频率与波源发出的频率并不相同的现象。波源与目标接近使得接受和反射的频率变高，而波源远离目标使得接受和反射的频率变低。 由于目标在运动产生的多普勒效应，拍频（接收频率和斜坡频率之间的差，beat frequency）由两个频率分量组成： $f_R$ （距离引起的频率增量）和 $f_D$ （速度引起的频率偏移，与目标的速度成正比）： $$ f_{D}=\\frac{2 \\nu_{r}}{\\lambda}$$ 值得注意的是在汽车雷达的情况下，运动目标在每次啁啾持续时间内的微小位移会引起的相位变化， $f_D$ 相比 $f_R$ 是非常小的，由于每次啁啾的持续时间一般是微秒，导致毫米级的微小位移，主要是通过测量多个啁啾之间的相位变化率来计算。通过测量多普勒引起的频率偏移，雷达可以确定目标的速度。 距离估算（Range Estimation）我们通过测量频移来确定雷达信号的飞行时间，进而确定目标的飞行距离 下面以三角波调频连续波为例来简单介绍雷达的测距和测速原理。 如下图，蓝色实线是发出的信号频率，红色虚线是接受到的信号频率， $t_c$ 为扫频周期 $T_c$ 的一半， $\\tau$ 为扫频带宽， $\\tau$ 为从信号发射到接受所经历的时间。发射信号经过目标发射，回波信号会有延时，在三角形的频率变化中，可以在上升沿和下降沿两者上进行距离测量。 相对静止物体，没有多普勒效应，发射频率和接收频率是相同的，上升沿期间的频率差值等于下降沿期间的测量值。但是，雷达的斜坡频率是随时间不断变化的，所以当我们得到拍频 $f_b$ ，就得到了信号传输时间。 对于运动目标，则上升/下降沿期间的频率差不同，我们可以通过这二个频率差，中和多普勒效应，来计算距离和速度。 已知的调频斜率： $S$ 需要测量的频差： $f_{b1} , f_{b2}$ $$R=\\frac{c\\cdot\\tau}{2}=\\frac{c f_c }{2S}=\\frac{c |f_{b1}+f_{b2}|}{4 S}$$ $$v=\\frac{\\lambda}{2}f_D = \\frac{\\lambda}{4} |f_{b1} - f_{b2} |$$ 距离分辨率雷达需要具备区分两个距离非常近的目标的能力。比如，当雷达的距离分辨率为 4m 时，它就不能区分相距 1m 的行人和汽车。距离分辨率完全取决于啁啾的带宽。 假设两个相距很近的目标，被雷达探测到，两个回波信号混频之后得到了两个中频信号，这两个中频信号的时间 T 相差很小，因此中频信号的频率相差很小。 如果雷达没有能力分辨那么这两个目标就会被雷达当成是一个目标，两个目标的信息被融合了。 傅里叶变换理论指出，通过延长 IF 信号，可以提高分辨率。 要延长 IF 信号，还必须按比例增加带宽。延长的 IF 信号会产生一个有两个分离峰值的 IF 谱。 傅里叶变换理论还指出，观测窗口 (T) 可以分辨间隔超过 1/T Hz 的频率分量。这意味着只要频率差满足以下关系式，就可以分辨两个单音信号： $$f_c = \\frac{2SR}{c} \\geq \\frac{1}{T_c}$$ 首先我们之前得到中频信号的公式为： $$f_c = S\\cdot \\tau = 2SR/c$$ 根据线性调频连续波的基本原理，我们知道 频率差 $f_c$ 是绝对大于脉冲重复频率（PRF）的。因为时间越大频率越小，时间越小频率越大。 $$f_c = 2SR / c \\geq1/T_c = PRF$$ $$S\\cdot T_c=B$$ $$R\\geq\\frac{c}{2S \\cdot T_c}=\\frac{c}{2B}$$ 由于每个 Chirp 可以得到一个相对距离 R，距离分辨率仅取决于线性调频脉冲扫频，即发射信号的带宽： $$R_{res}=\\frac{c}{2B}$$ 多个目标的信号在同一斜率下，带宽越大，信号的持续时间越长，因此频谱分辨率越高。只要带宽（覆盖的频率范围）一样，无论信号持续的时间如何都不会影响雷达的距离分辨率。以下是几种典型的带宽和分辨率之间的关系： Bandwidth Range Resolution 4 GHz 3.75 cm 2 GHz 7.5 cm 1 GHz 15 cm 600 MHz 25 cm 多目标测距如果希望测得多个物体的距离和速度，就必须对发射信号的频率进行一定的处理。 再进行上述一系列操作可以得到交点坐标图: 如果按照原来的频率变换进行处理，则会得到四个交点（图中实线或者虚线各有四个交点），即得到四个距离和速度，从而无法对所探测物体进行判断。 而改变第二个周期的扫频带宽后，将会得到不同扫频带宽发出信号的两个共同交点，从而确定所测两个物体与自己的相对距离和速度。 实际中也可以改变扫频周期来获得不同的扫频信号 当接收自不同物体不同的 Rx 线性调频波时，每个线性调频波的延时都不一样，延时和与该物体的距离成正比。不同的 Rx 线性调频脉冲转化为多个中频信号，每个信号频率恒定。 实际使用中为了避免大量的计算，提高检测速度和精度，有兴趣的可以了解一下快速 Chirp 序列方法（Fast Chirp Sequence）。 最大探测距离设备输出功率 $P_t$ ，发射器/接收器 天线增益 $G_{Tx/Rx}$ ，目标的雷达横截面 $\\sigma$ ， 接收天线的有效孔径面积： $A_{Rx} = \\frac{G_{Rx} \\lambda^2}{4\\pi}$ 辐射功率密度： $\\frac{P_t G_{Tx}}{4\\pi d^2}$ 反射功率： $\\frac{P_t G_{Tx} \\sigma}{4\\pi d^2}$ 接收天线的功率密度： $\\frac{P_t G_{Tx} \\sigma}{(4\\pi)^2 d^4}$ 接收天线捕获的功率： $\\frac{P_t G_{Tx} \\sigma A_{Rx}}{ (4\\pi)^2 d^4}$ 物理角度上，雷达的最大探测距离由物理因素决定 $$R_{max} = (\\frac{\\sigma P_t G_{Tx} G_{Rx} \\lambda^2 T_{meas} } { (4\\pi)^3 SNR_{min} kTF }) ^{\\frac{1}{4}}$$ 而这个最大探测距离和信号处理角度出发的由调频斜率、ADC 采样率推算出来的最大探测距离： $$R_{max} = \\frac{f_{c} \\cdot c}{2S} = \\frac{f_{c} \\cdot c\\cdot T_c}{2B}$$ 两者本质上是不同的，物理角度是决定性的，功率大小决定电磁波辐射距离，调制方式决定了该方式的上限。 速度估算三角波调频连续波雷达正是通过采用正负调频斜率来消除距离与速度的耦合，进而进行目标速度的估计。 当相对速度 $v_r&gt;0$ ，R 不断增大， $f_b$ 也不断变大。由于多普勒效应，传递的电磁波被拉伸，频率有所减小； 当相对速度 $v_r&lt;0$ ，R 不断减小，故 $f_b$ 也不断减小。传递的电磁波被压缩，频率有所增大。 为了简化模型，且考虑到信号从发出到接收所经历的时间极短，加速度不变，汽车相对速度几乎不变，信号频率变化如下所示： 差频从原来的 $f_b =\\frac{ 2SR}{c}=\\frac{f_c}{t_c} \\cdot \\frac{2R}{c}$ 增加了 $v_r$ 影响项，转变为如下关系式： $$f_b = \\frac{f_c}{t_c} \\cdot\\frac{2R}{c} -f_D$$ $$\\Rightarrow f_b = \\frac{f_c}{t_c} \\cdot \\frac{2R}{c}-\\frac{2v_r f_s}{c}$$ $$\\Rightarrow v_r = +\\frac{f_c}{t_c f_s} \\cdot R - \\frac{c}{2f_s} \\cdot f_b$$ 从而得到了相对速度 $v_r$ 和相对距离 R 的关系式。而为了解得 $v_r$ 和 R 的具体数值，只有上面一个式子是不够的，于是我们在信号频率的下降沿进行重复的操作，从而得到如下二元方程组： $$ \\left{ \\begin{aligned} v_r =+\\frac{f_c}{t_c \\cdot f_S}\\cdot R - \\frac{c}{2 \\cdot f_S}\\cdot f_{b1} \\ v_r =-\\frac{f_c}{t_c \\cdot f_S}\\cdot R - \\frac{c}{2 \\cdot f_S}\\cdot f_{b2} \\end{aligned} \\right. $$ 联立可解得相对距离和相对速度： $$R =\\frac{c}{4} \\cdot \\frac{t_c}{f_c}(f_{b1}-f_{b2})$$ $$v_r =- \\frac{c}{4f_S}(f_{b1}+f_{b2}) =- \\frac{\\lambda}{4\\pi T_c}(f_{b1}+f_{b2})$$ 但是，往往为了获得目标的速度信息，雷达通常以帧为单位，均匀等时间间隔地发出一串 chirps 信号。然后利用信号相位差来测量出目标场中目标的速度。对与每个 chirp 对应的数字化采样点执行距离 FFT，输出结果以连续行的形式存储在矩阵中，此矩阵包含距离和速度两个自由度的信息。 处理器接收并处理一帧中所有单个 chirp 后，开始对 chirps 串序列进行多普勒 FFT。 距离 FFT(逐行)和多普勒 FFT(逐列)的联合操作可视作每帧对应数字化采样点的二维 FFT。二维 FFT 可同时分辨出目标的距离和速度，也就是说，二维 FFT 的峰值位置对应雷达前方目标的距离和速度。 多目标测速使用位于同一距离处的多个物体进行的速度测量，如果速度不同的多个移动物体在测量时与雷达的距离相同，则双线性调频脉冲速度测量方法不起作用。这些物体由于与雷达的距离相同，因而会生成中频信号频率完全相同的结构。因此，距离 FFT 会产生单个峰值，该峰值表示来自所有这些距离相同的物体的合并信号，简单的相位比较技术将不起作用。 为了测量多个目标的速度，雷达系统必须发射两个以上的线性调频脉冲。它发射一组 N 个等间隔线性调频信号。 线性调频脉冲帧随时间变化的频率 然后通过积累，比如说一帧发射 128 个 chirp 信号，每个信号 128 个点。距离维度的 FFT 只能够求出其距离值，而要求出速度就必然需要在速度维再做一次 FFT。 速度分辨率假设一系列信号都具有相同的频率，FFT 之后其频谱峰值处于同一位置。如果有两个不同频率的信号组成，FFT 之后的频谱便会又两个峰。速度分辨率取决于啁啾的个数，但较高的啁啾数量也需要更长的时间来处理信号。 两个离散频率 $ω_1$ 和 $ω_2$ ， $\\Delta \\omega =\\pi/N$ 。在第 N 个信号序列上，波 1 的相位比第 1 个信号的多走过半个周期，不足以在频域中解析两个对象。 在第 2N 个信号序列中，波 2 的相位经过了一个完整的周期，超过了波 1 的相位，因此两个对象可以在频域中被分解。可见更长的信号序列点，可以增加信号的频谱分辨率，这依赖于相位这一信息。 反过来，两个离散频率 $ω_1$ 和 $ω_2$ 频率差为 $\\Delta \\omega = |ω_2 – ω_1| &gt; 2\\pi/N$ 在长度为 N 的序列上进行 FFT 时，是可以分辨的： $$v_1= \\frac{\\lambda \\omega_1}{4\\pi T_c}, v_2= \\frac{\\lambda \\omega_2}{4\\pi T_c}$$ $$\\Delta \\omega = \\frac{4\\pi \\Delta v T_c}{\\lambda} &gt; \\frac{2\\pi}{N}$$ $$\\Rightarrow \\Delta v \\geq \\frac{\\lambda}{2N\\cdot T_c} = \\frac{\\lambda}{2 T_f}$$ 雷达速度分辨率与帧时间成反比： $$v_{res} = \\frac{\\lambda}{2T_f}$$ 最大不模糊速度最大不模糊速度通俗一点来说就是可测量的最大速度。 根据公式： $$\\Delta \\omega = \\frac{4\\pi \\Delta v T_c}{\\lambda}$$ 假设 $T_c$ 恒定不变，当目标运动速度增大时， $\\Delta \\omega$ 会随着增大，但是达到一定程度 $\\Delta \\omega$ 会超过 $\\pi$ ，此时雷达不知道 $\\Delta \\omega$ 是目标正向运动还是反向运动的角频率，因此陷入两难，由此要求 $|\\Delta \\omega | &lt; \\pi$ ： $$\\frac{4\\pi \\Delta v T_c}{\\lambda}&lt;\\pi \\Rightarrow \\Delta v&lt;\\frac{\\lambda}{4T_c}$$ 最大不模糊速度： $$v_{max} = \\frac{\\lambda}{4T_c}$$ 意为更高的可测量最大速度需要两个线性调频脉冲之间更短的传输时间。 角度估算FMCW 雷达系统可以使用水平面估算反射信号的角度，也称为到达角（Angle of Arrival）。 物体距离的很小变化即可导致距离 FFT 或多普勒 FFT 峰值的相位变化，该结果被用于执行角度估算，对目标角度信息的解析需要至少两个 RX 天线，单发单收天线无法进行角度估计。 $d$ 是天线到物体的距离。 相位变化在数学上可以推导出： $$\\Delta \\phi =\\frac{2\\pi \\Delta d}{\\lambda}$$ 在假设平面波前的前提下，基本几何显示 $\\Delta d =l \\cdot sin(\\theta)$ ，其中 $l$ 是天线之间的距离。因此，到达角 $\\theta$ 可根据使用下面的式子测得的 $\\Delta \\phi$ 计算出来： $$\\theta=sin^{-1} (\\frac{\\lambda \\Delta \\phi}{ 2\\pi l})$$ ##角度分辨率 角度分辨率(Angle Resolution)雷达能够在空间上分辨两个多近的角度。即使两个目标在相同的距离以相同的速度运动，它们仍然可以通过雷达坐标系中的角度分辨出来，它跟天线孔径，信号波长和接受天线的个数有关系。 $$\\Delta \\phi= \\frac{2\\pi d}{\\lambda}(sin(\\theta+\\Delta \\theta) - sin(\\theta))\\approx \\frac{2\\pi d}{\\lambda} cos(\\theta) \\Delta \\theta &gt;\\frac{2\\pi }{N}$$ $$\\Rightarrow \\frac{2\\pi d}{\\lambda} cos(\\theta)\\Delta \\theta &gt; \\frac{2\\pi}{N}$$ $$\\Rightarrow \\Delta \\theta &gt; \\frac{\\lambda}{N\\cdot d\\cdot cos(\\theta)}$$ 角度分辨率： $$\\theta_{res} = \\frac{\\lambda}{N\\cdot d\\cdot cos(\\theta)}$$ 最大角视场距离有最大探测距离，速度有最大不模糊速度，角度也有最大探测范围，成为最大角视场，由雷达可以估算的最大 AoA 来界定。 角度的准确测量离不开 $|\\Delta \\phi |&lt;\\pi$ ，则 $$\\theta=sin^{-1} (\\frac{\\lambda \\Delta \\phi}{ 2\\pi l})$$ $$\\Rightarrow \\frac{2\\pi l sin(\\theta)}{ \\lambda} &lt; \\pi$$ $$\\theta_{max}= sin^{-1}(\\frac{\\lambda}{2l})$$ 两个天线之间的间隔 $l= \\lambda /2$ 会导致 180° 的最大角视场，且正前方角分辨率为 $\\theta_{res}= \\frac{2}{N}$ MIMO 技术MIMO 雷达是提高毫米波雷达角分辨率的一项重要技术。 单输入多输出（SIMO）雷达是指拥有一个发射和多个接收天线的雷达装备。SIMO 雷达的角度分辨力取决于接收天线的数量。提高角度分辨力的最直接方法是增加接收天线的数量。这种方法有其局限性，因为每一个额外的接收天线在装备中都要有一个独立的 RX 处理链（各配有一个 LNA、混合器、IF 滤波器和 ADC）。 多输入多输出（MIMO）雷达是指有多个 TX 和多个 RX 天线的雷达，用户就可以生成一个 nTX × nRX 的虚拟天线阵列。拥有 nTX 个 TX 天线和 nRX 个 RX 天线的 MIMO 雷达的角度分辨力等同于拥有 nTX×nRX 个 RX 天线的 SIMO 雷达。 应用 MIMO 雷达技术，可以倍增虚拟天线的数量，相应地也提高了角度分辨力。MIMO 雷达的原理，可以扩展到多维阵列。 Reference 王方浩：1.6 万字长文带你入门无人驾驶硬件 William： 万字长文详解：毫米波雷达物体检测技术【硬件&amp;软件】 Heinrich：傅里叶分析之掐死教程（完整版）更新于 2014.06.06 望天涯：自动驾驶系统入门（三） - 毫米波雷达 IEEE1364：毫米波雷达自学笔记 红酤公子：干货-MIMO 雷达基本原理 红酤公子：干货-线性调频连续波雷达基本原理（第 1 讲） 红酤公子：干货-线性调频连续波雷达基本原理（第 2 讲） 红酤公子：干货-线性调频连续波雷达基本原理（第 3 讲） 详解毫米波雷达原理及其产业链 MIMO 雷达基础，提高角度分辨力 叶融茶归：4D 雷达之 MIMO 通道分离 Illinois 大学课件：FMCW Radar? Never Heard of it TI 官网：毫米波传感器基础知识 TI 单芯片毫米波雷达 IWR1642 硬件架构研究 TI 官网： AWR1843 单芯片 77GHz 和 79GHz FMCW 雷达传感器 TI 官网：xWR1843 Evaluation Module (xWR1843BOOST) Single-Chip mmWave Sensing Solution Oxford Radar RobotCar Dataset 欢迎在我的专栏「自律走行」中查看更多「走进自动驾驶传感器」系列文章 走进自动驾驶传感器（一）——激光雷达 走进自动驾驶传感器（二）——毫米波雷达 走进自动驾驶传感器（三）——卫星导航系统","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"radar","slug":"radar","permalink":"http://www.yvonshong.com/tags/radar/"}]},{"title":"计算摄影——“看得见”的未来","date":"2020-10-18T17:52:00.000Z","path":"2020/10/18/computational-photography-0/","text":"之前的专栏「自律走行」键盘摄影系列文章中，介绍了作为一名新手，使用相机拍一张照片时需要了解的一些摄影基础知识，当然还要更多关于构图，相机预设的模式等等实际操作时遇到的问题，和拍摄时的经验等等完全没有提及，所以我称之为「键盘摄影」（笑 但作为一名搞自动驾驶的算法工程师，怎能止步于在使用相机传感器时知道摄影的基本概念就可以了呢！我当然会疑惑相机是如何对焦的？它又是如何自动曝光的？它的自动白平衡又是怎么做的？当这些关于相机算法的一系列问题从我的脑海中冒出时，我发现，我已经站在了计算摄影的大门口。 戳&gt;&gt;「键盘摄影」系列文章，后续想到了什么会再更新！ 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用 苹果 iPhone 11 发布会上，苹果高级副总裁 Phil Schiller 将新 iPhone 的相机称呼为 「It is computational photography mad-science. 」 这是一场计算摄影的疯狂科学实践。 而在撰写以上系列文章，尤其是 键盘摄影（七）——深入理解图像信号处理器 ISP 时，我更切身地意识到：「计算摄影」正在改变传统摄影器材，奠基新的摄影技术，进而影响摄影艺术——它是我们看得见的未来。（当然计算摄影首推 Google ！Pixel 才是这个行业的老大哥！） 所以在接下来的文章中主要会去探讨计算摄影的相关话题，不仅仅是相机内部的算法，也会探(现)讨(学)如何利用算法来处理图像，比如相机的去噪，模糊图像的恢复等等（开始挖坑）。主要关注点会是如何利用算法去解决摄影中切实的问题，而不只是传统的图像处理，以及我对计算摄影框架性的理解，不会追最新 paper，会努力在看一类问题时查一查前沿技术是怎么解决这类问题的，可能会有一些公式推导和代码。 而关于计算机视觉中的多视图几何，三维重建， SLAM，我的专业方面的东西，会在我重啃 MVG 时另开新坑来写（滑稽），只希望大家轻喷。 目前关于计算摄影的中文资料也比较少，这里也先贴一些与之有关的链接： Wang Hawk：计算摄影学 专栏 浙大章国锋老师的课程： 计算摄影学 佐治亚理工学院的优达学城课程： 计算摄影技术 韩国科学技术研究院的书：Computational Photography: Principles and PracticeTiancheng Zhi, CMU：Computational Photography Gordon Wetzstein, Stanford：Computational Imaging and Display Derek Hoiem, UIUC：Computational Photography James Hays, Brown：Computational Photography) Fredo Durand, MIT：Digital and Computational Photography Oliver Cossairt, Northwestern：Introduction to Computational Photography Kyros Kutulakos, University of Toronto：Introduction to Visual Computing Kayvon Fatahalian, CMU：Visual Computing Systems Ramesh Raskar and Jack Tumblin, SIGGRAPH course：Computational Photography 期待您的点赞和关注！","tags":[{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"}]},{"title":"键盘摄影（九）——光学像差","date":"2020-10-09T15:21:00.000Z","path":"2020/10/09/keyboard-photography-9/","text":"我们在 键盘摄影（七）——深入理解图像信号处理器 ISP 中提到 Chroma Shading， 色差，其实镜头带来的像差（Aberration）不只是色差，1857 年，菲利普·路德维希·冯·赛德尔 描述了五种类型的镜头像差：球差，彗差，像散，场曲和畸变。这五个像差描述的是单色光穿过镜头时发生的与理想情况下的差异，而当存在多色光时，不同颜色的光会出现不同的轴向/横向的色差。镜头本身的设计就会导致像差，就更不用说加工时精度，镜片结构和材质导致的成像质量的误差了。 我们接下来主要关心像差产生的原理和如何在光学系统设计时进行矫正。 球差 Spherical Aberration由主轴上某一物点向光学系统发出的单色圆锥形光束，经光学系统折射后，如果不能交于主轴上的同一位置（比如穿过球面透镜边缘传播的光线会比穿过球面透镜中心传播的光线聚焦得更强烈），在主轴上的理想像平面处，形成一弥散光斑，则此光学系统的成像误差称为球差。 由于单负透镜产生正球差，而单正透镜，边缘光线的偏向角比近轴光线的偏向角小，产生负球差。因此单透镜本身很难校正球差，对称使用正负透镜组合则可以校正球差。 慧差 Coma由位于主轴外的某一轴外物点的光，经该光学系统折射后，他们不再相交于一点，在垂轴方向也不与主光线相交，即相对主光线失去对称性。它在理想像平面处不能结成清晰点，而是结成拖着明亮尾巴的慧星形不对称弥散斑，则此光学系统的成像误差称为慧差。 彗差本质上还是因为透镜不同位置折射能力差异所导致，所以它是光学孔径和视场的函数（与透镜的形状有关系）。在小视场的情况下，满足阿贝正弦条件时是不存在彗差的；使用对称结构的正负透镜时，也可以校正彗差。 像散 Astigmatism由位于主轴外的某一轴外物点的光，经该光学系统折射后，水平和垂直方向的光线具有不同的焦点，不能结成一个清晰像点，而只能形成一个弥散光斑，则此光学系统的成像误差称为像散。此时的焦距差，称为像散距离，被用作对镜头中存在的像散量的度量。 像散是轴外像差（理论上对于旋转对称镜片只有轴外物点光线会存在像散），所以它是视场角、透镜形状、孔径位置的函数，与孔径大小无关，可以使用对称结构来校正轴外像差。 场曲 Field Curvature光学系统正前方的平面物体经光学系统所结成的清晰影像，若不在正后方的像平面上，而在一以主轴为对称的弯曲表面上，即最佳像面为一曲面，则此光学系统的成像误差称为场曲。当调焦至画面中央处的影像清晰时，画面四周的影像模糊；而当调焦至画面四周处的影像清晰时，画面中央处的影像又开始模糊。 场曲与孔径大小无关，所以缩小光圈无法去除，同样可以使用对称结构来有效地减小场曲，比如在单透镜前面加一个单透镜，设计为对称式透镜组。 畸变 Distortion平面物体主轴外的直线，经光学系统成像后变为曲线，则此光学系统的成像误差称为畸变。畸变像差只影响影像的几何形状，而不影响图像边缘和中心的影像清晰度，这与球差、慧差、像散、场曲有着根本区别。 桶形畸变：图像放大倍率随距光轴的距离而减小，从而导致图像看起来呈桶形。 枕形畸变：图像放大率会随着距光轴的距离而增加，从而导致在镜头外围成像的点向中心弯曲。 畸变通常是通过改变光阑位置、采用对称系统等方式来校正，也可以在输出图像的那一层使用标定参数进行校正。 色差 Chromatic Aberration由白色物体向光学系统发出一束白光，经光学系统折射后，各色光不能会聚于一点上，而形成一彩色像斑，称为色差。色差产生的原因是同一光学玻璃对不同波长的光线的折射率不同，短波光折射率大，长波光折射率小。 轴向色差 Axial Chromatic Aberration不同波长的光线在通过透镜后沿轴聚焦在不同的焦点上，这就是轴向色差（也称为纵向色差）。对于正常色散材料而言，波长越长折射率越小，像点越远离透镜，对于反常色散材料则相反。 轴向色差是孔径的函数，与视场无关，通常使用双胶合消色差透镜，或三胶合复消色差透镜（折射率不同的透镜胶合而成）。根据材料色散特性不同，材料分为冕牌玻璃（色散能力较弱的材料）和火石玻璃（色散能力比较强的材料），在光学设计中可以使用这两种玻璃材料的组合对色差进行补偿。 倍率色差 Lateral Chromatic Aberration由于透镜的放大倍数也随光的波长而变化，因此不同的波长也可能会聚焦在像平面的不同点上。该横向色差导致在图像的高对比度区域中出现色带。倍率色差指的是轴外物点成像放大率随波长（折射率）的变化而变化，所以也称为横向色差。 倍率色差是折射率与视场的函数，可以通过移动孔径位置或者透镜间距的方式校正。通常使用折射率不同的透镜组成对称结构，将两个波长的光聚焦到同一平面上。 波差以上讨论是基于几何光学的几何像差，若基于波动光学理论，在近轴区内一个物体点发出的球面波经过光学系统后仍是球面波，由于衍射现象的存在，一个物体的理想像是一个复杂的艾里斑。由于像差的存在，经过光学系统形成的波面已不是球面，这种实际波面和理想球面的偏差，实际波面和理想波面在出瞳处相切时，两波面间的光程差就是波像差，简称波差。 Reference本文参考以下文章和书籍，侵删。 《工程光学》 - 郁道银 工业镜头常见的 6 种像差 像差如何影响成像 Maxxxxx：买眼镜和镜头之前，你知道什么是像差吗？ Tyalmath：工程光学（八）——像差理论 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（八）——相机结构和卡口","date":"2020-10-08T01:02:00.000Z","path":"2020/10/08/keyboard-photography-8/","text":"在前面的文章中，我们讲述了相机的基本成像元件，但相机随着历史进程和技术的发展，有着不同的结构类型，在此我们逐个来了解相机有哪些不同的类型，内部结构的细节，以及和与镜头连接的卡口又有怎样的讲究。如有问题敬请不吝指正。 旁轴 Rangefinder Camera旁轴取景式相机，由于取景光轴位于镜头成像光轴旁边，与之平行，因而取名“旁轴”相机。不同于单单反拍摄的“所见即所得”，旁轴相机的实际拍摄的画面和观察的画面，会有偏差。 旁轴没有反光镜，这样相机较薄，机震较轻。 旁轴相机由于对焦基线的原因和没有反光镜的限制，一般广角镜头可以做得非常贴近底片，结构和成像也比单反的要好。所以广角和标准焦距是它的强项，旁轴最长焦极限是 135mm。 徕卡的联动测距系统则是其 M 系列旁轴相机的精髓所在。这实际上是一种通过模拟人眼（两条光线汇聚在一起后合焦）的测距技术。 入射光被一排栅栏以一定角度反射到框线窗（刻有框线的平板玻璃）上，玻璃中间矩形的小孔用来投影成叠影对焦的光斑。与此同时，从右侧的棱镜组也将折射一束光线并通过一个小孔投影在这块平板玻璃上，只有当对焦正确的的时候，两束光线才能以同样的角度投影在矩形的小孔上，在取景器中，你就会看见两个光斑完全叠加重合在一起。这就是徕卡一直沿用至今的黄斑对焦。 双反 TLR, Twin-Lens Reflex Camera双镜头反光式取景照相机，一个镜头用来取景，一个镜头用来成像，主要是胶片时代的产物，现在已经不多见。由于取景时只经过了一次平面镜的反射，所以双反看到的画面是左右相反的。使用这种相机取景的时候需要低头看这块磨砂玻璃，这种取景方式被称为「腰平取景」。 单反 SLR, Single Lens Reflex Camera单镜头反光式取景照相机，对自动对焦单反相机来说，透过镜头的光线到达反光板后。一小部分光线透过反光板，经过副反光板后进入自动对焦模块；一大部分光线被反光板反射进入取景器。拍照时，反光板升起，全部光线到达感光元件。 单电 Single Lens Electronic View Finder Camera上述的单反相机的反光镜在拍摄照片时会完成一次起落，而这也限制了连拍速度的进一步提升。在今天，顶级的单反相机也只能在反光镜起落前提下实现约 14 张/秒的连拍速度。 在胶片时代，为了满足体育记者的拍摄需要，佳能、尼康推出过一些采用固定半透明反光镜单反。这类相机的反光镜不能起落，可以将透过镜头的光线分发到取景器和底片上。而后续推出的没有反光镜结构的无反、普通数码相机早已达到 30 张/秒甚至更高的连拍速度。 在 2008 年奥林巴斯和松下推出的单电定义之后，身为“搅局者”的索尼，且后续只有索尼一家使用固定式半透镜技术，单电（单镜头电子式取景照相机）被重新定义为：具备全手动操作，采用固定式半透镜技术（Translucent Mirror Technology）、电子取景器（EVF）的相机。这一称谓也就逐渐成了索尼的专属。 固定式半透镜技术，即光线经过半透镜（处于原来反光镜的位置，实际上是一层薄膜）后，一部分光线穿过半透镜投射至图像传感器上，用于取景和成像；另一部分则反射约 1/3EV（大约 26%）的光线至机顶的对焦模组，给测光和对焦系统使用（ ISO 值已通过机内补偿，同 ISO 下的噪点变多），我们在电子显示屏或电子取景器看到的景物，实际各占一半来自光路中传递的信号。 与单反相机不同的是，单电相机的取景器，是电子取景器（EVF），说白了，就是取景器里面是一块小显示屏，跟相机背后的那块大 LCD 显示屏一样。它可以把用户通过改变光圈、快门、ISO 等参数而造成的效果显示在用户的眼前，达到“所见即所得”。 目前主流相机的屏幕分辨率，现在规格比较高的相机背屏是 900600 分辨率，而 EVF 取景器的分辨率已经能达到 1280960 甚至 1600*1200 分辨率了。同时，相机背屏的尺寸也就 3 寸左右，而使用 EVF 取景器取景时，你的视觉尺寸将会非常的大，在视觉体验上也更好。并且在大太阳底下拍摄时，由于相机背屏的亮度不足，取景就会变得麻烦，而使用 EVF 取景的话，无论外面光线再亮，也不会影响取景。 无反 Mirrorless Cameras无反光板式取景照相机，彻底取消了反光板，用户只能通过相机背后的 LCD 取景或者是接出的电子取景器取景，虽然电子取景器分辨率更高更费电，但是反光板的移除使相机变得更加轻便小巧。 “微单”已经被索尼注册成了商标，这类相机十分便携轻巧，拥有较短法兰距，可以中间再接一个转接环，具有转接法兰距较长的其他厂商的镜头的优势。别的厂商生产的无反光板式相机，便不可再称作“微单”了。因此，为了与单反相机对应，现将电子取景相机称为无反相机。 法兰距 flange distance法兰距是指镜头无限远对焦时，镜头卡口平面到镜头理想像平面（即透镜焦点）之间的距离。对机身而言，法兰焦距是指卡口到焦平面（即成像元件平面）之间的距离。当然同一卡口的话，机身法兰焦距与镜头法兰焦距是相等的，即一种卡口只有一个法兰距。 并且由于每家厂商在相机的设计之初采用不同的技术，导致不同品牌对于像面定位距，电子触点数量，甚至电子触点的位置也是不相同的，而法兰距离越短卡口就要越大，尽管越大的卡口对镜头的设计越有利，但对机身的设计难度也会相应提升。每一个卡口只对应一个法兰焦距，每个品牌的镜头都又只对应自家的卡口。之后随着镜头群的不断扩充，想要改变卡口系统就会让原有规格的镜头无法使用，对众多厂商来说这样的决策可都不是能轻易做到的。 无反相机则是没有反光板结构的，所以无反相机的法兰距相对较短。因为无反相机法兰距短，所以可以使用转接环来增长法兰距，从而兼容不同的镜头。 佳能工程师解释了为什么他们偏爱相机更短的法兰距和更大的直径： 镜头可以制造得小巧且高质量，因为仅需要较少的玻璃校正； 由于光线折射，较大的镜片可以更靠近镜头的后部，即卡口和传感器所在的位置，此时像差会更容易得到校正； 并且当大光圈镜头安装在相机上时，可以提供更好的平衡，带来舒适的握持感。 相机镜头卡口简单的说，相机镜头的卡口就是在可更换镜头的相机上的特定尺寸开口，可以把根据这个卡口尺寸生产的镜头安装到相机上。老式相机上，镜头是机械的安装在卡口上的，镜头和机身之间并没有电子触点，不能交互。后来随着自动测光和自动对焦系统的出现，需要镜头和机身之间可以交互信息，这才有了电子触点，镜头和机身可以通过电子触点交互信息，机身上的这个卡口也就变成了镜头和机身交互的媒介。 外径：outer diameter，红色部分，卡口的外部直径 内径：inner diameter，绿色部分，卡口弄内部直径（含插刀） 电子触点：electronic contacts，黄色部分，卡口上的金属触点 插刀：mount tabs，蓝色部分，用来固定相机的镜头 佳能 EF 卡口：内径 54mm，外径 65mm。有八个信号传输点。适用于佳能 EOS 系列单镜头反光数码相机，包括全画幅和 APS-C。 EF-S 卡口：和 EF 卡口几乎一样。不过 EF-S 卡口只适用于佳能 EOS 系列的 APS-C 相机。EF-S 镜头强行安装到 EF 卡口的全画幅相机上，不仅成像会有较大的暗角，最重要的是 EF-S 相比 EF 卡口的镜头而言多出一截。拍照时，相机的反光板会打到镜头，可能会造成相机损坏的严重后果。所以 EF-S 卡口镜头不能和 EF 卡口相机混用，反之可以。 EF-M 卡口：是佳能无反相机所用卡口，此卡口镜头只能用于无反相机上。 RF 卡口：RF 卡口是佳能的全新系列，拥有更大的卡口以及更短的法兰距。 索尼 A 卡口：索尼的 A 卡口就有点历史了，A 卡口本身是柯尼卡美能达的 MD 卡口，索尼收购了柯尼卡以后的，还继续使用 A 卡口。 E 卡口：也就是索尼 α 系列微单和 NEX 系列微单的卡口，对应 APS-C 画幅的索尼微单。 FE 卡口：E 卡口的全画幅版本。 尼康 AF 卡口，1986 年推出，大小参数和 F 卡口一摸一样，AF 卡口中的“A”意为“Auto”自动的意思，是相机电子化以来尼康为了适应新时代又不抛弃旧镜头群的做法。 Z 卡口：尼康全新的 Z 卡口规格为 55mm 内径，16mm 法兰距，一跃成为目前内径最大，法兰距最短的卡口。法兰距的缩短使尼康 Z7 相机的机身也能做的更加紧凑，而 55mm 内径不仅可以让相机获得更多的进光量，并且配合足够小的法兰距几乎能够转接目前所有的镜头。 Reference 索尼单电和单反、无反相机有何不同？ 相机有哪些种类，分别的特点是什么 从零开始的摄影指南：1.3.1 相机 无忌百科 | 一篇文章教你区分单反、双反、无反、微单、单电、旁轴 了解镜头卡口 这一篇就够了 关于镜头卡口你又知道多少？ 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（七）——深入理解图像信号处理器 ISP","date":"2020-06-10T19:13:00.000Z","path":"2020/06/10/keyboard-photography-7/","text":"写在前面，本文为笔者参考了很多篇博客，传感器手册，芯片手册，汇总了 ISP 可能涉及到的步骤流程，整理所得万字长文，并针对 ISP 芯片流程图总结画出了题图的 ISP 流程图，如有错误轻喷。 主要包含：内部结构/控制方式 / ISP 架构方案 / ISP 工作流程 / 图像接入 ISP 的方式 / 黑电平校正 / 镜头阴影校正 / 坏点校正 / 绿平衡 / 降噪 / 颜色插值 / 色温 / 自动白平衡 / 颜色校正 / 伽马校正 / 颜色空间变换 / 宽动态范围 / 锐化 / 自动曝光 / 自动对焦 / 串扰 / 去假彩 / 耀斑补偿 / 自动光圈 / 其他 ISP(Image Signal Process），在相机成像的整个环节中，它负责接收感光元件（Sensor）的原始信号数据，可以理解为整个相机拍照、录像的第一步处理流程，用于处理图像信号传感器输出的图像信号。它在相机系统中占有核心主导的地位，是构成相机的重要设备。 主要作用是对前端图像传感器输出的信号做后期处理，主要功能有线性纠正、噪声去除、坏点去除、内插、白平衡、自动曝光控制等，依赖于 ISP 才能在不同的光学条件下都能较好的还原现场细节，ISP 技术在很大程度上决定了摄像机的成像质量，是拍照过程中的运算处理单元，其地位相当于相机的“大脑”。 使用相机和手机等设备拍照时: 光学镜片：把光聚焦到传感器上 传感器：将光信号转换成电信号 ISP：将传感器得到的信号进行处理得到可视图像 最后由手机或相机设备处理器处理储存和显示图片 ISP 通过运行在其上的 firmware（固件）对 ISP 逻辑，从而对 lens 和 sensor 进行相应控制，进而完成自动光圈、自动曝光、自动白平衡等功能。 ISP 由 ISP 逻辑及运行在其上的 Firmware 组成，逻辑单元除了完成一部分算法处理外，还可以统计出当前图像的实时信息。Firmware 通过获取 ISP 逻辑的图像统计信息，重新计算，反馈控制 lens、sensor 和 ISP 逻辑，以达到自动调节图像质量的目的。 ISP 的 Firmware 包含三部分，一部分是 ISP 控制单元和基础算法库，一部分是 AE/AWB/AF 算法库，一部分是 sensor 库。Firmware 设计的基本思想是单独提供 3A 算法库，由 ISP 控制单元调度基础算法库和 3A 算法库，同时 sensor 库分别向 ISP 基础算法库和 3A 算法库注册函数回调，以实现差异化的 sensor 适配。 ISP firmware 架构 内部结构CPUCPU 即中央处理器，可以运行 AF、LSC 等各种图像处理算法，控制外围设备。现代的 ISP 内部的 CPU 一般都是 ARM Cortex-A 系列的，例如 Cortex-A5、Cortex-A7。 SUB IPSUB IP 是各种功能模块的通称，对图像进行各自专业的处理。常见的 SUB IP 如 DIS、CSC、VRA 等。 图像传输接口图像传输接口主要分两种，并口 ITU 和串口 CSI。CSI 是 MIPI CSI 的简称，鉴于 MIPI CSI 的诸多优点，在手机相机领域，已经广泛使用 MIPI-CSI 接口传输图像数据和各种自定义数据。外置 ISP 一般包含 MIPI-CSIS 和 MIPI-CSIM 两个接口。内置 ISP 一般只需要 MIPI-CSIS 接口。 通用外围设备通用外围设备指 I2C、SPI、PWM、UART、WATCHDOG 等。ISP 中包含 I2C 控制器，用于读取 OTP 信息，控制 VCM 等。对于外置 ISP，ISP 本身还是 I2C 从设备。AP 可以通过 I2C 控制 ISP 的工作模式，获取其工作状态等。 控制方式CPU 处理器包括：AP、BP、CP。 BP：基带处理器、AP：应用处理器、 CP：多媒体加速器。这里所说的控制方式是 AP 对 ISP 的操控方式。 I2C/SPI：一般是外置 ISP 的做法。SPI 一般用于下载固件、I2C 一般用于寄存器控制。在内核的 ISP 驱动中，外置 ISP 一般是实现为 I2C 设备，然后封装成 V4L2-SUBDEV。 MEM MAP：一般是内置 ISP 的做法。将 ISP 内部的寄存器地址空间映射到内核地址空间， MEM SHARE：内置 ISP 的做法。AP 这边分配内存，然后将内存地址传给 ISP，二者实际上共享同一块内存。因此 AP 对这段共享内存的操作会实时反馈到 ISP 端。 ISP 架构方案上文多次提到外置 ISP 和内置 ISP，这实际上是 ISP 的架构方案。它可以分为独立与集成两种形式。 外置 ISP 架构指在 AP 外部单独布置 ISP 芯片用于图像信号处理。外置 ISP 的架构图一般如下所示： 外置 ISP 架构 外置 ISP 架构的优点主要有： 能够提供更优秀的图像质量 ：在激烈的市场竞争下，能够存活到现在的外置 ISP 生产厂商在此领域一般都有很深的造诣，积累了丰富的影像质量调试经验，能够提供比内置 ISP 更优秀的性能和效果。因此，选用优质的外置 ISP 能提供专业而且优秀的图像质量。 能够支援更丰富的设计规划 ：外置 ISP 的选型基本不受 AP 的影响，因此魅族可以从各个优秀 ISP 芯片供应商的众多产品中甄选最合适的器件，从而设计出更多优秀的产品。 能够实现产品的差异化：内置 ISP 是封装在 AP 内部的，是和 AP 紧密的联系在一起，如果 AP 相同，那么 ISP 也就是一样的。因此基于同样 AP 生产出来的手机，其 ISP 的性能也是一样的，可供调教的条件也是固定的，这样就不利于实现产品的差异化。而如果选择外置 ISP，那么同一颗 AP，可以搭配不同型号的 ISP，这样可以实现产品的差异化，为给用户提供更丰富和优质的产品。 外置 ISP 架构的缺点主要有： 成本价格高：外置 ISP 需要单独购买，其售价往往不菲，而且某些特殊功能还需要额外支付费用。使用外置 ISP，需要进行额外的原理图设计和 LAYOUT，需要使用额外的元器件。 开发周期长 ：外置 ISP 驱动的设计需要多费精力和时间。使用外置 ISP 时，AP 供应商提供的 ISP 驱动就无法使用，需要额外设计编写外置 ISP 驱动。另外，为了和 AP 进行完美的搭配，将效果最大化，也往往需要付出更多的调试精力。上文也提到，使用外置 ISP，需要进行额外的原理图设计和 LAYOUT，需要使用额外的元器件，这也是需要花费时间进行处理的。 内置 ISP 架构在 AP 内部嵌入了 ISP IP，直接使用 AP 内部的 ISP 进行图像信号处理。 内置 ISP 的架构图一般如下所示： 内置 ISP 架构 内置 ISP 架构的优点主要有： 能降低成本价格：内置 ISP 内嵌在 AP 内部，因此无需像外置 ISP 一样需要额外购买，且不占 PCB 空间，无需单独为其设计外围电路，这样就能节省 BOM，降低成本。鉴于大多数用户在选购手机时会将价格因素放在重要的位置，因此降低成本能有效的降低终端成品价格，有利于占领市场。 能提高产品的上市速度：内置 ISP 和 AP 紧密结合，无需进行原理图设计和 LAYOUT 设计，因此可以减小开发周期，加快产品上市的速度。 能降低开发难度：如果使用内置 ISP，那么 AP 供应商能在前期提供相关资料，驱动开发人员可以有充足的时间熟悉相关资料，而且不会存在软件版本适配问题，也不存在平台架构兼容性问题。 使用内置 ISP 当然也有相应的不足之处： ISP 供应商往往都不能提供针对某个平台的代码/资料，而且一般都存在软件版本兼容问题，这就需要驱动开发人员付出额的经历和时间。 事实上，鉴于 ISP 的重要性，为了推广其 AP，提高其 AP 竞争力，现在 AP 内置的 ISP 也越来越强大，其性能足以满足手机市场的需求。再加上其一系列优点，现在使用内置 ISP 方案的手机越来越多。 ISP 工作流程ISP 的功能比较杂，基本上跟图像效果有关的它都有份。它内部包含多个图像算法处理模块，实际情况下，不同芯片的 ISP，其处理流程和模块可能会稍有不同，但是其原理、实现功能都是一样的。 ISP 输入图像的格式目前很多相机、摄像机产品都会在镜头光路中插入一个红外截止滤光片，其作用是允许波长小于截止频率的光进入系统，而阻止波长大于截止频率的光。常用的截止频率有 630nm 和 650nm 两种，它们允许不同程度的红光进入成像系统，因此会对白平衡和颜色校正算法产生影响，所以 ISP 的参数配置必须要与实际选用的截止频率相配置。 目前主流的 CMOS sensor 几乎都是输出 Bayer mosaic 格式的 RAW 数据。Bayer 格式图片是伊士曼·柯达公司科学家 Bryce Bayer（1929 –2012）发明的，拜耳阵列被广泛运用与数字图像处理领域。Bayer CFA 作为最经典的阵列，它交替的使用一组(R,G),(B,G)滤镜，其中 G 占总像素的的 1/2，R、B 各占总像素的 1/4,这是由于人眼对绿色更为敏感，能分辨更多的细节，同时 G 占据了光谱中重要且最宽的位置。 常用的 Bayer 格式有 RGGB,、GRBG、GBRG 等多种，因此需要正确配置 ISP 以反应 sensor 的数据格式。华为 P30Pro 夜间拍摄能力较强，用到了 RYYB 的滤镜阵列设计。 GBRG/GRBG/RGGB RAW 数据的精度常见有 8/10/12/14bit 等规格。安防监控行业较多使用 10/12bit 精度的 sensor，医疗行业则主要使用 12bit 以上精度 sensor，单反和广电行业则主要使用 14bit 精度 sensor。当精度高于 8bit 时，就会自然带来如何存储和表示数据的问题。对与一些带宽和存储资源特别紧张的场合，有些 sensor 会支持压缩表示以节约带宽，但是这就需要 ISP 能够支持相应的压缩格式，否则就需要增加格式适配处理环节，无论是采用硬件还是软件方式实现都会增加系统的复杂度和成本。 4K 分辨率的图像有 800W 个像素，RAW 格式占 1600W 字节，YUV422 格式占 1200W 字节。为了减轻传输带宽和存储的压力，支持 4K 以上的芯片都会在 DMA 上设计一个压缩算法。并进行 Crop/Resize 即改变图像的尺寸。当 DMA 向内存中写入数据时，实际进入内存的是压缩后的数据。当 DMA 从内存中读取数据时，用户得到的是解压缩后的数据。 图像接入 ISP 的方式使用 ISP 处理图像数据时有两种常用的数据接入方式，即 在线模式：sensor 产生的实时数据和时序控制信号以行为单位送入 ISP 进行处理，具备低延迟的优点，具体表现是一帧图像的第一个像素数据流出 sensor 后马上就进入 ISP 流水线开始处理。 离线模式：待处理的图像以帧为单位存储于系统内存，需要处理时由一个控制逻辑通过 DMA 从内存中读取数据，并添加模拟 sensor 行为的时序控制信号，然后送给 ISP 进行处理，所以 ISP 通常需要等到一帧图像的最后一个像素数据到齐之后才开始启动处理。 黑电平校正BLC， Black Level Correction Black Level 是用来定义图像数据为 0 时对应的信号电平。由于暗电流的影响，传感器出来的实际原始数据并不是我们需要的黑平衡（数据不为 0）。所以，为减少暗电流对图像信号的影响，可以采用的有效的方法是从已获得的图像信号中减去参考暗电流信号，那么就可以将黑电平矫正过来。 镜头阴影校正LSC， Lens Shade Correction 用于消除图像周边和图片中心的不一致性，包含亮度和色度两方面。ISP 需要借助 OTP 中的校准数据完成 LSC 功能。 由于相机在成像距离较远时，随着视场角慢慢增大，能够通过照相机镜头的斜光束将慢慢减少，从而使得获得的图像中间比较亮，边缘比较暗，这个现象就是光学系统中的渐晕。由于渐晕现象带来的图像亮度不均会影响后续处理的准确性。因此从图像传感器输出的数字信号必须先经过镜头矫正功能块来消除渐晕给图像带来的影响。同时由于对于不同波长的光线透镜的折射率并不相同，因此在图像边缘的地方，其 R、G、B 的值也会出现偏差，导致 CA(chroma aberration)的出现，因此在矫正渐晕的同时也要考虑各个颜色通道的差异性。 常用的镜头矫正的具体实现方法是：首先确定图像中间亮度比较均匀的区域，该区域的像素不需要做矫正；以这个区域为中心，计算出各点由于衰减带来的图像变暗的速度，这样就可以计算出相应 R、G、B 通道的补偿因子(即增益)。实际项目中，可以把镜头对准白色物体，检查图像四周是否有暗角。 镜头阴影有两种表现形式，分别是 Luma shading，又称 vignetting，指由于镜头通光量从中心向边缘逐渐衰减导致画面边缘亮度变暗的现象。 Chroma shading，指由于镜头对不同波长的光线折射率不同引起焦平面位置分离导致图像出现伪彩的现象。 Luma shading画面边缘镜头能量衰减，由于镜头中都会存在多处光阑，当入射光线偏离光轴角度较大时，部分光线就会被光阑遮挡而不能参与成像，因此越靠近 sensor 边缘的像素接收到的曝光量就越低。 边缘像素微透镜焦点和感光面的错位，这个问题在手机 sensor 上通常会更严重一些，因此设计手机 sensor 的厂家会采取一些特定的方法去缓解这个问题。 找到中心点后，以中心点为原心，向周围以圆为单位补 Gain，离中心点越远，补的越大。 一种常用的方法是在微透镜上做文章，即从中心像素开始，微透镜的尺寸略小于感光面的面积一点点，这样越往边缘微透镜与感光面之间的错位就越大，刚好可以补偿入射光线角度增大导致的焦点偏移，使光线可以更好地聚焦到感光面上。 不过深入研究会发现，这个补偿办法其实也是有局限的，如果 sensor 采用的是下图左所示的 FSI 工艺（前照式），从像素微观结构来看，当入射光线角度比较大时，会有较多光线与像素中的金属布线层发生吸收、散射从而产生损失，单纯移动微透镜的位置并不能有效解决这个问题。但是，如果像素采用的是背照式工艺，因为布线层在硅片的另外一侧，所以光线损失会少，补偿效果更加有效。 Vigetting 是由镜头引起的现象，所以 LSC 校正也是针对特定镜头的。若果产品的适配镜头发生变化，原则上需要重新进行 LSC 校正。另外，Vigetting 现象在 sensor 靶面较大、镜头焦距较短时表现更加明显。采用非球面镜头通常可以改善 vignetting。 Chroma shadingChromatic Aberration Correction， Chromatic Dispersion，色差，色散 光学上透镜无法将各种波长的色光都聚焦在同一点上的现象。它的产生是因为透镜对不同波长的色光有不同的折射率（色散现象）。对于波长较长的色光，透镜的折射率较低。在成像上，色散表现为高光区与低光区交界上呈现出带有颜色的“边缘”，这是由于透镜的焦距与折射率有关，从而光谱上的每一种颜色无法聚焦在光轴上的同一点。色差可以是纵向的，由于不同波长的色光的焦距各不相同，从而它们各自聚焦在距离透镜远近不同的点上；色差也可以是横向或平行排列的，由于透镜的放大倍数也与折射率有关，此时它们会各自聚焦在焦平面上不同的位置。 除了在镜头设计时通过采用具有相同色散特性而方向相反的不同光学材料组成成对的镜片组等手段来控制色差，在 ISP 过程中也能处理色差，对于横向色差，通常在图像全局上进项校正，将红绿蓝三 个颜色通道调整到相同的放大倍数，一般通过标定三个颜色平面的增益来修正，为了控制标定表格的存储空间，通常只标定 MxN 个关键点，任意位置处的像素增益可以使用相邻四个标定关键点通过双线性插值的方法动态计算得到。这对于固定的光学镜头比较有效，但是对变焦镜头则难以适用。 坏点校正DPC， Defect Pixel Correction， Bad Point Correction 所谓坏点，是指像素阵列中与周围像素点的变化表现出明显不同的像素，因为图像传感器是成千上万的元件工作在一起，因此出现坏点的概率很大。一般来讲，坏点分为三类：第一类是死点，即一直表现为最暗值的点；第二类是亮点，即一直表现为最亮值的点：第三类是漂移点，就是变化规律与周围像素明显不同的像素点。由于图像传感器中 CFA 的应用，每个像素只能得到一种颜色信息，缺失的两种颜色信息需要从周围像素中得到。如果图像中存在坏点的话，那么坏点会随着颜色插补的过程往外扩散，直到影响整幅图像。因此必须在颜色插补之前进行坏点的消除。 由于 Sensor 是物理器件，有坏点是难以避免的；而且使用时间长了坏点会越来越多。通过在全黑环境下观察输出的彩点和亮点，或在白色物体下观察输出的彩点和黑点，就可以看到无规律的散落在各处的坏点。 检测坏点。在 RGB 域上做 5x5 的评估，如果某个点和周围的点偏离度超过阈值的点为坏点。为了防止误判，还需要更复杂的逻辑，如连续评估 N 帧。 纠正坏点。对找到的坏点做中值滤波，替换原来的值即可。 绿平衡GB， Green Balance 由于感光器件制造工艺和电路问题，Gr,Gb 数值存在差异,将出现格子迷宫现象可使用均值算法处理 Gr,Gb 通道存在的差异,同时保留高频信息。 还有一个说法是： Sensor 芯片的 Gr，Gb 通道获取的能量或者是输出的数据不一致，造成这种情况的原因之一是 Gr，GB 通道的半导体制造工艺方面存在差异，另一方面是 Microlens 的存在，特别是 sensor 边缘区域，GB，Gr 因为有角度差异，导致接收到的光能不一致。如果两者差异比较大，就会出现类似迷宫格子情况。 去除噪声Denoise， Noise Reduction 研究发现，噪声在 ISP 流水线各模块中会不断产生、传播、放大、改变统计特性，对图像质量的影响会越来越大，而且越来越不容易控制。因此处理噪声的基本原则是越早越好，随时产生随时处理，尽可能将问题消灭在萌芽状态。 目前主流的 ISP 产品中一般会选择在 RAW 域、RGB 域、YUV 域等多个环节设置降噪模块以控制不同类型和特性的噪声。在 YUV 域降噪的方法已经得到了广泛的研究并且出现了很多非常有效的算法，但是在 RAW 域进行降噪则因为 RAW 数据本身的一些特点而受到不少限制。主要的限制是 RAW 图像中相邻的像素点分别隶属于不同的颜色通道，所以相邻像素之间的相关性较弱，不具备传统意义上的像素平滑性，所以很多基于灰度图像的降噪算法都不能直接使用。又因为 RAW 数据每个像素点只含有一个颜色通道的信息，所以很多针对彩色图像的降噪算法也不适用。 RAW 域降噪Sensor 输出的 RAW 图像本身是携带了噪声的，光照程度和传感器问题，包括热噪声、光散粒噪声、读出噪声、固定模式噪声，是生成图像中大量噪声的主要因素。当 sensor 温度较高、增益较大、环境较暗的情况下各种噪声会变得更加明显，成为影响图像质量的主要因素。 FPN（Fix Pattern Noise）：固定模式噪声。由于 CMOS 每个感光二极体旁都搭配一个 ADC 放大器，如果以百万像素计，那么就需要百万个以上的 ADC 放大器，但是每个像素结构中的光电二极管的尺寸、掺杂浓度、生产过程中的沾污以及 MOS 场效应管的参数的偏差等都会造成像素输出信号的变化。对于给定的单个像素它是固定的。通常消除固定模式噪声采用“双采样降噪”方法，这是 CMOS 感光器件特有的一种降噪方式。在光线较暗的环境下使用时，画面会有明显的噪声，这时通过对景物进行两次不同曝光率和敏感度的采样，然后将两次采样的结果进行综合处理，就可以有效解决低照度下的图像噪声问题。 Senor 的感光器件包含模拟部分，所以信号中的噪声很难避免。同时， 当信号经过 ADC 时， 又会引入其他一些噪声。 另外，当光线较暗时，camera 需要提高增益才能使画面达到正常亮度，同时也放大了噪声，图像出现明显的噪点。我们在看没有经过降噪处理的图片时，会感觉到图片上浮了一层彩色雪花点。 这些噪声会使图像整体变得模糊， 而且丢失很多细节， 所以需要对图像进行去噪处理。和很多图像处理算法一样，降噪即可以在空域(spatial domain)上实现，也可以在频域(frequency domain)上实现，比较有常用频域方法有傅里叶变换，离散余弦变换(DCT)，小波变换，多尺度几何分析等。随着人工智能技术的发展，近些年来还涌现了一批基于深度学习技术实现的降噪算法。后面提到的这些方法虽然都有不错的性能，但是对算力要求都比较高，并不一定适合处理高分辨率的实时视频流，所以在 ISP 产品中应用的并不广泛，目前适合 ISP 应用的降噪算法还是以经典低通滤波器的改进版本更为常见。 目前在 RAW 域降噪基本都需要将 RAW 图像按照颜色分成四个通道(R,Gr,Gb,B)，然后在各个通道上分别应用滤波器进行平滑，根据滤波器的特点和复杂度大致可以分成以下几类： 经典低通滤波器：如均值滤波、中值滤波、高斯滤波、维纳滤波等。这类方法的优点是比较简单，占用资源少，速度快，缺点是滤波器是各向同性的，容易破坏图像中的边缘。另外由于没有考虑颜色通道之间的相关性所以也容易引入伪彩等噪声，而人眼对这种颜色噪声是比较敏感的。 非线性去噪算法： 一般的高斯滤波在进行采样时主要考虑了像素间的空间距离关系， 并没有考虑像素值之间的相似程度， 因此这样得到的模糊结果通常是整张图片一团模糊。 为了避免图像变模糊，就需要保持图像的边缘，这时，就还要考虑相邻像素和本像素的相似程度，对于相似度高的像素给予更高的权重，一般采用非线性去噪算法， 例如 Eplison 滤波、双边滤波器， 在采样时不仅考虑像素在空间距离上的关系， 同时加入了像素间的相似程度考虑， 增加了阈值检测用于区分同类像素和异类像素，同类像素分配较大的滤波权重，异类像素则权重很小因而基本不参与滤波。因而可以保持原始图像的大体分块， 有效地保护图像边缘，复杂度增加也不大，其它特点与经典滤波器基本相同。 引导滤波器：由何凯明博士早期提出的一种算法，引入了引导图像的概念。对于任一颜色通道的图像，以当前位置像素为中心，在一个固定大小的滤波窗口内的所有邻近像素计算权重，计算权重的方法是以某个引导图像作为参考，在引导图像的对应滤波窗口内，凡是与像素性质“类似”的像素都得到较大的权重，与 I(x,y) 性质“相反”的像素则得到较小的权重。这种方法的基本假设是图像各通道的颜色梯度分布与引导图像是一致的，如果假设不成立，则从引导图像计算出的权重反而容易破坏其它通道中的边缘。 基于块匹配的滤波算法：利用图像的自相似特性，在以当前像素为中心的一个滤波窗口内找到与当前块最相似的几个块，当前像素的滤波值即等于几个相似块的中心像素的加权平均值。此类算法以非局部均值滤波(Non-Local Means)和 BM3D(Block Matching 3D)算法为代表，它们的优点是平滑性能和边缘保持性能很好，缺点是计算量很大，资源消耗大，不太适合处理实时视频。除了空域上滤波，也可以结合时域进行滤波，3DNR 是结合空域滤波和时域滤波的一种降噪算法。大概思路是检测视频的运动水平，更具运动水平的大小对图像像素进行空域滤波和时域滤波的加权，之后输出滤波之后的图像 除了 Sensor 图像本身携带的噪声之外，图像每次会经过 ISP 模块的处理之后都会引入一些新的噪声，或者对原有噪声进行了放大。 以 LSC 模块为例，LSC 校正的实质是在输入图像上乘以一个与像素位置有关的增益系数以补偿光信号的衰减，而补偿的规律是越远离图像中心的地方增益越大。根据噪声传播的基本原理，当增益系数大于 1 时，图像中的噪声是与信号一起被同步被放大的。另外，由于 ISP 所用乘法器的精度是有限的，每做一次乘法就会重新引入一次截断误差，这是新增的噪声来源，所以经 LSC 处理后图像的整体噪声水平会有所增加，而且在图像的边缘处表现会更加明显。 Shading 固然是不好的，需要校正，但是为了校正 shading 而给图像引入噪声同样也不好的，所以人们需要权衡在多大程度上校正 shading 能够收到满意的效果。这是在主观图像质量调试阶段需要考虑的问题之一。 YUV 域我们可以把这些 YUV Image Noise 再分为 Luminance Noise 跟 Chroma Noise 二类，影像放到不同的色空间来看，就很明确分别出差异了。一张 RGB 空间的影像转换到 YUV，我们在 Y domain 下看到的即是 Luminance Noise，在 UV domain 下看的就是 Chroma Noise。 Chroma Noise 跟 Color Noise 是有一定差异的。Color Noise 里所形容的 color，并不是单纯指影像的色彩杂讯，而是已包含亮度资讯的色彩，所以 Color Noise 应可以广义形容为 Image Noise。而 Chroma Noise 较能明确指出 chroma(彩色)部份的 Noise。因此严格说来 Color Noise 不等于 Chroma Noise。 Chroma Noise 量化方式： 市面相机量化步骤：把灰卡以不同 ISO 值拍摄，假设以 ISO100 为基准，ISO 值提高一倍时，快门时间也缩短一倍，以维持影像的灰度。 工程模式量化步骤：把灰卡以一定的曝光线数及 1 倍 gain(Again*Dgain)的设定拍摄，并以此为基准，而后 gain 提高 1 倍时，曝光线数也随之降低 1 倍，以维持影像的灰度。 极短的快门时间配上高 ISO 或极短的曝光时间配上高倍数的 gain 后，便会产生较多的 Noise，依不同设定所拍摄下影像的标准差倾向，即可分析出差异。 颜色插值Demosaic 是 ISP 的主要功能之一。sensor 的像素点上覆盖着 CFA（彩色滤色矩阵，Color Filter Array），光线通过 CFA 后照射到像素上。CFA 由 R、G、B 三种颜色的遮光罩组成，每种遮光罩只允许一种颜色通过，因此每个像素输出的信号只包含 R、G、B 三者中的一种颜色信息。sensor 输出的这种数据就是 BAYER 数据，即通常所说的 RAW 数据。显而易见，RAW 数据所反映的颜色信息不是真实的颜色信息。DEMOSAIC 就是通过插值算法将将每个像素所代表的真实颜色计算出来。 目前最常用的插补算法是利用该像素点周围像素的平均值来计算该点的插补值。 光线中主要包含三种颜色信息，即 R、G、B。但是由于像素只能感应光的亮度，不能感应光的颜色，同时为了减小硬件和资源的消耗，必须要使用一个滤光层，使得每个像素点只能感应到一种颜色的光。目前主要应用的滤光层是 bayer GRBG 格式。 经过滤色板的作用之后，每个像素点只能感应到一种颜色。必须要找到一种方法来复原该像素点其它两个通道的信息，寻找该点另外两个通道的值的过程就是颜色插补的过程。由于图像是连续变化的，因此一个像素点的 R、G、B 的值应该是与周围的像素点相联系的，因此可以利用其周围像素点的值来获得该点其它两个通道的值。目前最常用的插补算法是利用该像素点周围像素的平均值来计算该点的插补值。 Demosaic 算法的主要难点在于，RAW 域的任何一个像点（photosite）只包含一个真实的采样值，而构成像素（R,G,B）的其它两个值需要从周围像点中预测得到。既然是预测，就一定会发生预测不准的情况，这是不可避免的，而预测不准会带来多种负面影响，包括拉链效应（zipper artifacts），边缘模糊，颜色误差等。而由于彩色插值“推测式”算法，R+B 时最容易推测出来的——就是 Magenta 洋红，就是拍照时紫边的主色。 Demosaic 拉链效应，边缘模糊，伪彩 色温Color Temp 所谓色温，简而言之，就是定量地以开尔文温度（K）来表示色彩。英国著名物理学家开尔文认为，假定某一黑体物质，能够将落在其上的所有热量吸收，而没有损失，同时又能够将热量生成的能量全部以“光”的形式释放出来的话，它便会因受到热力的高低而变成不同的颜色。 黑体，是一个理想化了的物体，它能够在任何温度下，吸收外来的任何波的电磁辐射，并且不会有任何的反射与透射。 在 700K 之下的黑体所放出来的辐射能量很小且辐射波长在可见光范围之外，看起来是黑色的。若黑体的温度高过上述的温度的话，它会开始变成红色，并且随着温度的升高，而分别有橘色、黄色、白色等颜色出现，温度越高，光色越偏蓝。当温度超过 1600K 时开始发白色和蓝色。当黑体变为白色的时候，它同时会放出大量的紫外线。 即黑体吸收和放出电磁波的过程遵循了光谱，其轨迹为普朗克轨迹（或称为黑体轨迹）。黑体辐射实际上是黑体的热辐射。在黑体的光谱中，由于高温引起高频率即短波长，因此较高温度的黑体靠近光谱结尾的蓝色区域而较低温度的黑体靠近红色区域。 由于人眼具有独特的适应性，使我们有的时候不能发现色温的变化。比如在钨丝灯下呆久了，并不会觉得钨丝灯下的白纸偏红，如果突然把日光灯改为钨丝灯照明，就会觉查到白纸的颜色偏红了，但这种感觉也只能够持续一会儿。 相机的传感器并不能像人眼那样具有适应性，所以如果摄像机的色彩调整同景物照明的色温不一致就会发生偏色。白平衡就是为了避免偏色的出现。 自动白平衡AWB， Automatic White Balance 白平衡。白平衡与色温相关，用于衡量图像的色彩真实性和准确性。ISP 需要实现 AWB 功能，力求在各种复杂场景下都能精确的还原物体本来的颜色。 人类视觉系统具有颜色恒常性的特点，不会受到光源颜色的影响。实际生活中，不论是晴天、阴天、室内白炽灯或日光灯下，人们所看到的白色物体总是是白色的，这就是视觉修正的结果。人脑对物体的颜色有一定先验知识，可识别物体并且更正这种色差。 因此人类对事物的观察可以不受到光源颜色的影响。 但是图像传感器本身并不具有这种颜色恒常性的特点，获取的图像容易受到光源颜色的影响。 如白炽灯照明下拍出的照片易偏黄；而在户外日光充足则拍摄出来景物也会偏蓝。 因此，其在不同光线下拍摄到的图像，会受到光源颜色的影响而发生变化。例如在晴朗的天空下拍摄到的图像可能偏蓝，而在烛光下拍摄到的物体颜色会偏红。因此，为了消除光源颜色对于图像传感器成像的影响，自动白平衡功能就是模拟了人类视觉系统的颜色恒常性特点来消除光源颜色对图像的影响，让不同色温光线条件下白色物体，Sensor 的输出都转换为更接近白色。 它会通过摄像机内部的电路调整，改变蓝、绿、红三个通道电平的平衡关系，使反射到镜头里的光线都呈现为消色。如果以偏红的色光来调整白平衡，那么该色光的影像就为消色，而其他色彩的景物就会偏蓝（补色关系）。 白平衡与色温相关，用于衡量图像的色彩真实性和准确性。简单的说，就是通过图像调整，使在各种光学条件下拍摄出的照片色彩和人眼所看到的景物色彩完全相同。 白平衡就是调整 R/B 增益，达到 R、G、B 相等。 比较常用的 AWB 算法有灰度世界、完美反射法等。 灰度世界（Gray World）算法基于一个假设：平均来讲，世界是灰色的。 完美反射法基于一个假设：白色是反射率最高的颜色，直方图上 RGB 响应最右边的部分就代表着白色的响应。所以把 RGB 响应的直方图拉齐了，也就实现了白平衡。完美反射法确实听起来很完美，但是，如果图像里没有白色或者存在比较强的噪声，这个方法就不好用了。 白平衡调整在前期设备上一般有三种方式：自动白平衡，分档设定白平衡，精确设定白平衡（手动设定模式）。 自动白平衡：依赖数码相机里的测色温系统，测出红光和蓝光的相对比例。再依据次数据调整曝光，产生红、绿、蓝电信号的增益。自动白平衡有 3 个步骤： 检测色温，如果手工调节，就知道图像中什么位置是白色物体了，色温容易检测；如果是自动调节，就需要估计出（猜出）图像中的白色位置，这是最重要的一环； 实际计算中为了实时操作，减少计算量，通常选取某个特定区域(如图像中央)像素进行计算。但若图像颜色较为单一或选定区域正好落入大的色块（红光下的白墙），以上算法求得的色温会非常不准确。为此，必须根据一定的约束条件，挑选出白色像素来计算色差。 计算增益，计算 R 和 B 要调整的增益；调整增益将 Cb 和 Cr 调整到 0 (或接近 0)的两个系数，即 R=G=B。 色温矫正，根据增益调整整幅图片的色温。 分档设定白平衡：按光源种类分和色温值分两类。相机上分别设有日光、阴天、日光灯、白炽灯、闪光灯的图标档位。拍摄时只需将拍摄时的光源种类和相机上的白平衡档位相吻合就可拍出较为准确的色彩。按色温分类的白平衡，理论上讲其精度要高于按光源种类分档。但它要求使用者要记住各种光源的色温值，这就给使用者带来极大的麻烦。 精确白平衡（手动设定模式）：在拍摄现场光的条件下，用白纸或白色物体充满镜头视野进行白平衡调节。经过这样的调试再拍摄，记录的色彩将是非常准确的这是目前最准确的白平衡调节方式。 颜色校正CCM， Color Correction Matrix，MCT-CMX，多色温颜色矩阵矫正 颜色校正主要为了校正在滤光板处各颜色块之间的颜色渗透带来的颜色误差。 AWB 已经将白色校准了，CCM 就是用来校准除白色以外其他颜色的准确度的。一般颜色校正的过程是首先利用该图像传感器拍摄到的图像与标准图像相比较，以此来计算得到一个校正矩阵。该矩阵就是该图像传感器的颜色校正矩阵。在该图像传感器应用的过程中，及可以利用该矩阵对该图像传感器所拍摄的所有图像来进行校正，让色彩贴近现实、饱满、细节突出、清晰度更好。 一般情况下，对颜色进行校正的过程，都会伴随有对颜色饱和度的调整。颜色的饱和度是指色彩的纯度，某色彩的纯度越高，则其表现的就越鲜明；纯度越低，表现的则比较黯淡。RGB 三原色的饱和度越高，则可显示的色彩范围就越广泛。 伽马校正Gamma Correction 传感器对光线的响应和人眼对光线的响应是不同的，人眼对暗部细节比 Sensor 敏感，伽玛校正就是使得图像看起来符合人眼的特性 。 伽马校正的最初起源是 CRT 屏幕的非线性，显示器的阴极现象管（也就是物理上所说的示波管的阴极射线版）的成像扭曲引起的。由于对于输入信号的发光灰度，不是线性函数，而是指数函数，为了不使画面失真所以就用先进行校正，此之谓伽马校正。 但是实际情况是，即便 CRT 显示是线性的，伽马校正依然是必须的，是因为人类视觉系统对于亮度的响应大致是成对数关系的，而不是线性的。人类视觉对低亮度变化的感觉比高亮度变化的感觉来的敏锐，当光强度小于 1 lux 时，常人的视觉敏锐度会提高 100 倍。比如：在一间小黑屋中每增加一盏灯，摄像机都能线性增加亮度。但是人眼在黑暗时增加一盏灯时感受明显，往后随着灯的个数增长人眼并不会有明显感受。 校正过程就是对图像的伽玛曲线进行编辑，检出图像信号中的深色部分和浅色部分，并使两者比例增大，从而提高图像对比度效果，增加更多的暗部色阶，以对图像进行非线性色调编辑。 Gamma 曲线是一种特殊的色调曲线，当 Gamma 值等于 1 的时候，曲线为与坐标轴成 45° 的直线，这个时候表示输入和输出密度相同。高于 1 的 Gamma 值将会造成输出亮化，低于 1 的 Gamma 值将会造成输出暗化。总之，我们的要求是输入和输出比率尽可能地接近于 1。一般情况下，当用于 Gamma 矫正的值大于 1 时，图像的高光部分被压缩而暗调部分被扩展，当 Gamma 矫正的值小于 1 时，图像的高光部分被扩展而暗调部分被压缩，Gamma 矫正一般用于平滑的扩展暗调的细节。 而人眼是按照 gamma &lt; 1 的曲线对输入图像进行处理的。 现在常用的伽马校正是利用查表法来实现的，即首先根据一个伽马值，将不同亮度范围的理想输出值在查找表中设定好，在处理图像的时候，只需要根据输入的亮度，既可以得到其理想的输出值。在进行伽马校正的同时，可以一定范围的抑制图像较暗部分的噪声值，并提高图像的对比度。还可以实现图像现显示精度的调整，比如从 10bit 精度至 8bit 精度的调整。 颜色空间变换RGBToYUV，RGB2YUV ，CSM， Color Space Matrix， CSC， Color Space Conversion Senor 的输出的 Raw data 是 RGB，但是有的处理在 YUV 上更方便，且 YUV 存储和传输时更省带宽。 YUV 是一种基本色彩空间， 人眼对亮度改变的敏感性远比对色彩变化大很多， 因此， 对于人眼而言， 亮度分量 Y 要比色度分量 U、 V 重要得多。 在 YUV 家族中，有 YUV444,YUV422，YUV420 等格式，这些格式有些比原始 RGB 图像格式所需内存要小很多，这样亮度分量和色度分量分别存储之后，给视频编码压缩图像带来一定好处。 并且在 YUV 色彩空间上进行彩色噪声去除、 边缘增强、后续输出转换为 jpeg 图片更方便。 YCbCr 是在计算机系统中应用最多的成员, 其应用领域很广泛，JPEG、MPEG 均采用此格式。一般人们所讲的 YUV 大多是指 YCbCr，它其实是 YUV 经过缩放和偏移的改动版，Y 表示亮度，Cr、Cb 表示色彩的色差，RGB 输入信号红色和蓝色颜色部分与 RGB 信号亮度值之间的差异。 宽动态范围WDR， Wide Dynamic Range， DRC， Dynamic Range Correction， Tone Mapping 自然界的中光强度很宽，而人眼对高亮，极暗环境的细节分辨能力相对较窄，而摄像头记录的范围更窄，真正的 HDR 技术就是记录视觉范围内高亮，极暗环境的中的细节分辨率。 动态范围(Dynamic Range)是指摄像机支持的最大输出信号和最小输出信号的比值，或者说图像最亮部分与最暗部分的灰度比值。普通摄像机的动态范围一般在 1:1000(60db)左右，而宽动态(Wide Dynamic Range, WDR)摄像机的动态范围能达到 1:1800-1:5600(65-75db)。 宽动态技术主要用来解决摄像机在宽动态场景中采集的图像出现亮区域过曝而暗区域曝光不够的现象。简而言之，宽动态技术可以使场景中特别亮的区域和特别暗的区域在最终成像中同时看清楚。 为保证人眼看到的世界和显示器或者摄像头采集的图像的亮度范围相差无几，甚至更好，需要通过色调映射 tone mapping，将暗处和亮出细节再现。这是一种纯粹为了视觉感受而进行的处理，并非真正的 HDR。 摄像机拍摄室外场景时，晴朗夏天的光照度可以达到 100k~200k lux，理论上拍摄这种场景需要提供高达 5k:1 的动态范围，在摄像机内部则需要使用至少 13 位的数据才能表示 5k:1 的动态范围，在通用 CPU 架构中使用 16 位整数则更加方便。由于数据在处理环节经常涉及除法、开方、指数等浮点运算，所以还需要预留若干个小数位以保持浮点精度，4 位二进制小数可以提供 0.0625 精度，8 位二进制小数可以提供 0.0039 精度。主流 ISP 方案中使用 20 位数据。 当图像在显示设备上输出时，普通的 LDR 显示器只能提供 256 级灰度，按数量级是 100:1 的动态范围。符合 HDR10 标准的显示器可以提供 1000:1 的动态范围，已经可以较好地还原自然场景的动态。如果摄像机的适配输出设备是 LDR 显示器，则摄像机的 ISP 内部需要完成从 5000:1 到 100:1 的动态范围压缩。 当 WDR 模块完成多帧合成（frame stitch）后，接下来就需要对数据位宽进行压缩以节约后续步骤的计算资源。比较合理的做法是采取逐级压缩策略，比如在 WDR 模块先压缩到 12 位精度，经过 CCM、Gamma 等颜色处理后进一步压缩到 10 位精度，经过 CSC 模块后进行最后一次压缩得到最终的 8 位精度输出。 从 16/20 位精度压缩到 12 位精度的过程称为色调映射，这一步骤的目的是调整图像的动态范围，将 HDR 图像映射到 LDR 图像，并尽量保证图像细节不损失，使得图像显示出更多的信息。 DRC 模块是一个基于人眼视觉系统特性的高级局部色阶映射（多空间动态范围压缩）模块。 Tone mapping 的方法将像素值在特别暗的区域拉高，在特别亮的区域拉低。 Tone mapping 有以下两种： global tone mapping 单一 tone mapping 曲线。对整幅图低拉高，高拉低。（缺点，蒙上一层雾感觉，因为数值压缩后忘中间靠拢，局部对比度下降） 双边滤波 tone mapping。在图像中局部边缘处不会进行 tone mapping，以保持局部细节。 local tone mapping 虚拟曝光。通过多帧相加确定哪些区域是高亮区，哪些区域是低亮区。然后分区进行 local tone mapping local gamma。图片分成多块，对每块进行 gamma 矫正。主要根据每块的亮度直方图进行动态调整 gamma 曲线。 锐化Sharp， Edge Enhance，边缘增强。 CMOS 输入的图像将引入各种噪声，有随机噪声、量化噪声、固定模式噪声等。ISP 降噪处理过程中，势必将在降噪的同时，把一些图像细节给消除了，导致图像不够清晰。为了消除降噪过程中对图像细节的损失，需要对图像进行锐化处理，通过滤波器获取图像的高频分量，按照一定的比例将高频部分和原图进行加权求和获取锐化后的图像，还原图像的相关细节。 自动曝光AE， Automatic Exposure Exposure 主要影响图像的明暗程度。不同场景下，光照的强度有着很大的差别。人眼有着自适应的能力因此可以很快的调整，使自己可以感应到合适的亮度。而图像传感器却不具有这种自适应能力，因此必须使用自动曝光功能来确保拍摄的照片获得准确的曝光从而具有合适的亮度。 AE 模块根据自动测光系统获得当前图像的曝光量，再自动配置镜头光圈、sensor 快门及增益来获得最佳的图像质量。自动曝光的算法主要分光圈优先、快门优先、增益优先。 光圈优先时算法会优先调整光圈到合适的位置，再分配曝光时间和增益，只适合 P-IRIS 镜头，这样能均衡噪声和景深。快门优先时算法会优先分配曝光时间，再分配 sensor 增益和 ISP 增益，这样拍摄的图像噪声会比较小。增益优先则是优先分配 sensor 增益和 ISP 增益，再分配曝光时间，适合拍摄运动物体的场景。自动曝光的实现一般包括三个步骤： 光强测量：测量的过程是利用图像的曝光信息来获得当前光照信息的过程。可以统计图像的全部像素，也可以统计图像中间部分、也可以将图像分成不同部分且每部分赋予不同权重。 按照统计方式的不同，分为全局统计，中央权重统计或者加权平均统计方式等。全局统计方式是指将图像全部像素都统计进来，中央权重统计是指只统计图像中间部分，这主要是因为通常情况下图像的主体部分都位于图像的中间部分；加权平均的统计方式是指将图像分为不同的部分，每一部分赋予不同的权重，比如中间部分赋予最大权重，相应的边缘部分则赋予较小的权重，这样统计得到的结果会更加准确。 场景分析：场景分析是指为了获得当前光照的特殊情况而进行的处理，比如有没有背光照射或者正面强光等场景下。对这些信息的分析，可以提升图像传感器的易用性，并且能大幅度提高图像的质量，这是自动曝光中最为关键的技术。目前常用的场景分析的技术主要有模糊逻辑和人工神经网络算法。这些算法比起固定分区测光算法具有更高的可靠性，主要是因为在模糊规则制定或者神经网络的训练过程中已经考虑了各种不同光照条件。 曝光补偿：控制相应的参数使得曝光调节生效。主要是通过设定曝光时间和曝光增益来实现的。 通过光强测量时得到的当前图像的照度和增益值与目标亮度值的比较来获得应该设置的曝光时间和增益调整量。在实际情况下，相机通常还会采用镜头的光圈/快门系统来增加感光的范围。在进行曝光和增益调整的过程中，一般都是变步长来调整的，这样可以提高调整的速度和精度。 增益和曝光的步长设定 在当前曝光量与目标量差别在 range0 以内的时候，说明当前曝光已经满足要求，不需要进行调整；差别在 range1 的范围内时，则说明当前曝光与要求的光照有差别，但差别不大，只需要用较小的步长来进行调节即可；当差别在 range2 的时候，则表明差别较大，需要用较大步长来进行调节。在实现过程中还需要注意算法的收敛性。 自动对焦AF， Automatic focus 根据光学知识，景物在传感器上成像最清晰时处于合焦平面上。通过更改 LENS 的位置，使得景物在传感器上清晰的成像，是 ISP focus 功能所需完成的任务。focus 分为手动和自动两种模式。 自动对焦包含 CONTRAST AF、PDAF、LASER AF 等算法。 AF 算法的基本步骤是先判断图像的模糊程度，通过合适的模糊度评价函数求得采集的每一副图像的评价值, 然后通过搜索算法得到一系列评价值的峰值, 获得最佳的对焦点是一个不断积累的过程，它通过比较每一帧图像的对比度从而获得镜头移动范围内最高的评价值点，进而确定对焦距离。 最后通过电机驱动将采集设备调节到峰值所在的位置, 得到最清晰的图像。 对焦评价函数：评价函数有很多种, 主要考虑的图像因素有图像频率(清晰的图像纹理多, 高频分布较多), 还有图像的灰度分量的分布(图像对应的灰度图的分量分布范围越大,说明图像的细节较多, 反应的图像的清晰程度) 。常用的搜索算法有爬山算法，该算法也有一定的局限性，它只适用于图像本身色差较大的情况。 搜索窗口有黄金分割点对焦嵌套窗口等. 串扰X-talk （Crosstalk），Bayer 域去颜色串扰 串扰是两条信号线之间的耦合、信号线之间的互感和互容引起线上的噪声。 三种类型的串扰 spectral xtalkRGB 频谱的串扰造成的。比如 color filter R 会有部分 G,B 的能量通过。color filter 的带通带宽宽的话会增大频谱干扰，但频谱干扰其实不可避免。 spectral xtalk electronic xtalk不同 pixel 的电子井由于储存了过多的电子荷溢出到邻近的电子井中。和电荷井的容限有关，电荷井越深，容限高，但是过高就会引起 spacial xtalk。三星的 Isocell 技术在像素之间引入绝缘层减少了此串扰。 electronic xtalk spatial xtalk由于光线角度的问题，本该照射到 R pixel 的光由 R pixel 来接受，但是可能因为空间太窄，进入相邻像素单元或其他无效区域内的现象。随着单位面积像素数的增加，特别是现在 4800 万以上的 sensor，像素之间的间距太小，又没有隔离层的情况下，sensor 边缘像素 spacial xtalk 会加剧。 spatial xtalk 上述原因导致结果都是图像在对角线上相邻两个像素的 Gr 和 Gb 值差异较大而产生不平滑的纹理状。 去假彩Anti False Color 假彩是指在一幅影像中使用与全彩不同的颜色描述一项物体。 真彩色：True Color，真彩色是指在组成一幅彩色图像的每个像素值中，有 R、G、B 三个基色分量，每个基色分量直接决定显示设备的基色强度产生彩色。 伪彩色：Pseudo Color，每个像素的颜色不是由每个基色分量的数值直接决定，而是把像素值当作颜色查找表(color look-up table， CLUT)的表项入口地址，去查找一个显示图像时使用的 R，G，B 强度值，用查找出的 R，G，B 强度值合成产生彩色。 假彩色：False Color，将多波段单色影像合成为假彩色影像，如 landsat 7/ETM+有八个波段，用其中三个合成就是假彩色。 从实现技术上讲，假彩色与真彩色是一致的，都是 R、G、B 分量组合显示；伪彩色显示调用的是颜色表。 耀斑补偿Flare offset， stray light offset 镜片的表面反射或镜筒、反光镜组的内面所引起的反射光，到达底面后造成画面整体或一部份产生了雾蒙，降低了图像的鲜锐度。镜片的镀膜及内面防反射处理的加强，固然可以大幅度地减少光斑，但被摄体的状况并不相同，不可能完全消除。 因此，在相机里面设计都是黑色的，且其内侧表明设计都是粗糙的，目前就是为了减小 flare。flare 如何修正？做直方图，然后每阶的亮度都往下降，这样是否会影响颜色呢？因此，flare 一定要是在 linear domain 去做，不能在 RGB domain 去做。 自动光圈Auto Iris 精确光圈控件 P-IRIS 工作原理： P-IRIS 是通过控制 P-IRIS 镜头中的步进电机动态精确的控制光圈大小，主要目的是设置最佳光圈位置，以便大部分镜头中心及效果最佳的部分得到使用，在此位置光学误差大大减小，从而提高图像质量。 P-IRIS 需要与增益和曝光时间相配合来管理光线的微小变化从而进一步优化图像质量，使最佳光圈位置保留尽可能长的时间。但超过增益和曝光时间的调节能力时，P-IRIS 再调节光圈到不同位置。 P-IRIS 控制方法及步骤 P-IRIS 想要实现的一个关键点是需要知道光圈当前的位置情况。这有两种方式， 控制光圈的是步进电机，步进电机可通过计算电机走的步数来计算当前位置。 控制光圈的是直流电机，这就需要通过霍尔传感器来检测当下位置。 其他局部对比度增强：Local Contrast Enhancement algorithm 抗频闪：AntiFlicker 去雾：AntiFog 去雨：AntiRain 丢帧策略：LostFrameStrategy 色调色饱和度控制：单独针对 Hue，Saturation，Contrast，Brightness 各图像分量进行调节。 直方图均衡化：Histogram。重新分布图片的亮度，使图片的亮度分布更加均匀。 图像格式转换：Data Formatter 写 DMA：DMA Writer Controller Reference 魅族内核团队：相机系统综述 —— ISP 5 分钟理解相机 ISP（图像信号处理） 相机系统综述 —— ISP ISP 算法介绍 —— super Good 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（六）——相机成像模型","date":"2020-05-21T16:19:00.000Z","path":"2020/05/21/keyboard-photography-6/","text":"本篇文章更多的是计算机视觉的基本知识，讲解真实的 3D 世界投影到相机的 2D 图像的这个过程。 坐标变换首先需要介绍的是我们如何用数学工具来表示物体在坐标中位姿（位置+姿态）的变换。 我们线性代数学习的矩阵*向量的乘法，其本质是对向量进行变换，如下述的旋转过程，v 向量变换到 v’ 向量，可以用矩阵来表示为 旋转 $$\\begin{bmatrix} x’ \\ y’ \\end{bmatrix} = \\begin{bmatrix} cos\\theta &amp;&amp; -sin\\theta\\ sub\\theta &amp;&amp; cos \\theta \\end{bmatrix}*\\begin{bmatrix} x \\ y \\end{bmatrix}$$ 平移可以表示为 平移 $$\\begin{bmatrix} x’ \\ y’ \\end{bmatrix}= \\begin{bmatrix} x \\ y \\end{bmatrix} + \\begin{bmatrix} t_x \\ t_y \\end{bmatrix}$$ 整理起来 $$\\begin{bmatrix} x’ \\ y’ \\end{bmatrix} = \\begin{bmatrix} cos\\theta &amp;&amp; -sin\\theta\\ sub\\theta &amp;&amp; cos \\theta \\end{bmatrix}*\\begin{bmatrix} x \\ y \\end{bmatrix}+\\begin{bmatrix} t_x \\ t_y \\end{bmatrix}$$ $$v’ = \\begin{bmatrix} R &amp;&amp; t\\ 0 &amp;&amp; 1 \\end{bmatrix}*v$$ 为了再继续统一成一个整体的变换，我们使用齐次的表达式 $$X_{camera}=\\begin{bmatrix} x_c \\ y_c \\ z_c \\end{bmatrix} , X_{world}=\\begin{bmatrix} x_w \\ y_w\\ z_w \\end{bmatrix}$$ $$\\begin{bmatrix} X_{world} \\ 1 \\end{bmatrix} = \\begin{bmatrix} R^T &amp;&amp; -R^T t \\ 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} X_{camera} \\ 1 \\end{bmatrix}$$ 世界坐标系到相机坐标系理解了坐标系内的变换，我们便可以使用数学工具来描述世界坐标系下的物体，在相机坐标系下的位置，本质就是一个坐标系的变换。 $$X_{camera}=\\begin{bmatrix} x_c \\ y_c \\ z_c \\end{bmatrix} , X_{world}=\\begin{bmatrix} x_w \\ y_w\\ z_w \\end{bmatrix} $$ $$X_{camera} = RX_{world}+t$$ $$\\begin{bmatrix} X_{camera} \\ 1 \\end{bmatrix} = \\begin{bmatrix} R &amp;&amp; t \\ 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} X_{world} \\ 1 \\end{bmatrix}$$ 而旋转矩阵是正交矩阵，矩阵的逆等于矩阵的转置，上述逆变换可以表示为 $$X_{world} = R^T X_{camera}- R^T t$$ $$\\begin{bmatrix} X_{world} \\ 1 \\end{bmatrix} = \\begin{bmatrix} R^T &amp;&amp; -R^T t \\ 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} X_{camera} \\ 1 \\end{bmatrix}$$ 根据坐标系的转换关系，也可以直接得到相机中心在世界坐标系中的位置 $$O_{cam}^{world} = R^TO_{cam}^{camera}-R^Tt = -R^Tt$$ 针孔相机成像模型初中物理中我们便学过的针孔相机模型可以近似为小孔成像模型，而我们日程生活中接触到的相机大部分是按照针孔相机模型来设计的，镜头组实现针孔的作用，让光照射到了 CMOS 上，汇聚了更多光的同时，也由于工艺的原因带来了畸变。在不考虑畸变或者恢复畸变的前提下，我们可以用下述小孔成像模型来模拟拍摄物体，镜头，CMOS 上的像的关系。 物体在 A 点，Z 为物距，BP’ 为像平面，X 为水平方向上的距离，Y 为竖直方向上的距离，该图为水平方向截面图，并将符号皆表示为正。 $$\\frac{Z}{f} = \\frac{X}{X’} = \\frac{Y}{Y’}$$ $$X’ =f \\frac{X}{Z}, Y’ =f \\frac{Y}{Z}$$ 但其实我们可以直接构造出一个虚拟的归一化像平面，与物理像平面平行（距离相机光心距离为 f ），距离相机光心距离为 1。 因为最后生成的图片（像素平面）受制于成像元件大小不一而不同，物理像平面的比例又和焦距有关。我们使用归一化像平面，这只与物体的相机坐标有关，然后根据焦距可以恢复为物理像平面，再根据成像元件的像素恢复成图像。 $$\\frac{Z}{1} = \\frac{X}{x} = \\frac{Y}{y}$$ $$\\begin{bmatrix} x \\ y \\1 \\end{bmatrix} =\\frac{1}{z_c} \\begin{bmatrix} x_c \\ y_c \\ z_c \\end{bmatrix} $$ X’,Y’可表示物理像平面上点(X’,Y’)，X,Y 为相机坐标系下物体的点 $(x_c, y_c)$ ，那么我们可以表示为 $$\\begin{bmatrix} X’ \\ Y’ \\end{bmatrix} = \\begin{bmatrix} f\\frac{x_c}{z_c} \\ f \\frac{y_c}{z_c} \\end{bmatrix} = \\begin{bmatrix} f x \\ f y \\end{bmatrix} $$ 而像素平面上的点其像素坐标 (u,v)，它的坐标原点在图像的左上角，而上述的物理像平面是中心为原点，所以我们需要移动坐标原点： $$\\begin{bmatrix} u \\ v \\end{bmatrix} = \\begin{bmatrix} \\frac{X’}{dx} + c_x\\ \\frac{Y’}{dy}+c_y \\end{bmatrix} $$ dx, dy 分别为图像上每一个像素点在 u 轴、v 轴方向上的物理尺寸（单位为米每像素），通常普通相机的 dx，dy 是相等的，即传感器的一个像素是长宽相等的。 cx,cy 分别为图像物理坐标系原点 O′ 在图像像素坐标系下 u 轴、v 轴的坐标（单位为像素） ，通常为图片像素长宽的的一半。 最后整理可得 $$\\begin{bmatrix} u \\ v \\end{bmatrix} = \\begin{bmatrix} \\frac{f}{dx}\\frac{X}{Z} + c_x\\ \\frac{f}{dy} \\frac{Y}{Z}+c_y \\end{bmatrix} = \\begin{bmatrix} f_x \\frac{X}{Z} + c_x\\ f_y \\frac{Y}{Z}+c_y \\end{bmatrix} $$ 通常 fx = fy 我们再写成齐次的形式 $$ \\begin{bmatrix} u \\ v \\ 1 \\end{bmatrix} = \\frac{1}{Z_c} \\begin{bmatrix} f_x &amp;&amp; 0 &amp;&amp; c_x\\ 0 &amp;&amp; f_y &amp;&amp; c_y\\ 0 &amp;&amp; 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} I_{33} | 0_{31} \\end{bmatrix} \\begin{bmatrix} X_c\\ Y_c\\ Z_c\\ 1 \\end{bmatrix} \\ = \\frac{1}{Z_c} \\begin{bmatrix} f_x &amp;&amp; 0 &amp;&amp; c_x\\ 0 &amp;&amp; f_y &amp;&amp; c_y\\ 0 &amp;&amp; 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} I_{33} | 0_{31} \\end{bmatrix} \\begin{bmatrix} R &amp;&amp; t \\ 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} X_w\\ Y_w\\ Z_w\\ 1 \\end{bmatrix} \\ = \\frac{1}{Z_c} K \\begin{bmatrix} I_{33} | 0_{31} \\end{bmatrix} \\begin{bmatrix} R &amp;&amp; t \\ 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} X_w\\ Y_w\\ Z_w\\ 1 \\end{bmatrix} $$ 在上述公式中，我们可以把 transformation 矩阵（Rt）前的矩阵视为相机的内参，transformation 矩阵为相机的外参（它在世界坐标系下的位置）。 所以我们通过将 世界坐标 -&gt; 相机坐标 -&gt;归一化像平面-&gt;物理像平面-&gt;像素平面 完成了把世界坐标中的 3D 点投影到图片像素坐标的 2D 点。 鱼眼相机成像模型上述我们讲完了针孔相机的成像模型，但世界上还存在着其他类型的相机，比如鱼眼相机，由十几个不同的透镜组合成一个鱼眼镜头组，前面的镜头通过折射扩大了相机的视野范围，后面的镜头组是为了像针孔相机一样，景深内的物体能够像小孔成像一样清晰地成像。 我们再来看一看相机坐标系下的物体在鱼眼相机中是怎么成像的。 鱼眼相机的投影模型为了将尽可能大的场景投影到有限的图像平面内，允许了相机畸变的存在。我们可以把鱼眼相机简化成一个利用球面透镜发生折射的模型（相比于针孔相机是小孔成像，其中符合相似三角形关系）。 而由于折射率设计的不同，我们简单介绍几种常见的投影模型。投影模型主要讲解了相机坐标系下的点是如何投影到球面透镜上，然后在图像平面成像的。 等距投影模型 $$r_d =f \\theta$$ 而 OpenCV 中最常用到的投影模型即是等距模型发展出来的，对相机进行畸变标定，而鱼眼相机可以视为只有径向基本，找到标定系数使得 $$\\theta_d = k_0 \\theta + k_1 \\theta ^3 + k_2 \\theta ^5 +k_3 \\theta ^7+ k_4 \\theta ^9$$ $$r =tan(\\theta_d)$$ 等立体角投影模型 $$r_d =2f sin(\\frac{\\theta}{2})$$ 正交投影模型 $$r_d =f sin(\\theta)$$ 体视投影模型 $$r_d =2ftan(\\frac{ \\theta}{2})$$ 我们可以用下图来横向比较不同投影模型直接的关系 而鱼眼相机的整个成像模型可以表示为 世界坐标系 -&gt; 相机坐标系 -&gt; 归一化平面坐标系 -&gt; 物理像平面 -&gt; 像素坐标系 相机坐标系 -&gt; 归一化平面坐标系 $$\\begin{bmatrix} x_c \\ y_c \\end{bmatrix} =\\frac{1}{Z_c} \\begin{bmatrix} X_c \\ Y_c \\end{bmatrix} $$ 归一化平面坐标系 -&gt; 物理相平面 $$\\begin{bmatrix} X’ \\ Y’ \\end{bmatrix} = \\begin{bmatrix} rcos\\phi \\rsin\\phi \\end{bmatrix} $$ $$\\phi = arctan(Y’/X’)$$ $$r^2 = X’^2 +Y’^2 $$ $r,f,\\theta$ 满足上述之一的投影关系 $$r = t(\\theta, f)$$ 在 OpenCV 中， $\\theta$ 和 r 满足： $$r = tan(k_0 \\theta + k_1 \\theta ^3 + k_2 \\theta ^5 +k_3 \\theta ^7+ k_4 \\theta ^9)$$ $$\\begin{bmatrix} u \\ v \\end{bmatrix} = \\begin{bmatrix} f_x \\frac{\\theta_d}{r} x_c + c_x \\ f_y \\frac{\\theta_d}{r} x_y +c_y \\end{bmatrix} $$ 写成齐次式可得 $$\\begin{bmatrix} u \\ v \\ 1 \\end{bmatrix} = \\frac{1}{Z_c} \\begin{bmatrix} f_x \\frac{\\theta_d}{r} &amp;&amp; 0 &amp;&amp; c_x\\ 0 &amp;&amp; f_y \\frac{\\theta_d}{r} &amp;&amp; c_y\\ 0 &amp;&amp; 0 &amp;&amp; 1 \\end{bmatrix} \\begin{bmatrix} I_{33} | 0_{31} \\end{bmatrix} \\begin{bmatrix} X_c\\ Y_c\\ Z_c\\ 1 \\end{bmatrix} $$ 全景相机成像模型全景相机的成像模型就十分复杂了，这里我们只做简单的介绍镜头成像光路。 鱼眼型 靠多个透镜实现鱼眼 靠反射实现鱼眼 多路相机拼接 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（五）——相机成像元件：CMOS/CCD","date":"2020-05-12T15:35:00.000Z","path":"2020/05/12/keyboard-photography-5/","text":"上一篇文章 键盘摄影（四）——相机成像元件：胶片与彩色暗房，我们从原理上讲解了胶片时代的黑白胶片/彩色负片/彩色反转片是怎么通过拍摄，冲洗，放大，扫描成为一张纸质照片的，随着科技的进步，柯达公司自己人是第一个使用数码时代的图像传感器进行成像，却不料革了自己的命。 我们也迈进了数码时代一起来了解一下数码时代的图像传感器，它将通过镜头组的光学影像转换成电子信号，再经过模数转换器（ADC）转换为数字图像信号，送到图像信号处理器（ISP）进行处理，便可以通过应用处理器（AP）连接的显示设备查看图像。 外置 ISP 架构 ISP 的过程后续会再单独开坑（![键盘摄影（七）——深入理解图像信号处理器 ISP](https://zhuanlan.zhihu.com/p/139432684），我们首先来了解一下靠 PD 光电二极管进行感光的图像传感器，它分为 CMOS/CCD 两种工艺，主要差异在像素单元和传感器周边电路上。 CCDCharge-coupled Device，电荷耦合器件，它的工作方式是通过镜头的光线使得每一个光电二极管的电容积累一定的电荷，而电荷的数量则正比于该处的入射光强。结束曝光后，周边的控制电路会将 CCD 每一列中的每个电容把自己的电荷传给相邻的下一个像素的电容，最后经过传感器末端的一个电荷放大器，转化为电压信号。 CCD 结构 CMOSCMOS，Complementary Metal-Oxide-Semiconductor，互补式金属氧化物半导体，每个像素的光电二极管都会连接一个放大器和 ADC 电路，读出该像素的值。 CMOS 结构 因为电路结构上的差异，我们可以看出以下不同： 成本： CCD 采用电荷传递的方式进行数据传送，可以想象为电流的串联，当一个像素异常，会导致一整排的像素异常，所以良品率较低。 CMOS 各个像素都集成了独立的信号放大器和 ADC，不存在上述的问题，也节省了周边电路的芯片成本和开发难度。 开口率： CCD 整个传感器的面积都可以用来接收光信号，开口率（受光率/ fill factor）接近 100% 。 CMOS 传感器的每个像素集成的信号放大器和 ADC 都需要占用一定面积，降低了开口率，灵敏度低。 快门： CCD 是全队报数，全局快门的成本很低。 CMOS 主要是按列报数，以卷帘快门为主要曝光方式，全局快门的成本较高。 噪声： CCD 所有像素产生的电荷都通过了同一个电荷电压转换器，所以转换的一致性较好；存在传感器外部电路（放大器、 ADC 等其他模块）带来的噪声； 存在 blooming（光较强时，电荷溢出并散布到附近的像素），fading （电荷以耦合移位的方式逐行输出时发生衰减）等问题。 CMOS 每个像素都搭配了一个放大器，提高了信号抗干扰能力。但各个放大器的增益和带宽很难保持一致，产生了固定模式噪声（Fixed Pattern Noise，FPN，区别于非均匀响应噪声）。 读取速度： CCD 的所有的电荷都要通过同一个电路转换并输出，读取速度较慢。CMOS 的每个光电二极管都会连接一个放大器和 ADC 电路可供读出。耗电量： CCD 为被动式采集，必须外加 12/18V 的电压驱动电荷移动，其耗电量为 CMOS 的八倍到十倍，高驱动电压还要求更精密的电源线路设计和耐压强度。CMOS 为主动式采集，光电二极管产生的电荷会直接经过独立配置的放大器，减少了外围电路的噪声干扰。 由于 CCD 的各种缺点和 CMOS 的工艺正在赶超 CCD，后续我们默认以 CMOS 传感器为例。 拜尔阵列像素传感器在感光情况下，各个像素输出不同的亮度（不同灰度值）的效果，然后我们利用拜尔阵列，即在每个传感器像素井上放置一片滤色镜，使得只有和该滤色镜颜色相同的光才能通过滤色镜，并用四个滤色镜，红绿绿蓝（RGGB）组成 2x2 的单元阵进行重复排列， 形成的马赛克彩色滤色阵列。这样我们便能得到传感器对不同颜色光的响应情况。 之所以拜尔阵列使用 RGGB 是模拟人眼成像的过程，人眼视网膜上的视锥细胞对可见光的 RGB 波段敏感。而较多绿色，是因为除了视锥细胞，还有负责在光线暗的环境下感光的视柱细胞对绿色最为敏感。 实际上色彩空间可以不只是由 RGB 来表示，比如 CYYM （青黄品红）和 RYYB（红黄蓝），优点是这些颜色在光的频谱上覆盖得更宽，允许更多光线通过传感器，但这样的阵列在 ISP 后续的去马赛克变换算法中更为复杂，在颜色插值时容易出现问题，所以没有大面积普及。 拜耳滤镜 有了对不同颜色的响应，然后通过去马赛克算法，利用周围不同颜色的像素去估计该位置的周围颜色数值应该是多少。比如绿色过滤器的像素精确测量了绿色成分，而该像素红色和蓝色的成分则是从邻区插值获取的。 关于去马赛克算法，详细可以参照另一篇文章 键盘摄影（七）——深入理解图像信号处理器 ISP - 颜色插值。 微透镜阵列当我们细究到一个传感器像素时，光电二极管表面布了很多电路，会影响光的吸收率，所以我们发明了微透镜阵列，在每个像素井上增加一个微透镜，保证更多的光传进像素井中。 微透镜阵列 前照式和背照式相比于前照式，我们发明了背照式，直接把电路布线在光电二极管背后，提高光的吸收率。 前照式和背照式的原理图 前照式和背照式的结构图 前照式 Front Side IlluminationCMOS 传感器感光区域表面的信号处理电路电路部分阻碍了微透镜的采光，因此开口率比不上 CCD。为了减少电路占用的面积，信号处理单元就做得极其简化，有些甚至只用了一个三极管来做放大器。而由于半导体工艺的特性，每个放大电路的一致性会比较差，因此形成前文提到的 CMOS 的缺点——固定模式噪声（FPN）。 背照式 Back-side Illumination传感器像素的背面整个都可以用做接受部分，所以开口率也和 CCD 传感器一样接近 100%。每个像素的信号处理电路不受面积制约，可以做成比较复杂的放大器（比如负反馈放大器）。各像素间的一致性大大改善，降低固定模式噪声。 非堆栈式和堆栈式的对比 堆栈式 Stacked Illumination堆栈式传感器是在背照式基础上的改进，将旁置的信号处理电路放到了底部支持基板上，腾出空间放置更多的像素————底大一级压死人！ Reference本文参考以下文章，侵删。 简书 - 思诺威视：CCD 与 CMOS 传感技术的原理、作用及其区别对比详解 《数码相机中的图像传感器和信号处理》—— [日]中村純一 著，徐江涛，高静，聂凯明译 知乎专栏 - 凹凸思：Camera 模组之 sensor 篇 wikipedia - 感光耦合元件 wikipedia - 拜耳滤色镜 无忌论坛 - 老派：硬货｜图像传感器大 PK：CCD 和 CMOS 谁更强 索尼官网新闻：索尼开发出背照射 CMOS 图像感光元件 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（四）——相机成像元件：胶片与彩色暗房","date":"2020-05-10T04:00:00.000Z","path":"2020/05/10/keyboard-photography-4/","text":"前面我们介绍完了相机的镜头，光圈，快门，接下来便是介绍相机的最后一个核心，成像元件。由于查找资料时发现胶片的成像比较复杂，于是将胶片单立了一篇，后续再讲解数码时代的 CMOS/CCD。 在胶片时代，摄影师想要得到一张纸质照片相比于现在电子打印的普及，是尤其的复杂，需要在胶片拍摄完一卷后，将一卷胶片在暗房中进行显影，定影，得到真正完全成像的胶片，然后再在暗房中利用光学放大机，对可以感光的相纸进行感光，然后放到自动显像机中经过显像，停止化学反应，两道水洗和一道干燥，才能得到一张纸质照片。 胶片的组成胶片基本由两部分组成，一为形成影像的感光乳剂，另一为乳剂的支撑体片基。 乳剂：主要成分为照相明胶和卤化银。卤化银以极微小的颗粒状均匀地分布在明胶之中。卤化银的存在是胶片之所以能感光的根本原因。当光线照射到这些微小的卤化银颗粒时，它就会因感光而起变化，并最终形成影像。卤化银的形状和颗粒大小在很大程度上影响着胶片的照相性能。明胶对卤化银颗粒起保护作用和支撑作用，同时它使整个乳剂层呈现为薄膜状。不同种类的胶片在乳剂层中还含有一些其他的化学成分。 片基：一种透明、柔软而具有一定韧性和强度的塑料薄膜，起着支撑乳剂的作用。由于它的存在，才使得胶片呈带状，并在从拍摄、洗印到放映的全过程中，经受得起各种机械设备的拉力和磨损。目前使用的片基有两种，一种是三醋酸纤维片基，主要用于电影胶片（负片）和照相胶卷。另一种为涤纶片基，主要用于电影胶片（正片）、X 光胶片、航空用胶片等。早期使用过的硝酸片基，因为其易燃性，已经为全世界所淘汰。 其他成分：胶片除乳剂层和片基外，一般还具有使乳剂和明胶相连接的明胶底层和摄影过程中防止静电和卷曲的涂层，在彩色胶片中还有为改善影像清晰度的防光晕层等。随着制造技术的进步，胶片质量不断提高，涂层也越来越考究。 从上到下分别为：黑白胶片，彩色反转片，彩色负片 黑白胶片黑白胶片摄影是建立在卤化银（碘化银、溴化银等，它是由卤离子和银离子化合后形成的结晶体，呈一定大小的颗粒状分布）感光原理的基础上的。胶片的最上层是一种含有明胶的卤化银涂层。 然而颗粒晶格阵列中可能出现的各种杂质、扭曲、错位和点阵缺陷等，这些部位便成了最薄弱的环节，当有光照射溴化银时，这些就成了最先被感光的地方（感光中心），溴化银分解为离子，之后接触还原剂的时候，部分银离子会在被还原为银原子并聚集在卤化银晶体表面。光线越强，溴化银分解的就越多。只要在卤化银晶体表面积累到五个银离子，就形成了稳定的潜影，足以使溴化银晶体对还原剂（显影剂）敏感，形成比感光中心大的金属银斑点（显影中心），在胶卷上留下不透明的影像， 在定影液中，金属银颗粒保持不变，而没有被曝光因此也没有被还原的溴化银颗粒则被溶解在定影液中，并经水洗后脱离了胶片，这样胶片上就只留下了经曝光和还原（显影＋定影）后的银影像。 影像的影调与原景物相反，即光照强的地方，生成的金属银多，影像的黑度就深；反之，光照弱的地方，生成的金属银就少或基本没有，影像就浅淡或基本无影像。 黑白负片的影像由稳定的金属银颗粒构成，它们不会随着时间的推移而发生变化。虽然明胶对湿度和温度比较敏感，但如果保存的好，黑白底片能保存数百年。 彩色负片彩色胶片比黑白胶片复杂，不过原理是类似的，一般是用三基色的乳剂涂层混合卤化银，在其中分别加入不同的增感剂，使三层分别对红、绿、蓝光感光，而对其他两种光不感光。同时在三层感光乳剂层中，还加入一种称作成色剂的化学物质。感红层加入青成色剂，感绿层加入品红成色剂，而感蓝层加入黄色成色剂。受光时在乳剂层中生成了两种影像，一个是由金属银构成的，另一个是由染料构成的。彩色胶片在冲洗加工时，还必须经过一道工序，叫做漂白。其作用是将金属银氧化为溴化银，使其在定影液中被溶解掉。这样就只留下染料组成的影像。 但在实际使用过程中，三种乳剂图层并不是十分理想的只吸收对应的光，也会对其他颜色有一定程度的吸收，这被称为有害吸收。于是我们发明了色罩技术应用到彩色负片中，通过产生和多余的有害染料在量上互补且颜色相同的染料，使得有害吸收成为一种恒定值的噪声，方便后续去除。正是因为主要用了黄色和品红来平衡感蓝乳剂与感绿乳剂的干扰，所以呈现了深橙色的色罩。而反转片不使用此技术的原因是反转片追求的就是色彩与真实一致的胶片，牺牲了一定程度的色彩保真还原。 并且彩色负片的保存也就要脆弱的多了，因为各色染料的不稳定，它们对环境会比较敏感。比如说青色的染料相比更容易褪色，所以彩色底片放时间长了会看起来发红。另外阳光中的紫外线还会使品红染料褪色。 彩色反转片彩色反转片的特点是拍摄后，经冲洗直接得到的就是与原景物色彩一致的画面，而不需要经过底片翻印而成。 感光后的胶片在三层感光乳剂中形成显影中心，经首次显影（黑白显影）后，溴化银颗粒还原成金属银的黑白负像，此时无染料影像。然后浸洗反转浴，对未曝光的乳剂进行灰化处理。然后进行彩色显影，使灰化过的卤化银在还原成金属银的同时生成染料，形成正的彩色影像。接下来进行漂白、定影、水洗、稳定和干燥工序处理。最后得到由染料组成且与景物色彩一致的正像。 使用反转片所用的曝光数据一定要正确，否则是无法弥补的；而使用负片，只要其曝光的数据不超过胶片的宽容度，是可以通过扩印或放大时进行色彩校正的。 不同画幅胶片135 画幅由于宽度为 35mm，所以也称为“35mm 胶卷”，135 胶卷的标准成像面积为：24 mm x 36mm。 中画幅这种胶卷分 120 和 220 两种。一般的中画幅相机都能用 120 卷，因为卷内有衬纸。220 卷则不然，只有某些机型可以使用，但因为没有衬纸，卷轴就能承载更多胶片，大约要多出两倍。 220 胶卷宽度为 61.5 mm，长度为 120 胶卷的两倍，没有背纸，只是首尾有护纸。120 胶卷宽度为 61.5mm，没有暗盒包装，但是有背纸。平时装在芯轴上并用保护纸防止漏光。使用 120 胶卷的照相机称为“120 照相机”。 大画幅胶片以 4x5 英寸(或更大)单张出现，必须搁入胶片支架。装载过程须在暗中进行。每个支架只能装两张照片。传统摄影马甲的口袋就是为这样的大画幅胶片设计。必须得有很多口袋，才有地儿放这么多胶片支架。 彩色放大机如前文所说，我们得到了显影定影后的胶片，传统需要用放大机对相纸进行感光成像，才能得到纸质照片。 彩色放大最关键的就是较色和曝光，因为放大机的光源是可以调节 CMY 成分的，而相纸会相应的呈现相反效果的颜色，这其实是一个二次拍摄的过程。具体流程强烈推荐一位我喜欢的 up 主在彩色暗房中的全流程。 传统胶片是怎么来的？ 彩色暗房放大最详细教程_哔哩哔哩 (゜-゜)つロ 干杯~-bilibili​ 扫描仪而现在很多洗胶片的店家不再是给洗出来的纸质照片，而是给电子档文件，它是对成像后的胶片利用扫描仪进行扫描，得到的电子文件再在 PhotoShop 中去色罩还原出真实颜色，去色罩的具体流程可以参考下文。 【走近色罩】——手把手教你 PS 胶片去色罩​ 胶片对我来说最吸引人的地方不只是在于它的胶片色彩，而是胶片所记录的那一刻只属于按下快门的那个瞬间，无法被修改的真实感，以及洗照片时的期待，收到喜欢的照片时的惊喜。这都是当下这个电子快门随意按，制造无数电子垃圾自己也不会回看的时代，更显得如此珍贵。当然，数码和胶片我全都要：） 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"走进自动驾驶传感器（一）——激光雷达","date":"2020-05-09T13:11:00.000Z","path":"2020/05/09/approach-autonomous-driving-sensor-lidar/","text":"写在前面： 笔者为自动驾驶创业公司的研发工程师，工作时接触较多 LiDAR，使用较多点云数据，本文为笔者收集整理的一篇关于激光雷达的科普，查阅了一些资料包括论文和传感器使用手册，结合一些个人认为激光雷达在实际应用过程中需要了解的一些基本概念和基础知识，如有问题欢迎指正，如需转载请私信联系。 欢迎关注本专栏，关注我的持续更新。（光收藏不点赞的是人么（╯‵□′）╯︵┴─┴） 激光雷达，也称光学雷达（LIght Detection And Ranging）是激光探测与测距系统的简称，它通过测定传感器发射器与目标物体之间的传播距离，分析目标物体表面的反射能量大小、反射波谱的幅度、频率和相位等信息，从而呈现出目标物精确的三维结构信息。 自上世纪 60 年代激光被发明不久，激光雷达就大规模发展起来。目前激光雷达厂商主要使用波长为 905nm 和 1550nm 的激光发射器，波长为 1550nm 的光线不容易在人眼液体中传输，这意味着采用波长为 1550nm 激光的激光雷达的功率可以相当高，而不会造成视网膜损伤。更高的功率，意味着更远的探测距离，更长的波长，意味着更容易穿透粉尘雾霾。但受制于成本原因，生产波长为 1550nm 的激光雷达，要求使用昂贵的砷化镓材料。厂商更多选择使用硅材料制造接近于可见光波长的 905nm 的激光雷达，并严格限制发射器的功率，避免造成眼睛的永久性损伤。 而测距原理上目前主要以飞行时间（time of flight）法为主，利用发射器发射的脉冲信号和接收器接受到的反射脉冲信号的时间间隔来计算和目标物体的距离。 也有使用相干法，即为调频连续波（FMCW）激光雷达发射一束连续的光束，频率随时间稳定地发生变化。由于源光束的频率在不断变化，光束传输距离的差异会导致频率的差异，将回波信号与本振信号混频并经低通滤波后，得到的差频信号是光束往返时间的函数。调频连续波激光雷达不会受到其他激光雷达或太阳光的干扰且无测距盲区；还可以利用多普勒频移测量物体的速度和距离。调频延续波 LiDAR 概念并不新颖，但是面对的技术挑战不少，例如发射激光的线宽限制、线性调频脉冲的频率范围、线性脉冲频率变化的线性度，以及单个线性调频脉冲的可复制性等。 关于 FMCW 的原理，可以阅读本系列的下一篇文章：Yvon Shong：走进自动驾驶传感器（二）——毫米波雷达 调幅连续波（AMCW）激光雷达与基本的飞行时间系统相似的是，调幅连续波激光雷达发射一个信号，测量激光反射回来的时间。但区别在于，时间飞行系统只发射一个脉冲，调幅连续波 LiDAR 通过改变激光二极管中的极电流来调整发射光强度，从而实现调制。 激光雷达应用于测绘主要有测距、定位以及地表物体的三维绘制；其达作为一种重要的传感器，目前正在自动驾驶领域和无人飞行器领域得到广泛应用。 LiDAR 的结构激光雷达主要包括激光发射、接收、扫描器、透镜天线和信号处理电路组成。激光发射部分主要有两种，一种是激光二极管，通常有硅和砷化镓两种基底材料，再有一种就是目前非常火热的垂直腔面发射（VCSEL）（比如 iPhone 上的 LiDAR），VCSEL 的优点是价格低廉，体积极小，功耗极低，缺点是有效距离比较短，需要多级放大才能达到车用的有效距离。 激光雷达主要应用了激光测距的原理，而如何制造合适的结构使得传感器能向多个方向发射激光束，如何测量激光往返的时间，这便区分出了不同的激光雷达的结构。 机械式以 Velodyne 2007 年推出了一款激光雷达为例，它把 64 个激光器垂直堆叠在一起，使整个单元每秒旋转许多次。发射系统和接收系统存在物理意义上的转动，也就是通过不断旋转发射器，将激光点变成线，并在竖直方向上排布多束激光发射器形成面，达到 3D 扫描并接收信息的目的。但由于通过复杂的机械结构实现高频准确的的转动，平均的失效时间仅 1000-3000 小时，难以达到车厂最低 13000 小时的要求。 Velodyne 64 线激光雷达结构示意图 固态式(MEMS)利用微电子机械系统的技术驱动旋镜，反射激光束指向不同方向。固态激光雷达的优点包括了：数据采集速度快，分辨率高，对于温度和振动的适应性强；通过波束控制，探测点（点云）可以任意分布，例如在高速公路主要扫描前方远处，对于侧面稀疏扫描但并不完全忽略，在十字路口加强侧面扫描。而只能匀速旋转的机械式激光雷达是无法执行这种精细操作的。 MEMS 激光雷达模组 光学相控阵式(OPA)相控阵发射器由若干发射接收单元组成阵列，通过改变加载在不同单元的电压，进而改变不同单元发射光波特性，实现对每个单元光波的独立控制，通过调节从每个相控单元辐射出的光波之间的相位关系，在设定方向上产生互相加强的干涉从而实现高强度光束，而其他方向上从各个单元射出的光波彼此相消。组成相控阵的各相控单元在程序的控制下可使一束或多束高强度光束按设计指向实现空域扫描。 相控阵激光雷达原理示意图 但光学相控阵的制造工艺难度较大，这是由于要求阵列单元尺寸必需不大于半个波长，普通目前激光雷达的任务波长均在 1 微米左右，这就意味着阵列单元的尺寸必需不大于 500 纳米。而且阵列数越多，阵列单元的尺寸越小，能量越往主瓣集中，这就对加工精度要求更高。此外，材料选择也是十分关键的要素。 泛光面阵式（FLASH）泛光面阵式是目前全固态激光雷达中最主流的技术，其原理也就是快闪，它不像 MEMS 或 OPA 的方案会去进行扫描，而是短时间直接发射出一大片覆盖探测区域的激光，再以高度灵敏的接收器，来完成对环境周围图像的绘制。 LeddarCore flash LiDAR 硬件参数我们以目前最为成熟的车载 MEMS 式激光雷达为例，讲解其关键的硬件参数。 视场角与分辨率激光雷达视场角分为水平视场角和垂直视场角，水平视场角即为在水平方向上可以观测的角度范围，旋转式激光雷达旋转一周为 360°，所以水平视场角为 360°。垂直视场角为在垂直方向上可以观测的角度，一般为 40°。而它并不是对称均匀分布的，因为我们主要是需要扫描路面上的障碍物，而不是把激光打向天空，为了良好的利用激光，因此激光光束会尽量向下偏置一定的角度。并且为了达到既检测到障碍物，同时把激光束集中到中间感兴趣的部分，来更好的检测车辆，激光雷达的光束不是垂直均匀分布的，而是中间密，两边疏。下图是禾赛 64 线激光雷达的光束示意图，可以看到激光雷达的有一定的偏置，向上的角度为 15°，向下的为 25°，并且激光光束中间密集，两边稀疏。 禾赛 64 线激光雷达光束分布 回波模式即周期采集点数，因为激光雷达在旋转扫描，因此水平方向上扫描的点数和激光雷达的扫描频率有一定的关系，扫描越快则点数会相对较少，扫描慢则点数相对较多。一般这个参数也被称为水平分辨率，比如激光雷达的水平分辨率为 0.2°，那么扫描的点数为 360°/0.2°=1800，也就是说水平方向会扫描 1800 次。次。同一轮发光测距的不同回波数据，比如同时包含最强回波和最晚回波。 点频即周期采集点数，因为激光雷达在旋转扫描，因此水平方向上扫描的点数和激光雷达的扫描频率有一定的关系，扫描越快则点数会相对较少，扫描慢则点数相对较多。一般这个参数也被称为水平分辨率，比如激光雷达的水平分辨率为 0.2°，那么扫描的点数为 360°/0.2°=1800，也就是说水平方向会扫描 1800 次。 那么激光雷达旋转一周，即一个扫描周期内扫描的点数为 1800*64=115200。比如禾赛 64 线激光雷达，扫描频率为 10Hz 的时候水平角分辨率为 0.2°，在扫描频率为 20Hz 的时候角分辨率为 0.4°（扫描快了，分辨率变低了）。输出的点数和计算的也相符合 1152000 pts/s。 有效检测距离激光雷达是一个收发异轴的光学系统（其实所有的机械雷达都是），也就是说，发射出去的激光光路，和返回的激光光路，并不重合。这主要是因为激光发射器和接收器不能做在一起导致的，此方案本身便存在小量的误差。现在很多方案，都是向着共轴努力。 激光雷达的测距精度，随着距离的变化而变化。有几个原因： 我们这里说的激光雷达，是指 TOF 激光雷达，TOF 测距，靠的是 TDC 电路提供计时，用光速乘以单向时间得到距离，但限于成本，TDC 一般由 FPGA 的进位链实现，本质上是对一个低频的晶振信号做差值，实现高频的计数。所以，测距的精度，强烈依赖于这个晶振的精度。而晶振随着时间的推移，存在累计误差； 距离越远，接收信号越弱，雷达自身的寻峰算法越难以定位到最佳接收时刻，这也造成了精度的劣化； 而由于激光雷达检测障碍物的有效距离和最小垂直分辨率有关系，也就是说角度分辨率越小，则检测的效果越好。如果两个激光光束之间的角度为 0.4°，那么当探测距离为 200m 的时候，两个激光光束之间的距离为 200m*tan0.4°≈1.4m。也就是说在 200m 之后，只能检测到高于 1.4m 的障碍物了。如果需要知道障碍物的类型，那么需要采用的点数就需要更多，距离越远，激光雷达采样的点数就越少，可以很直接的知道，距离越远，点数越少，就越难以识别准确的障碍物类型。 LiDAR 的数据三维点对于旋转式激光雷达来说，得到的三维点便是一个很好的极坐标系下的多个点的观测，包含激光发射器的垂直俯仰角，发射器的水平旋转角度，根据激光回波时间计算得到的距离。但 LiDAR 通常会输出笛卡尔坐标系下的观测值，第一是因为 LiDAR 在极坐标系下测量效率高，也只是对于旋转式 LiDAR，目前阵列式 LiDAR 也有很多。第二笛卡尔坐标系更加直观，投影和旋转平移更加简洁，求解法向量，曲率，顶点等特征计算量小，点云的索引及搜索都更加高效。 对于 MEMS 式激光雷达，由于一次采样周期为一个偏振镜旋转周期，10hz 下采样周期为 0.1 秒，但由于载体本身在进行高速移动时，我们需要对得到的数据进行消除运动畸变，来补偿采样周期内的运动。 反射强度LiDAR 返回的每个数据中，除了根据速度和时间计算出的反射强度其实是指激光点回波功率和发射功率的比值。而激光的反射强度根据现有的光学模型，可以较好的刻画为以下模型。 $$P_R=\\frac{P_E D_R^2 \\rho\\ cos\\ \\alpha}{4R^2}\\eta_{Sys}\\eta_{Atm}$$ $$回波功率 = \\frac{发射功率接受机孔径^2物体表面反射率cos 入射角}{4距离^2}系统传输率大气传输率$$ 我们可以看到，激光点的反射率和距离的平方成反比，和物体的入射角成反比。入射角是入射光线与物体表面法线的夹角。 时间戳和编码信息LiDAR 通常从硬件层面支持授时，即有硬件 trigger 触发 LiDAR 数据，并支持给这一帧数据打上时间戳。通常会提供支持三种时间同步接口， IEEE 15882008 同步，遵循精确时间协议，通过以太网对测量以及系统控制实现精确的时钟同步。 脉冲同步（PPS），脉冲同步通过同步信号线实现数据同步。 GPS 同步（PPS+UTC），通过同步信号线和 UTC 时间（GPS 时间）实现数据同步。 然后我们从 LiDAR 硬件得到一串数据包，需要过一次驱动才能将其解析成点云通用的格式，如 ROSMSG 或者 pcl 点云格式，以目前最普遍的旋转式激光雷达的数据为例，其数据为 10hz，即 LiDAR 在 0.1s 时间内转一圈，并将硬件得到的数据按照不同角度切成不同的 packet，以下便是一个 packet 数据包定义示意图。 一帧 LiDAR 数据包定义示意图 而每一个 packet 包含了当前扇区所有点的数据，包含每个点的时间戳，每个点的 xyz 数据，每个点的发射强度，每个点来自的激光发射机的 id 等信息。 而如最新的 Livox Horizon 激光雷达，也包含了多回波信息及噪点信息，格式如下： LiDAR 数据包多回波信息定义示意图 每个标记信息由 1 字节组成：该字节中 bit7 和 bit6 为第一组，bit5 和 bit4 为第二组，bit3 和 bit2 为第三组，bit1 和 bit0 为第四组。 第二组表示的是该采样点的回波次序。由于 Livox Horizon 采用同轴光路，即使外部无被测物体，其内部的光学系统也会产生一个回波，该回波记为第 0 个回波。随后，若激光出射方向存在可被探测的物体，则最先返回系统的激光回波记为第 1 个回波，随后为第 2 个回波，以此类推。如果被探测物体距离过近（例如 1.5m），第 1 个回波将会融合到第 0 个回波里,该回波记为第 0 个回波。 第三组基于回波能量强度判断采样点是否为噪点。通常情况下，激光光束受到类似灰尘、雨雾、雪等干扰产生的噪点的回波能量很小。目前按照回波能量强度大小将噪点置信度分为二档：01 表示回波能量很弱：这类采样点有较高概率为噪点，例如灰尘点；10 表示回波能量中等，该类采样点有中等概率为噪点，例如雨雾噪点。噪点置信度越低，说明该点是噪点的可能性越低。 第四组基于采样点的空间位置判断是否为噪点。例如：激光探测测距仅在测量前后两个距离十分相近的物体时，两个物体之间可能会产生拉丝状的噪点。目前按照不同的噪点置信度分为三档，噪点置信度越低，说明该点是噪点的可能性越低。 LiDAR 的作用感知我们可以根据 LiDAR 能描绘出稀疏的三维世界的特点，而扫描得到的障碍物点云通常又比背景更密集，通过分类聚类的方法可以利用其进行感知障碍物。而随着深度学习带来的检测和分割技术上的突破，LiDAR 已经能做到高效的检测行人和车辆，输出检测框，即 3D bounding box，或者对点云中的每一个点输出 label，更有甚者在尝试使用 LiDAR 检测地面上的车道线。 感知 perception 在三维目标识别的对象方面，最初研究主要针对立方体、柱体、锥体以及二次曲面等简单形体构成的三维目标。然而，这类形体对现实世界的表达能力有限，绝大部分目标难以用这些形体或其组合来近似。后续研究主要集中于三维自由形态目标的识别，所谓自由形态目标，即表面除了顶点、边缘以及尖拐处之外处处都有良好定义的连续法向量的目标（如飞行器、汽车、轮船、建筑物、雕塑、地表等）。由于现实世界中的大部分物体均可认为是自由形态目标，因此三维自由形态目标识别算法的研究大大扩展了识别系统的适用范围。在过去二十余年间，三维目标识别任务针对的数据量不断增加，识别难度不断上升，而识别率亦不断提高。然而，如何在包含遮挡、背景干扰、噪声、逸出点以及数据分辨率变化等的复杂场景中实现对感兴趣目标的检测识别与分割，仍然是一个富有挑战性的问题。 配准在三维模型重建方面，最初的研究集中于邻接关系和初始姿态均已知时的点云精配准、点云融合以及三维表面重建。在此，邻接关系用以指明哪些点云与给定的某幅点云之间具有一定的重叠区域，该关系通常通过记录每幅点云的扫描顺序得到。而初始姿态则依赖于转台标定、物体表面标记点或者人工选取对应点等方式实现。这类算法需要较多的人工干预，因而自动化程度不高。接着，研究人员转向点云邻接关系已知但初始姿态未知情况下的三维模型重建，常见方法有基于关键点匹配、基于线匹配、以及基于面匹配 等三类算法。在实际应用中，很多时候并不知道点云之间的邻接关系。针对此，研究人员开发了最小张树算法和连接图算法以实现邻接关系的计算。总体而言，三维模型重建算法的发展趋势是自动化程度越来越高，所需人工干预越来越少，且应用面越来越广。然而，现有算法依然存在运算复杂度较高、只能针对单个物体、且对背景干扰敏感等问题。研究具有较低运算复杂度且不依赖于先验知识的全自动三维模型重建算法，是目前的主要难点。 给定两个来自不同坐标系的三维数据点集，找到两个点集空间的变换关系，使得两个点集能统一到同一坐标系统中，这个过程便称为配准。配准的目标是在全局坐标框架中找到单独获取的视图的相对位置和方向，使得它们之间的相交区域完全重叠。对于从不同视图（views）获取的每一组点云数据，点云数据很有可能是完全不相同的，需要一个能够将它们对齐在一起的单一点云模型，从而可以应用后续处理步骤，如分割和进行模型重建。目前对配准过程最常见的主要是 ICP 及其变种算法，NDT 算法，和基于特征提取的匹配。 配准 registration ICP 算法最早由 Chen and Medioni，and Besl and McKay 提出。其算法本质上是基于最小二乘法的最优配准方法。该算法重复进行选择对应关系点对，计算最优刚体变换这一过程，直到根据点对的欧氏距离定义的损失函数满足正确配准的收敛精度要求。ICP 是一个广泛使用的配准算法，主要目的就是找到旋转和平移参数，将两个不同坐标系下的点云，以其中一个点云坐标系为全局坐标系，另一个点云经过旋转和平移后两组点云重合部分完全重叠。 NDT 算法的基本思想是先根据参考数据（reference scan）来构建多维变量的正态分布，如果变换参数能使得两幅激光数据匹配的很好，那么变换点在参考系中的概率密度将会很大。然后利用优化的方法求出使得概率密度之和最大的变换参数，此时两幅激光点云数据将匹配的最好。由此得到位资变换关系。 局部特征提取通常包括关键点检测和局部特征描述两个步骤，其构成了三维模型重建与目标识别的基础和关键。在二维图像领域，基于局部特征的算法已在过去十多年间取得了大量成果并在图像检索、目标识别、全景拼接、无人系统导航、图像数据挖掘等领域得到了成功应用。类似的，点云局部特征提取在近年来亦取得了部分进展 而当三维点较为稠密的时候，可以像视觉一样提取特征点和其周围的描述子，主要通过选择几何属性（如法线和曲率）比较有区分度的点，在计算其局部邻域的几何属性的统计得到关键点的描述子，而当处理目前市面上的激光雷达得到的单帧点云数据时，由于点云较为稀疏，主要依靠每个激光器在扫描时得到的环线根据曲率得到特征点。 里程计和定位而有了两帧点云的数据根据配准得到了相对位姿变换关系后，我们便可以利用激光雷达传感器获得的数据来估计载体物体位姿随时间的变化而改变的关系。比如我们可以利用当前帧和上一帧数据进行匹配，或者当前帧和累计堆叠出来的子地图进行匹配，得到位姿变换关系，从而实现里程计的作用。 odometer and localization 而当我们用当前帧和整个点云地图进行匹配的时候，我们便能得到传感器在整个地图中的位姿，从而实现在地图中的定位。 LiDAR 的趋势传感器车规化固态激光雷达取消了机械结构，能够击中目前机械旋转式的成本和可靠性的痛点，是激光雷达的发展方向。除了这两大迫切解决的痛点外，目前量产的激光雷达探测距离不足，仅能满足低速场景（如厂区内、校园内等）的应用。日常驾驶、高速驾驶的场景仍在测试过程中。 当前机械式激光雷达的价格十分昂贵，Velodyne 在售的 64/32/16 线产品的官方定价分别为 8 万/4 万/8 千美元。一方面，机械式激光雷达由发射光源、转镜、接收器、微控马达等精密零部件构成，制造难度大、物料成本较高；另一方面，激光雷达仍未大规模进入量产车、需求量小，研发费用等固定成本难以摊薄。 量产 100 万台 VLP-32 后，那么其售价将会降至 400 美元左右。 2021 年上海车展热门车型激光雷达配置 多传感器融合在环境监测传感器中，超声波雷达主要用于倒车雷达以及自动泊车中的近距离障碍监测，摄像头、毫米波雷达和激光雷达则广泛应用于各项 ADAS 功能中。四类传感器的探测距离、分辨率、角分辨率等探测参数各异，对应于物体探测能力、识别分类能力、三维建模、抗恶劣天气等特性优劣势分明。各种传感器能形成良好的优势互补，融合传感器的方案已成为主流的选择。 欢迎在我的专栏「自律走行」中查看更多「走进自动驾驶传感器」系列文章 走进自动驾驶传感器（一）——激光雷达 走进自动驾驶传感器（二）——毫米波雷达 走进自动驾驶传感器（三）——卫星导航系统","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"lidar","slug":"lidar","permalink":"http://www.yvonshong.com/tags/lidar/"}]},{"title":"键盘摄影（三）——等效焦距和等效光圈","date":"2020-05-09T04:00:00.000Z","path":"2020/05/09/keyboard-photography-3/","text":"相机传感器的尺寸会影响接收到的光学图像的画幅，不只是镜头，传感器尺寸也会影响相机的视野。如果我们在光学系统中保持其他不变，只改变机身使用不同画幅的传感器，我们就会看到原来大尺寸传感器的图片仿佛被裁切了一样，于是我们引入了剪切系数，来衡量画幅的不同对成像的影响，并介绍等效焦距和等效光圈这样的数学工具来方便我们比较画幅不同时的焦距和光圈的成像效果。 等效焦距所谓等效焦距，是指由于画幅的变化，相机视野的变化而导致焦距的变化。如 4/3 画幅，由于其 CMOS 面积几乎为全画幅的 1/4 ，因此，其可取拍摄面积只是全画幅的1/4。 就相当于焦距为 x 的残幅相机所看到的景色，相当于全幅相机使用 2x 焦距看到的更远更小的景色，也可以理解为全幅的景色直接裁切。 全画幅的概念是直接从胶片时代继承过来的，我们称传感器面积与 35mm 底片相同的相机为全画幅相机。所以焦距为 x 的残幅相机，我们称呼它的 35mm 等效焦距为 2x。 为了计算的方便，我们直接将 35mm 等效焦距记为实际焦距乘以焦距转换率（裁切系数）。典型的裁切系数有尼康、索尼 APS-C 格式是 1.5 ，佳能的 APS-C 格式是 1.6 倍， M4/3 格式是 2 。 剪切系数 等效焦距的本质是视角等效，但为什么我们要讲等效焦距，而不是等效视角，虽然后者似乎看起来似乎给人带来更直观的认知，但是没有办法，没人能口算 arctan/tan 三角函数。。。等效焦距的提出，为三角函数（正切和反正切）对于一般人来说不容易快速计算这个问题提供了简单的数学工具。 $fov=2*arctan(\\frac{W}{2f})$ 等效光圈等效光圈也是同理，当然不是说镜头的光圈值真的改变了，而是在画幅不同的情况下，我们能直接根据各自的等效光圈值来进行比较景深、弱光性能以及同结构下的分辨率等效果。 实际景深其实与焦距、画幅、光圈 F 值都无关，可以认为只取决于光圈的实际口径和对焦距离。 等效光圈决定景深，等效焦距除以等效光圈决定远景虚化能力。 景深的等效理论上来说，只有位于某一特定平面的点光源（点 A）所发散出的光线才可以被镜头在底片上重新还原为一个点（A’）。偏离点A所在平面的点光源（B）将汇聚在另一平面上（B’），导致其在底片上形成一个光斑，也就是所谓的弥散圆（直径为 $\\delta$ ）。 B 点离 A 点越远，则弥散圈越大，大到一定程度后 B 点便被虚化。A 点前后能清晰成像（弥散圆直径小于一定值）的范围被称为景深。 根据相似三角形可知 $\\frac{v_a-v_b}{\\delta}=\\frac{v_b}{D}$ 而光圈 F 的定义实质为焦距和孔径的比值（因为成像亮度不是跟光圈孔径有关，而是与焦距/光圈孔径有关） $F= \\frac{f}{D}$ 而根据高斯公式 $\\frac{1}{u} + \\frac{1}{v} = \\frac{1}{f}$ ，此 f 为真实焦距，而非等效焦距。将 $\\delta$ 表示出来，用 u 和 f 来消去 v ，即可表达为 $\\delta =\\frac{(u_b - u_a) f^2}{(u_a-f)u_b F}$ 而 $u_a \\gg f$ （非微距场景都成立） $f_x = f_1/x$ 用有大小不同的两块底，大底的边长是小底的 x 倍， $f_1$ 为标式真实焦距，其等效焦距为 $f_x = f_1/x$ （所以 x 是底的幅面系数，1/x 是裁切系数） 而使用了不同的画幅，因为不同幅面感光元件，其容许弥散圆的大小是不一样的，也就是说同样大小的弥散圆，在大底相机上可能不算什么，但是在小底上简直就虚的一塌糊涂。所以我们得比较弥散圆直径相比传感器的相对大小为虚化程度： $\\Delta \\delta = \\frac{\\delta}{x} = \\frac{(u_b - u_a) f^2}{u_a u_b F x} = \\frac{(u_b - u_a) x^2 f_x^2}{u_a u_b F x} = \\frac{(u_b - u_a) f_x^2 }{u_a u_b F } x$ 所以小底相机在使用同样的光圈 F 值的情况下，其实际虚化程度只有大底相机的 1/x。为了补偿这一差距，达到相同的虚化程度，小底相机需要将光圈孔径开大 x 倍。 所以小底相机此时光圈值为 F 时的虚化效果，等效为大底相机光圈值为 xF 时的虚化效果，这就是等效光圈。 根据公式我们可以看出： 当物距固定，使用相同的底，即底的幅面 x 固定，和同样标示焦距f1的镜头，那么光圈越大，F 数字越小，虚化程度越大。 当使用相同的底，即底的幅面 x 固定，光圈 F 固定，那么物距（对焦距离）$u_a$ 越小，函数关于 $u_a$ 单调，虚化程度越大。 当使用相同的底，即底的幅面 x 固定，光圈 F 固定，物距 $u_a$ 固定，则焦距 $f_x$ 越长，虚化程度越大。 当物距 $u_a$ 固定，等效焦距 $f_x$ 固定，光圈数 F 固定，则底的幅面 x 越大，虚化程度越大。 除了景深的等效，等效光圈还引出了其他的概念，如等效的暗光性能，衍射，但由于内容过于考究枯燥，笔者也未能完全理解和转述清楚，有兴趣可以参考上述链接。 Reference以上部分内容转载自兰拓空间和知乎专栏 什么是等效光圈？（Ver2.0）_兰拓空间 小P说相机：键摄者说（3）—【存档备查】【学有余力】常见键摄原理的推导证明​ 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（二）——曝光三要素","date":"2020-05-07T04:00:00.000Z","path":"2020/05/07/keyboard-photography-2/","text":"在前文 键盘摄影（一）——相机成像基本元件 中，我们提到了光圈和快门时，其实就已经出现了很多倍数关系带来的曝光量的变化，而摄影其实包含光的学问，今天我们要介绍的便是影响曝光的三要素。 ISO除了光圈（曝光孔径大小），快门（曝光时间），还有一个是成像元件的感光度，ISO为感光度的国际标准，在摄影中我们便用 ISO 指代感光度。为了介绍 ISO，我们完全可以先来熟悉下光学中的相关物理概念。 胶片的 ISO感光度ISO代表感光速度的标准，代表胶卷使用的颗粒，CCD或者CMOS感光元件的感光速度，数值越高就说明该感光材料的感光能力越强。从公式我们可以看出，感光度越高，对曝光量，光的积分通量的要求就越少。 通俗一点就是衡量胶卷需要多少光线才能完成准确曝光的数值。胶卷上标的100、200、400，数字表示的就是感光度。数值增大，胶卷对光线的敏感程度也越大，ISO 200的胶卷的感光速度是ISO 100的两倍，换句话说在其他条件相同的情况下，ISO 200胶卷所需要的曝光时间是ISO 100胶卷的一半。而使用高ISO的颗粒噪声带来的噪点也相对的大。 数码的 ISO数码相机的感光器件是使用了CCD或者CMOS，对曝光多少也有相应要求，也就有感光灵敏度高低的问题。 而数码相机的本质其实是一个光电反应，光电反应本身具有逸出功（最小激活能量），光通过镜头打在CMOS/CCD传感器上，ISO描述了最小需要多少的曝光量，才能使得该传感器颗粒被激活，然后通过AD转换，把光电反应的模拟信号转换成数字信号成像。 这也就相当于胶片具有一定的感光度一样，数码相机厂家为了方便数码相机使用者理解，一般将数码相机的CCD/CMOS的感光度（或对光线的灵敏度）等效转换为传统胶卷的感光度值，因而数字照相机也就有了感光度的说法。胶片相机只能通关替换不同颗粒材质的胶片来改变ISO，而数码相机的感光元件是不变的，而数码相机是如何实现调节ISO的呢？ 数码相机的ISO本质上就是模拟信号的增益，如今的数码相机普遍采用了电子信号放大增益技术，与ISO数值相对应的是模拟信号放大增益值，比如设定在标准值时（无增益）提供等同ISO100（原生ISO）的增益幅度。数码相机的感光元件属于主动元件，存在暗电流，普通模式下设置了截止电流，并不会使用到存在噪声干扰的部分，当环境光线黯淡时，CCD/CMOS的输出电平较低，使用高感光度模式，放大器也按相应的ISO数值加大增益幅度，噪声也相应放大，而传感器在工作中一定受到不同程度的周边电路和本身像素间的光电磁干扰，这些背景噪声和干扰反映到图像上就是随机的杂点。 个别厂商提供了另一种解决方案，即对两个像素的感光信号进行叠加，便可获得原来两倍的感光度。但这种工作方式也有其缺陷，只适合较小的影像模式，因为像素数在处理中减半了。在获得高ISO的同时与成像相关的像素数也会成倍缩减，为了保证成像尺寸原本的影像信息会被扩大，噪点就这样产生了。 还有另一种高ISO数值的解决方案是合并像素后感光，采用把数个像素点当成1个像素点来进行感光的方式，多个像素点有更多曝光量，从而提高感光速度。该工作方式对高像素机型较有优势，但噪点的产生比前两种来的更为明显。因为减少了感光像素，所以在白平衡过程中只有进行像素插值才能得到完整的影像。 虽然高ISO在噪点方面还是令我们有这样那样的担忧，但为了获得更高的快门速度和更明亮的画面，这也算是一种不增加成本的折中解决方法。低ISO值适合营造清晰、柔和的图片，而高的ISO值却可以补偿灯光不足的环境。 曝光三要素而相机的传感器是怎么互相影响曝光和成像的呢？这就是摄影中最重要的曝光三要素。 光圈，快门，ISO。 光圈与快门对曝光的控制光圈和快门是调整和控制曝光量的装置，它们是倍增或是倍减的关系，这种关系可以通过不同的组合来得到相同的曝光量。例如说，光圈F8、1/30秒为正确曝光值时，如果用光圈f5.6、1/60秒，或是f11、1/15秒来组合，它们所得到的曝光量也是一样的。而ISO也是呈倍数关系，来控制曝光量。这样，摄影师可以根据自己的目的来选择光圈，快门速度和 ISO。 虽然他们都能控制曝光量，但是各自有不同的特点。 光圈越大，进光口径越大，进光量越多，景深越小。 快门越慢，进光时间越长，进光量越多，运动的景物越容易糊； 感光度越高，对光线的感应能力越强（对信号的放大程度越高），噪点越多。 了解了曝光三要素，我们便可以开始键盘摄影了（大雾）： camerasim.com​ 这是一个 camera sim 网页，可以在上面调节光圈，iso，快门，物距，焦距，白平衡等。 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"键盘摄影（一）——相机成像基本元件","date":"2020-05-06T04:00:00.000Z","path":"2020/05/06/keyboard-photography-1/","text":"笔者在就读本科期间，开始接触计算机视觉领域，主要包括传统的图像处理，研究生期间开始了解深度学习，三维重建和SLAM（同时定位和建图）。可是对于其中使用到的最重要的传感器，相机，它的成像原理知之甚少，照片是怎么成像的？有幸在工作之余玩起了胶片相机，学习了一些摄影知识，在此和大家分享相关知识，欢迎友好地指正和勘误，轻喷。 随着器件的发展，目前的相机类型丰富，我们可以从基本的元件讲起，主要涉及到胶片相机和以单反为例的数码相机。为了便于理解，我们首先来过一遍相机的组成结构，后续会针对性进行讲解。 按下快门按钮前的状态 按下快门按钮后的状态 上图是单反相机的结构示意图，包含镜头组组成的镜头，45 度角倾斜放置的反光板，能获得正像且放缩到取景器大小的五棱镜，焦平面快门，和成像元件。 按下快门按钮前，光线通过镜头组和反光板（单反即意味着单个反光板），垂直入射到五棱镜的一面，然后由于五棱镜的特殊结构，光线再次垂直射出五棱镜的另一面，通过取景器到达人眼。 按下快门按钮后，反光板抬起，焦平面快门卷起，光线通过镜头组照射到成像元件（CMOS）而成像，这就是单反相机的一次成像过程。 我们接下来主要会介绍的是镜头、光圈和快门。 镜头高中物理时大家都曾学过，我们通过不同的凹凸透镜的组合，距离的调整，可以得到不同的镜头组。使用镜头组便实现了把特定的光线传递到成像元件面前。 镜头类型相机的镜头根据焦距是否可变，分为变焦镜头和定焦镜头。 光学变焦镜头的变焦原理是，变动镜头之间的距离改变镜头组的焦距，从而得到不同宽窄的视场角和不同大小的焦距。 数码变焦的原理是直接对图片进行缩放，然后像素间进行插值。 相机的镜头根据焦段，可以分为长焦镜头，标准镜头，广角镜头。它们之间没有明显的划分，只需要了解大概范围即可。 不同焦段对应的视场角 长焦镜头 Tele Lens：长焦镜头的焦距比较长，要比底片的对角线大得多，可以把远处的景物拍得较大而得此名。目前常见的焦距有135mm、150mm、200mm 、250mm 、300mm、500mm、1000mm 等多种。可分为中长焦镜头（150mm以内，视角在20°左右）、长焦镜头（150mm到300mm之间，视角在10°左右）、超长焦镜头（300mm以上，视角在8°以内）三种。 标准镜头：标准镜头的视角从40°到55°，常见的焦距为45mm、50mm、55mm、58mm等多种规格。 广角镜头 Wide-angle Lens：广角镜头焦距一般大于25mm，视角在90°以内；超广角镜头的焦距在1625mm之间，视角在 90°180°之间； 鱼眼镜头：当焦距更小，小于16mm，视角超过180°，则称为鱼眼镜头，目前世界上最大的鱼眼镜头，视角可达220°，这种镜头可以得到最大的视场，由于镜头的第一片透镜像鱼眼一样突出在外面，形状像金鱼眼睛而得此名。 再加上微距、移轴、折返、远心镜头，便差不多能涵盖了我们能遇到的所有镜头种类。 微距 Macro Lens：为了对距离极近的被摄物也能正确对焦，微距镜头通常被设计为能够拉伸得更长，以使光学中心尽可能远离感光元件，同时在镜片组的设计上，也必须注重于近距离下的变形与色差等的控制。大多数微距镜头的焦长都大于标准镜头，因此并非完全适用于一般的摄影。 移轴 Till-shift Lens：能通过改变镜头组相对于成像平面的光轴，来改变观察到的景物的透视关系。即成像平面中心法线不在镜头光轴上，可以是存在旋转 till（产生清晰模糊的对比），可以是存在平移 shift（能够拍到成像平面不同范围内的图） 移轴镜头 till 实物图 移轴镜头 shift 实物图 折返：这类镜头一般焦距很长，光线进来之后会经过一次或者几次反射，然后到达成像元件，这样一来镜头的长度会很小，因此做成非常超长焦距的镜头，也不会有很长的镜筒了。 折返镜头示意图 物方远心镜头 Object-space tele-centric Lens： 一般镜头在成像过程中，近大远小，不同物距的物体放大倍率不同。二、普通镜头下如果被测物体本身的深度超出了一定范围，镜头始终没办法同时看清首尾两端。三、普通的镜头受制于其光学成像的原理，测量精度最好的也只能做到10um左右。 远心镜头示意图 本质就是结合了小孔成像和镜头成像，在中间加一个光阑的作用就是只让平行入射的物方光线可以达到像平面成像。从几何关系可以看出这时像就没有近大远小的关系了。 物方远心镜头接收平行光成像，相当于物体（左边）在无穷远处。物方远心镜头主要用于消除物距变化带来的测量误差，因此通过物方远心镜头所成的图像不存在透视变形。缺点是放大倍数与像距成直接关系。实际使用时相机安装的远近会影响放大倍数。所以每个镜头系统都要单独的标定放大倍数。当然，实际的圆心镜头中的小孔光阑不可能无限的小，那样进来的光线就太小了。所以实际的圆心镜头还是会有一定的近大远小关系的（这个指标称之为远心度，远心镜头的远心度通常小于0.1°）。物距也不是任意的，但是它比普通的镜头的景深要大得多。 像方远心镜头 Image-space tele-centric lens 物方远心镜头光路左右翻转就是像方远心镜头，而像方远心物镜则可以消除 CCD 位置不准带来的测量误差。放大倍数与像距无关，相机离的远近不影响放大倍数。 双远心镜头 Double tele-centric / Bi-tele-centric lens 双远心镜头通过在光学系统的中间位置放置孔径光阑，使主光线一定通过孔径中心点，则物体侧和成像侧的主光线一定平行于光轴进入镜头。入射平行光保证了足够大的景深范围，从镜头出来的平行光则保证了即是工作距离在景深范围内发生大幅度变化，成像的高度也就是放大倍率不会发生变化。 超中心镜头 Peri-centric Lens (Hyper-centric Lens) 有不再近大远小的镜头，也就有近小远大的镜头 。Hyper-centric 镜头提供的对象视图是聚合式的，同时间聚集于对象的顶端和侧边，其功能是避免在机器视觉检测或鉴别应用中使用多台相机和成像透镜设置。 变焦环镜头组进行变焦时，需要手动转动镜头组上的一个圆环，转动它能直接改变镜头组内镜头之间的距离结构，改变镜头组的焦距。定焦镜头由于焦距固定，无法进行变焦，也就是没有变焦环。个别卡片式数码相机为电子结构自动改变镜头组，达到光学变焦极限后再进行数码变焦。 对焦环大部分相机可以自动对焦，其对焦原理可以简单的概括为成像元件侧或者取景器侧有一个传感器，检测接收到的光学图像的清晰程度，如果不清晰，则用自动对焦马达小幅度整体移动镜头组，小量地改变镜头组到成像平面的距离（物距可以认为是没有变化），使得图像清晰指标最大，这便使想要清晰的物像呈现在了焦平面上。不同远近物体的像距是不同的，变焦即是“间接的”把焦平面移动到想要清晰物体的像距上。 手动对焦则是替代自动对焦马达。 快门快门是照相机中控制曝光时间长短的装置, 我们通过调节快门开闭时间长短，和开启的空隙大小来调节曝光量。 在快门速度的标示序列中可以看到，如1/4、1/8、1/15、1/30 、1/60、1/125等。不难看出，它们之间是倍数关系，是指几分之一秒的曝光时间，因此通过快门的曝光量也是呈倍数关系。 快门根据开启的方式分为全局快门和卷帘快门。 卷帘快门手机中的镜头就是大家很熟悉的卷帘快门，感光单元从上至下逐行曝光。全称是“电子控制纵走式焦平面快门”。 卷帘快门的逐行曝光带来了一张照片中从上到下反应的其实并不是同一个时刻时的景物状态，引起的失真称为果冻效应，在拍摄高速运动的物体时该现象尤其明显。 卷帘快门在慢速快门和高速快门下，工作方式是不一样的。 慢速快门工作原理：机械快门有前后两个帘幕，后帘幕（靠近CMOS），在慢速快门下，后帘幕从下至上先打开，接着前帘幕从上至下再打开，此时光线从上至下照进传感器。再接着后帘幕从上至下关闭，光线也从上至下慢慢消失，前帘幕再关闭，结束曝光。以上步骤，可以使传感器曝光非常均匀。不会使照片产生太大的形变。 高速快门工作原理：毕竟机械快门是物理结构，其运动速度不可能无限制提升，速度受到了限制。这就导致一个问题。在高速快门之下，不能依靠两个帘幕分别开关来工作。很耽误时间，于是用固定缝隙扫过感光元件的办法来实现等效“曝光时间”。 并且卷帘快门容易受到闪光同步速度的限制。闪光同步速度指相机的快门速度能够保证在闪光灯工作的时间段内，感光元件都接受到曝光。 如果相机使用的是卷帘快门，当快门速度高于临界快门速度的时候，成像元件不是全部能同时接收光线的，快门前帘和后帘打开一条缝隙，缝隙扫过成像元件完成曝光，会导致照片的曝光严重不均匀（因为闪光灯的脉冲时间非常短，在1/200s-1/500s之间，亮度随时间迅速变化的），会导致照片上只有一个窄条曝光正常，其余部分因为没有接收到足够的曝光而显得很暗。只有当相机的快门速度低于这个临界速度的时候，闪光灯才能和相机快门同步，保证成像元件的各个部分同时曝光。 全局快门而“全局快门”是感光元件上所有的感光小单元同时感光实现的，因为其制作工艺比较高，且普遍用在以CCD为感光材料的设备上，而大部分设备都是使用的CMOS作为感光材料，所以使用“全局快门”的设备很少。 光圈光圈是照相机镜头中控制光线的叶片装置, 调整光圈大小来调节通光量。光圈中心开口的大小代表光圈的数值，通常用f系数来表示。数值愈小，孔径的开口愈大，曝光量愈多，反之曝光量愈少。 通常在拍摄时所说的“开大光圈”, 是指把光圈的数值调小, 把光孔开大的意思, 如从F5.6调大一级到f4、或二级到f2.8等。同样,“关小光圈” , 是指把光圈的数值调大, 把光孔关小的意思, 如从f5.6关小一级到f8、或二级到f11等。 而光圈的值通常为 f1、f1.4、f2、f2.8、f4、f5.6、f8、f11、f16、f22、f32 为什么F值要依据这些毫无规律的值来衡量呢？实际上，这些数值其实是等比数列。相邻两个数字是√2倍，而√2约等于1.414。半径呈根号2倍关系，面积则呈倍数关系，通关量则也呈倍数关系。 光圈和景深有密切的关系，因为通过调整光圈的大小可以直接控制景深。在讲解景深之前，我们得先了解一个概念，弥散圆(Circle of Confusion)。 弥散圆在焦点前后，光线从聚集到扩散，点的影象从圆到点（焦点），继而有扩散到圆，这个焦点前面和后面的圆就叫做弥散圆。如果弥散圆的直径小于人眼的鉴别能力，人眼将感觉是清晰的。这个可以被接受的最大直径被称为容许弥散圆直径δ (Permissible circle of confusion)。 不同的厂家、不同的底片面积都有不同的容许弥散圆直径的要求。在这里可以看出：景深是相对的，不是绝对的，和弥散圆直径 δ的取值大小有着直接的关系。弥散圆直径 δ 的取值的大小和镜头生产厂商的技术能力有关。 在对焦时，通过镜头将在焦平面上清晰成像，而对焦点的前景和后景也在焦平面成像，只要它们成像的弥散圆等于或小于容许弥散圆直径，我们将认为是清晰的，在焦点前后各有一个容许弥散圆，这两个前后弥散圆之间的距离，我们称呼它叫焦深，它和景深是相对应的。所谓景深即：在被摄主体(对焦点)前后，其影像具有的一段清晰范围，这范围内的景物在焦平面上成像，都在容许弥散圆的限定范围内。所能清晰成像的最远部分和最近部分之间的距离。 景深 景深是随镜头的焦距、光圈值、对焦距离的不同而变化。在上图中，我们能之间根据透镜成像公式（物距倒数+像距倒数=焦距倒数）计算出景深和光圈的关系； $\\delta$ : 最大弥散圆直径 f: 焦距 F : 光圈，光圈 F 值 = 镜头的焦距除以光圈口径 L : 物距 前景深: $\\Delta L_1 = \\frac{F\\delta L^2}{f^2+F\\delta L}$ 后景深: $\\Delta L_2 = \\frac{F\\delta L^2}{f^2-F\\delta L}$ 景深: $\\Delta L = \\Delta L_1+\\Delta L_2 = \\frac{2f^2F\\delta L^2}{f^4-F^2\\delta^2 L^2} =\\frac{2f^2\\delta L^2}{\\frac{f^4}{F}-\\delta^2 L^2 F}$ 通过公式我们可以看到，景深的分母是一个关于F值单调递减的函数，所以光圈越小，F值越大，分母越小，景深越大。 一般来说： 镜头光圈：光圈越大，景深越小；光圈越小，景深越大；镜头焦距：镜头焦距越长，景深越小；焦距越短，景深越大；拍摄距离：距离越远，景深越大；距离越近，景深越小。为了要凸显被拍物，很多人会选择小的景深（即远离被拍主体的物体都会被虚化失焦）。当然如果你要拍风景，我们就会建议选择大的景深。 超焦距当镜头对焦在无穷远时，景深前界（离镜头最近清晰点）到镜头的距离称之为超焦距。换句话说当镜头对焦在这个超焦距点时，从这个超焦距点到相机一半的距离开始到无穷远都是清晰的。 对焦到无穷远时，认为物距是无穷远： 景深前界: $d =\\lim_{L \\to \\infty} (L - \\Delta L_1 ) = \\lim_{L \\to \\infty} (L - \\frac{F\\delta L^2}{f^2+F\\delta L} ) = \\frac{f^2}{F\\delta}$ 对焦到该点时计算后景深， d 带入 L ： $\\Delta L_2 = \\frac{F\\delta L^2}{f^2-F\\delta L} = \\frac{f^2}{F\\delta-F\\delta}$ 可以看到，分母为 0，后景深趋于无穷。 而此时景深前界 $L - \\Delta L_1 =\\frac{d}{2}$ 欢迎在我的专栏「自律走行」中查看更多「键盘摄影」系列文章 键盘摄影（一）——相机成像基本元件 键盘摄影（二）——曝光三要素 键盘摄影（三）——等效焦距和等效光圈 键盘摄影（四）——相机成像元件：胶片与彩色暗房 键盘摄影（五）——相机成像元件：CMOS/CCD 键盘摄影（六）——相机成像模型 键盘摄影（七）——深入理解图像信号处理器 ISP 键盘摄影（八）——相机结构和卡口 键盘摄影（九）——光学像差 键盘摄影（十）——滤镜的种类和作用","tags":[{"name":"sensor","slug":"sensor","permalink":"http://www.yvonshong.com/tags/sensor/"},{"name":"camera","slug":"camera","permalink":"http://www.yvonshong.com/tags/camera/"},{"name":"photography","slug":"photography","permalink":"http://www.yvonshong.com/tags/photography/"}]},{"title":"于是我便战胜了这寂寞的命运","date":"2020-01-26T14:00:00.000Z","path":"2020/01/26/anatkh/","text":"「太阳初升时，忽然有十万支金喇叭齐鸣。阳光穿过透明的空气，在暗蓝色的天空飞过。在黑暗尚未褪去的海面上燃烧着十万支蜡烛。我听见天地之间钟声响了，然后十万支金喇叭又一次齐鸣。我忽然泪如雨下，但是我心底在欢歌。有一柄有弹性的长剑从我胸中穿过，带来了剧痛似的巨大快感。这是我一生最美好的时刻，我站在那一个门坎上，从此我将和永恒连结在一起。」 二十一世纪一十年代过去了，我很想它。 按习惯总是一年至少要写一篇文章，根据笔记里偶尔记下的只言片语，回想这一年的心路历程，片刻的感想总是得经过总结反思和复盘，才能赋上这一年的印记。虽然这个时间节点更像是十年一刻，可是在时间洪流面前如此孱弱的我，又怎么经得住对过往十年的追忆反思而不后悔和痛苦呢？ 我高中的时候就思考过一个问题，像是摆脱不了的影子，困扰了我很多年。「过去的感受，经过回忆的润色，是否还是真实的呢？」 年少的我无法坦然面对记忆和现实，在步入大学后我开始诉诸记录，起初每年成倍增长的照片，研究生时代开始拍起的 vlog，可是每次远行归来后的不真实感尤为甚，这些是真实发生的么？有时候旅途过于美好，都不得不感叹仿佛梦一场啊。这样的感受这些年曾无数次的拷问着我，却没有办法直面回答。自己真的太擅长篡改对过往故事的记忆了，甚至都不是否定过去的自我，而是可以直接逃避到仿佛没有发生过一般。致使我会觉得一切超脱平时的日常都带有了不真实感。 后来我发现了即时成像，开始用拍立得，还记得我在 sakura house 墙上挂着的几百张拍立得，今年开始拍胶片。朋友跟我推荐胶片风格的 app / 数码相机时，我自然清楚我不是为了胶片的色彩和颗粒感，因为胶片是一个更具有仪式感的东西，按下快门的那一瞬间成像，然后再经过暗房的冲洗放大，经过漫长的等待，对某一张的喜欢便在收到的那一刻被放大到和仪式感呈正比的程度。就像小狐狸一样，等待是幸福的。而那个瞬间，那个 moment 只属于那一刻，蕴含着我当时的所见所感，我那一刻的仪式感和真实感。所以今年我把我的设备换成美能达胶片单反，和 fuji 的 squre 拍立得，来记录只属于当下，不会被修改的须臾片刻。而拍 vlog 是因为视频比照片拥有更丰富的表现形式，能配背景音乐，能有拍摄手法，能有旁白和字幕，也能经常拿来回顾，是的，让我笃信，那些美好都是真的。 记得毕业的时候拍的那支 vlog 叫「夏が終わった」，夏天结束了。 日语里「夏天结束了」这句话，绝对不能用字面意思理解，里面包含了多少不可言说的含义，那是一夜长大的意思，那是恋爱无疾而终的预兆，那是青春消失殆尽的季节，那是从梦想跌入到现实的分界点，那是失去童真变成大人的夜晚，也是人生从充满期待的未知到无可改变的已知的无所适从。 来不及跟夏天挥手告别的仓促人生，年轻时也对世间万物充满期待，眨眼间就落入了平庸之海。而当了一年有余的社畜的我，也会开始觉得自己的少年心要死了，开始失去了与自我的对话，个人的空间，独自的旅行。 蝉开始鸣的时候，我回了一次南京，去看我本科认识的最后一届学弟学妹们毕业。回到了湖区，去逛了新修的土交楼，和我毕业时遗憾没有爬的教一楼顶，从梅园宿舍出来玩手机不看路都能走到梅园食堂的时候，觉得自己仿佛没有离开过。我还记得离开时是散伙饭的第二天，大雨磅礴，风雨相送。可是这次我却抱着接下来好几年都不会再回来的心态，连夜登上了回北京的火车。半夜在卧铺里醒来，开始和朋友争执，然后又哭湿了枕头。 起因却是这次回来和朋友们聊的一个话题，跟朋友聊工作聊社畜聊大学生活，说她很不喜欢本科学校，而她高中时的梦校在北京，可是她去北京的同学，也过得很不开心。而好朋友 Fi 退学去了其他地方，可是我仍然觉得她并没有变得想象中的那样开心，后来和另一个朋友讨论这点我们得出的结论是，「如果不满足于现况，以为如果换种生活方式就能过上想象中的开心生活，这几乎是不可能的」。但究竟是哪里出了问题？是我们的生活出了问题？还是我们的想象出了问题？ 其实在回南京之前也见过 Fi，距离上次见面时隔一年半，我们去了江西婺源看油菜花，如今只记得当年在大阪和 Fi 告别时的感受，和今年的告别是完全不一样的，是「一定会再见的吧」。 2019.04.05 江西上饶婺源 | 油菜花与徽派建筑 争吵的最后我们也没有得到答案，却在火车上听见对方说，那时很开心，而开始湿了眼眶。可那时早已经结束了，我最后认识的学弟学妹们都已经毕业了，我也会很长一段时间都不会回南京了。 2019.06.07 江苏南京 | 我们的城市又到了夏天 所幸的是盛夏时，结交了新的朋友，我们一起出去玩，在展馆里吹着空调聊无赖的想象与不一样的过去，在烈日下吃荷花冰淇淋喝北冰洋汽水，在园子里交换玩弄着彼此的领结。可是夏天太短暂了，夏日的晚风忽然碰到了玻璃幕墙，耳边的旋律戛然而止，像是夏夜逢路边的花火，谢谢瞬间照亮我平淡无奇的日常。这就够了。后来和朋友去京郊栖霞寺赏枫的时候，想到了几年前在寒山寺拍的照片，嬉戏之间，发现如今的我已经快没有了少年气，死鱼眼像是遭受了生活的重锤，那个能叫嚣世界，说什么也锤不了我的人去了哪里？ 「还能中二多久？」 自我意识开始觉醒的时候，大概也是高中二年级的时候，那时候开始思考自我和世界的关系，也开始陷入求不得的痛苦，不过后来幸好想通了很多，开始与自我和解，学会和自我相处。大概是大学的时候认识到，「成长是与世界为敌，到与世界握手言和的过程」，如今觉得在此之上还有一层。「认识到自己是个平凡人」，到「知道自己只是一个平凡人但仍然怀抱着一点点不平凡的梦想」。我依然想让这个世界，想让我身边的人，因为我，而有一点点的不一样，在满足温饱安全后，实现自我价值，实现社会价值。 于是在某一天骑车上班的路上，开始豁然。我在想，自己为什么又越来越少独自出游，以前能独自去珠三角和环游台湾，去北海道，去很多地方，可是为什么又开始越来越畏惧独处，不能再继续享受这样的状态。可能也有从去年开始，感受到有旅伴同行的快乐。但更多的是，日常开心的事无人分享的落寞。也有失去自我的平衡，混乱的独居生活节奏作为前车之鉴。 是因为，那时的你战胜了孤独，可是也只是那时。人的一生不同阶段的感受是不同的，所以是这个阶段的我，于此情此景下，又落下了一局而已。而归纳可得，我们可能是要和其对峙，或者说与其相处更长的时间，乃至一辈子。就像是那一天，一个人躺在银河下的车里睡觉时，看见忽然划过的流星，和三年前躺在梅一四屋顶看到的流星，已经是完全不一样的心境了。 过完二十四岁生日后的几天，在漫长的洲际航班上，我看到天地之间有十万支金喇叭齐鸣。 2019.04.27 北京-西雅图 | 阳光穿过透明的空气 在暗蓝色的天空飞过 在黑暗尚未褪去的海面上燃烧着十万支蜡烛 我忽然泪如雨下，但是我心底在欢歌。有一柄有弹性的长剑从我胸中穿过，带来了剧痛似的巨大快感。这是我一生最美好的时刻，我站在那一个门坎上，从此我将和永恒连结在一起。 「于是我便（在这瞬间）战胜了这寂寞的命运」。 而这一年，和伙伴去了西雅图，去了上海迪士尼，也因为伙伴的失约而没有去济州岛。我忘了是哪一天，或许是平淡的骑车上班的路上，或者是某个无助落寞的夜晚，或者是某个漫长而绝决的航班上，我戴上了降噪耳机只听得到我自己的声音的时候，我深刻的意识到，我不能再为一个人停留了，不能再为了因为没有同伴而畏惧出发，不能再贪恋同行的温柔。 「你知道么，我的人生计划，上一个是去富士山，我在 22 岁生日前实现了，虽然差点死在前往的富士山的前几天，独自哭着坐上了前往东京的 JR。我下一个人生愿望，是三十岁前去冰岛，为此今年，我开始练习开车，因为去冰岛得自驾，还是雪地。希望 30 岁前能有女朋友和我一起去。」「如果那时候没有女朋友，你还会去么？」 我想都没想。「当然啊。」 我可是为了我自己而活的。 我依然十分相信眼界的力量，眼界究竟是什么呢，是每年都能出国玩几次去看过的世面么？ 有一天和伙伴们聚会讨论，结束后在清华园散步时聊天，聊到未来规划，我说，我承认我们目前的眼界真的看不到三年后五年后我们会是怎样。回来的路上我忽然想通了，多年以前我也是这样认为的，而 we only live once，所以非常遗憾的递推下去，几年后我应该依旧会这么认为。 眼界更像是根据历史数据做一个预测，成长的过程使得拟合时所用的模型能训练得更精准，但在滑窗的尺寸上增益不大，仍然无法抑制滑窗时间过后 covariance 的发散。 可是既然仍然看不清的话，我们拥有了什么，又收获了什么。 不再贪恋同行的温柔的我，眼界，是我不能在原地停留，要去看这个世界的决心和勇气。 我感到自豪，因为我取得了第一个胜利，我毫不怀疑胜利是会接踵而至的。我能够战胜命运，把自己随心所欲地改变，所以我是英雄。我做到了第一件做不到的事情，我也可以接着做下去。我喜欢我的诗，因为我知道它是真正美好的，它身上有无可争辩的光辉。我也喜欢我自己造出的我自己，我对他满意了。 身边的好几个朋友跟我说，觉得我能给人带来不一样的体验，就算是自己也能过得很充实，到任何一个城市生活得很充实，甚至还能带动身边的朋友。可是为什么就是没有对象呢？当然我其实自己也反思过，反思的结果我就按下不表，我也有在努力做出改变。 伙伴跟我说，如果有妹子当你女朋友的话一定是件很幸福的事情，但总感觉缺少了点什么，因为生活并不是只有两个人一起玩，或者是仪式感。我承认，两个人在一起的话更多的是平平淡淡的生活，是鸡毛蒜皮的琐事，是在面对挫折感到无助时对方给予的归属感。可这一年我的情绪也曾逐渐要变成一滩死水，朋友跟我讲最近的故事的时候，我第一反应是，啊我已经很久没有这么强烈情绪起伏敢爱敢恨的时候了… ​​​​ 随着同龄人逐渐进入人生的第二个篇章，他们的生命长卷继续发展，重新被稳定的社会结构所捕获；剩下的人，越来越能够感受到渺小的个体，直面着荒渺的巨大世界的心理压力感。那是一种比孤独更深入的感受，托克维尔多次谈论这种感受。它时而令人感到自己无所不能而陷入狂妄，时而令人感到被世界遗弃而绝望。 这时候人们会因为稳定的社会结构的消失失去很多东西：失去丰富的生活内容，失去社交的满足，失去他人的陪伴，失去稳定的生活节奏。 一个个体有可能在不借助社会结构的情况下，获得心理上的稳定感吗？当然是有的。但需要大量的自律和深入的自我觉察。你为自己创造出足够丰富的生活，具有一定稳定性的生活节奏，你因为非常了解自己而确信自己的身份感。 当然我也并不是说准备长期脱离社会结构秉持独身主义，我依然觉得努力去学会爱人的能力，才有值得被爱的可能。 说到这个我总是会想起一道算法题，你走进一个果园，你只能单向走一次并只能选择一枚果子，你该如何挑选让你满意的那一个。选得太早容易后悔，选得太晚容易错过。在无法遍历的情况下，数学家给出的答案是先经过全长的 1/e，然后在后面的 1-1/e 中遇到一个比第一段都要好的果子时果断选择它，不然你就坚持到最后。 可是人生也并不是那么的简单通过求导就能得到全局最优，万一年少遇见过太惊艳的人怎么办，万一只是你单方面的选择而不被接受怎么办？ 我们依然没有办法对这些问题求出全局最优解。可也正是这样充满未知的变化的冒险，才让路途上的我们胆颤心惊，小心翼翼，珍惜我们所拥有的，旅途才变得更有意义。认真热爱生活的人，绝对不会被生活打败。 而在真实世界的旅途中，这一年也有幸拥有了几次高光时刻。 2019 年 4 月，赴了和歌歌说了很多年的约，去了美帝西雅图，我们开车去了奥林匹克国家公园，去了微软雷德蒙德，在安杰列斯港篝火旁看星星的夜晚，我们在房车内抱着暖和的被子里聊我们的高中，聊彼此，聊大家，我终于将心里很多年前的事情释怀。我高中时代几乎形影不离的朋友，在毕业后这么久后又见上了面，怎不会记起多少少年往事。第二天我们在草坪上晒着太阳弹尤克里里，诗情画意，我见犹怜。动心指数，五颗星。 2019.04.30 美国华州西雅图 | 安杰列斯港的房车篝火与星辰大海 2019.05.01 美国华州西雅图 | 安杰列斯港的草坪与尤克里里 2019 年 11 月，故宫的雪。 关于故宫我可以说千次万次，今年买了年卡，去了八次故宫，我高中的时候，当时想来北京读书，想去看紫禁城。最后高考志愿却是一个北京的学校也没有填。那时我爸跟我说要不要考完的暑假去北京看看，后来我还是拒绝了。 研一的时候，机缘巧合来了北京实习，便等到了 9 月 1 日左右，一年之中人最少的时候去故宫。谁也没能想到那之后我开始了不属于我，也不知道什么时候才能停止的北漂生活。在玩遍北京后，我就指望着故宫和展子活下去了，无聊的时候不如去看清晨无人的太和殿广场，元宵夜也运气超好能去到上元节灯会。春天的花，夏天的晴空，秋天宫墙上飞过的训鸽，以及我有生之年终于看到的，故宫的雪。 2019.02.20 北京 | 紫禁城上元之夜 2019.11.30 北京 | 下雪的故宫 今年本还有个目标本来只是练习一下市区开车，没想到一下子开过了婺源，北京，上海，成都，张家口，挪威。 去看冰山梁露营看银河的旅程，我们单程开了六个小时的车，选中了这一年夏末最后能看到银心的朔日，和流星雨的极盛。那天我们撑起帐篷，看了金色时刻和蓝色时刻壮丽的太阳。等到夜色降临，才真的感慨，原来肉眼是可以看见银河的。人生难以忘怀的初体验。 2019.08.31 张家口赤城县冰山梁 | 你如果要问我那天夜晚踟蹰路上的心情 我想起的却不是孤单和路长 而是波澜壮阔的海和天空中闪耀的星光 在北京市区内开过几次，去鬼笑石，去香山，去卢沟桥看中秋之月，去红螺寺赏秋，去怀柔滑雪。而去北欧的旅行是为了练习在欧洲公路雪地开车，可是面对一路的雨雪，我还是会心生倦怠，“要不晚点再开吧”，导致最后两千多公里中，我大概也只开了五六百公里，不过确实感受到欧洲公路的驾驶难度，也便是前来练习的意义。 北欧的旅途里，前半程是转瞬即逝的峡湾，我闭上眼睛仍然能想起车窗外，峡湾下的村落和风雨交加的大西洋公路。以及温柔的阳光打在落满雪的树梢，眼前所见，便是挪威的森林。而更多关于北欧的旅途所见，可以期待一下我（不值得猴年马月能剪出来）的 vlog！ 2019.12.27 挪威 | 峡湾下的村落 2019.12.30 挪威利勒哈默尔 | 新年前夕 旅途的结束除了不真实感便是又回到社畜的日常。在上了一年半的班后，感觉大家都是在社会人的身份上有所前进，我依然还是个读书学生的心态在上班。就像是时间依旧流逝，你只需要面对期末考试，便能升入高年级。可是社会的毒打告诉我并不是这样的，也不能再蜷缩在自己的舒适圈，既然涉足社会，就要了解社会规则，打怪升级。跨年的时候同事们总是打趣问我今年的新年愿望，我倒也是不怕立 flag 的，只是我已经区分了什么叫做愿望，什么叫做目标。只是对于目标，面对 2019 年几个没有完成的目标，我有了更多的感悟。除了要努力去实现目标，更需要分解大目标，树立 milestone 和 deadline，更重要的是，需要进行周期性 review。嗯，像极了工作时设立的双月 OKR。 比如挂一下我 2019 年的目标。 每个月存一定数额的钱 N2 上海 去美帝 回一次南京 练习市区内开车 每个月出一支 vlog 去看下雪的故宫 读完书和补完笔记 嗯是的，还是有很多没有完成，比如我的 vlog，前半年完成的很好，后半年又陷入了瓶颈，是因为我不想剪辑流水片的想法和手跟不上脑的拙劣的拍摄剪辑手法。上海倒是去了几次，可是目前仍然没有完成我的目标。其他的就不多说了。 而 2020 年的目标需要新的表达形式。就像之前说的，我们无法扩展滑窗的长度，但两个月内的事情还是能在规划中的。我打算以双月作为自己生活的规划周期，和工作周期耦合起来。而其他带有 deadline 性质的便是我目前所能想到的今年想做的事情。 制定双月健身计划 每两个月出一支 vlog 制定双月读书计划 6 月前申请去上海工作 7 月底去日本看花火大会 愿望的话，不如许愿今年有女朋友？XD 最后，2020 年，总是被赋予科幻意义的一年，这一年的开头已经充满了戏剧性的社会时事，可是我仍旧欣然接受挑战。 我希望自己也是一颗星星。如果我会发光，就不必害怕黑暗。如果我自己是那么美好，那么一切恐惧就可以烟消云散。于是我开始存下了一点希望——如果我能做到，那么我就战胜了寂寞的命运。 ———— 王小波","tags":[]},{"title":"见过花火","date":"2019-02-07T19:38:00.000Z","path":"2019/02/07/kaneganaruhazu/","text":"「帝都冬夜，到家楼下便利店买水，在 seven 的冰柜前抬头看到了 カルピス 饮料，我一下子愣住了。原来两年真的已经过去了，这两年的记忆如盛夏般炽热而漫长，就像仲夏夜的一场梦。」 梦里有我对日本的所有记忆，关于日本的四季，关于学校和研究室，关于铁道 JR，关于打工和便利店，关于从北到南走过的全境四岛。 现在的我，在北京双井租的房子，每天骑摩拜单车上班，骑车大概 15 分钟，冬天冷的时候会戴上手套口罩帽子，才理解北方冬天的口罩主要功能不是防霾而是保暖。路上会下穿附近北京站出发的京哈铁路，晚上下班早的时候总是能恰好遇到列车从上方呼啸而过，只是再也听不到熟悉的轨道哐当声和折尾站的站台报站铃。那阵子在看「獣になれない私たち」，剧里第二集有个片段，画面上没有 JR，可是还是能听到熟悉的声音，配上家楼下 seven 的 calpis，不由一丝感慨。 原来两年真的已经过去了，再怎么想回去咸鱼也回不去了。从毕业发表到卒业修了式，那个在夏天的末尾，告别了所有，然后回到曾经日思夜寐的帝都，在一家自动驾驶创业公司做定位算法工程师。人生就是逃离舒适区，丢掉包袱清零，然后又开始新的挑战。 2018.10.9 北京 | 回家路上 所幸的是在北京也和研里回国去其他自动驾驶公司/研究所/车企的伙伴几次聚餐，重逢的时候感叹到，正是和这些伙伴一起经历的过去，有了今时今日的我。冬假出玩前和研里伙伴拍脑袋说想做个 demo，自动驾驶去海边，开始和伙伴推进计划和后来的丰田项目，这件事一直忙到三月份到中发，期间请教了在国内自动驾驶创业公司工作和在京大读博的学长，后来碰巧博士学长回研究室和前辈到学研都市做路测，抓住机会请教了很多。我们一起讨论整个系统的划分，每个组件的 SOTA 和如今的解决方案，也没想到这成为了后来的一系列草蛇灰线，四月份去了北京实习和毕业后回来上班。期间之后的事情全靠研里伙伴继续推进，其间还接受了丰田现任总社长的父亲（即上任社长）的视察，以及毕业发表后，留在学校做 Car Robo 的助教，都无一没有我们一起讨论的痕迹。这件事情大概是这两年值得一提的收获。如今在一个更大的平台做自动驾驶，新的一年于我而言更多的是挑战。 2018.03.04 日本宫若 | 丰田园区 2018.08.20 日本北九州 | Car Robo 课程调车准备 毕业典礼后第二天便又飞往了北京去入职，而后的日子在工作上不是十分的顺畅，也在挫折中领悟很多。在做科研的方法和心态上都有着很多需要纠正的地方，工作不仅仅是软件工程学中的人月神话，还有和上下游的沟通，自我观点和工作内容的表达和呈现方法；其中最值得一提的一点是关于实验，像是本科时觉得很无脑的物理实验，和自己看 paper 时只关注 idea 或 contribution，忽视了实验的设计，以及实验的结果是否能够足够支撑自己的理论；并且不是根据实验结果去猜测原因，而是提出假说，设计实验做实验去验证。这一点是上班几个月连续被捶时最大的感悟，只是自己还得快速进步，我相信接下来的这一年对我来说充满了挑战，不过我也会欣然接受最坏的结果，所以我不在怕的。 怕什么真理无穷，进一步有进一步的欢喜。 可是现在努力想变成可靠大人去面对现实的我们，似乎也要交出此番成长应付的代价了。 年末有一段日子，连续一个月周末只想在家躺尸，某天顿悟自己工作之后的生活变得乏善可陈，失去了对其他的探索欲，自我安慰是工作真的太累了，耗费了大部分精力，也无心出游和做其他自己想做的事情。可是有一件事情不能逃避必须面对的是，我在变成【小王子故事里只知道数字的大人】。 找工作的时候和朋友聊天，说到谁谁谁又拿到一个 offer，那个工作有多好，用很多形容词是没有办法描述的，词穷的我们得说这个工作年薪 xx 万，我们就立马能 get 到，「哇，那得是多好的工作啊」。为物质的丰裕而奔波确实是生存之必要，可诗歌、浪漫、远方，这些才是我们生活的意义。我也曾多次的表达我的观点，我觉得爱情不是生活的全部，工作，朋友，家人，与自我，与世界，都是需要一定的独立时间和空间。 可结果是越是理性，生活越是平靜得深陷死水一潭。 租了房有了个人的房间后我懒得去开始养花，将理由推脱给时节；房间内贴过一次的照片墙将其撕了下来，将所有拍立得收纳进抽屉；遇到那只猫时，就没有抱过将其驯养的念头，却又擅自给她取了名字ーー桜；以及无数次告诉过自己和人相处时不要逃避，转身又只会用这一种方式保护自己。 2018.08.05 日本北九州 | 在路上救下的 sakura 和几个月后的她 也希望你能接受这样不完美的我，不过在不断的自我观照下，今时今日的我也是不断的在卸下老化腐朽的甲板木头，竖起新的船帆。 比如我仍然在努力去更远的地方，中发后和实习前的三天空白，我在毫无攻略只知在哪坐船的情况下，独自去爱媛过了生日，去了松山梅津寺站和伊予下滩，从 20 岁到学生时代最后一年 23 岁，都在努力用生日为节点和仪式感去完成远行的目标，而下一个人生目标是 30 岁前去冰岛。 2018.04.11 日本爱媛 | 梅津寺站 跟别人提及到冰岛这一人生愿望时，我说好想 30 岁时有女朋友一起去冰岛看极光啊，或者时夏至时海平面上不落的太阳。朋友反问我，如果那时是单身你还会去么？我想都没想，肯定会去啊。毕竟这些年我也独自前往山川河流，看过人山人海。可惜我也不知这一年是进步还是退步，我开始依赖和他人的世界相溶，冬假的时候去了冲绳和台湾，从花莲的海边砾石堆聊到九份围炉夜话，平溪灯起，淡水日落，夏休时去了新加坡，城市屋顶旖旎风光，印尼海边咸鱼生活，感受到和好朋友远行是这般的舒服，毕竟一起旅行也是一种考验，日语有一个词叫做「成田分手」，讲旅行归来，在成田机场就直接相互拉黑再见，当然故事也会发生在朋友之间。 2018.02.21 日本冲绳 | 古宇利岛 2018.02.24 台湾花莲 | 七星潭 2018.07.25 新加坡 | 鱼尾狮公园 旅途的时候我跟好朋友抱怨，我其实也只是想有个能一起分享快乐的人，有的时候很开心想找人分享，第一反应是想不到人，第二反应才是好朋友，因为看过身边很多亲密关系带来的桎梏失去了自我，只是如今更多的是豪猪之间因为彼此身上存在的的刺和刺，距离太远无法互相取暖。这种恍惚之间的挫败感，生成无尽的虚无和寂寞，不再是只拥有独行时纯粹的孤独感。 周末有一次去刚来北京安顿下来的朋友家吃饭，说来也是有趣，女生是只有那一次一起坐飞机遇大雪延误了 12h 的照面，男生是次自驾去阿苏时认识的，跟着朋友和为其来北京的对象一起去超市买菜， 我和男生笑，在日本买菜回家我们在 lamu 超市只需要非常熟练的拿起肉盘和菜绕一圈早就结束了，根本不会像现在一样精挑细选左右衡量买什么菜回家煮火锅，那天吃完火锅我们在沙发打 switch 打到瘫倒睡觉，我却开始羡慕起他俩生活里的烟火气，女生是个很喜欢写文章的人，想起其毕业时写下的笔触，讲其归家的生活感悟，却又无比映照今日我过年回家心境。在两年没有回老家后的这个假期，在见到了好几个算是一起长大的哥哥们后，看到他们如今已经成家生子，应了那「昔别君未婚，儿女忽成行」。 口口声声说着要去流浪的中二的我，听到这样的话语，难道会不动容吗。正如《夜航》里有一句话：要想获得尘世间的幸福，你不能匆匆而过。可是，从一首歌的旁边经过，歇歇脚，前方的道路还是要继续走啊。或许此时此刻此身，还握不住稳稳的幸福，因为无法放弃因布满迷雾而更加诱人的远方。 ———— 我要稳稳的幸福 | 吗？ 不过我依然觉得「人生，还有无限的可能」。过几年我会想出去读博么，我会在这个城市呆多久，以前觉得看不清未来无法做出长远的规划而感到迷茫，可是正是这样的未知，人生才会有冒险的感觉啊。工作带来的好处有了一定的规律能计划更长远一段时间内的事情，比如我给自己报了个一年期的班，买了故宫的年卡。那个暑假做的工作还是读书的决定我觉得我一辈子都不会后悔，以前我相信眼界的力量，现在我更清楚每个时期都有每个时期的局限性和历史进程。 平成年最后的夏天过于绚烂耀眼，若是你见过，也难以忘怀吧。是绽放的花火，是晚风浮动的浴衣，是湿黏的汗水混合沙砾和海水，是伙伴问我最喜欢哪个季节，我说是夏天，因为所有美好的事情都发生在了夏天。化成了仲夏夜的一场梦。 见过花火，便见不得花火。 2018.03.28 日本北九州 | 校园里的樱花 2018.04.01 日本北九州 | 黑崎城山公园 2018.06.09 日本北九州 | 岩屋海滩 2018.06.18 日本北九州 | 高塔山公园 2018.07.18 日本福冈 | 海边公园花火大会浴衣 2018.07.18 日本福冈 | 海边公园花火大会 2018.09.09 日本北九州 | 研究室外阳台的一年光影 2018.09.17 河北曹妃甸 | 入职 梦醒了，那就道别吧。 从今以后，还有更多更美的梦要去实现。 2018 新年愿望 工作 樱花季 去 tw 花火大会 研究生顺利毕业 去 sg 自己租的房子里养一只猫 房间的照片墙和明信片墙 去 us 养活一盆花 2019 新年计划 N2 上海 去美帝 回一次南京 练习市区内开车 每个月出一支 vlog 每个月存定量的钱 去看下雪的故宫 读完书和补完笔记 MVG 概率机器人 状态估计 因子图","tags":[]},{"title":"充实人生的常态是成长的阵痛","date":"2018-06-17T07:00:00.000Z","path":"2018/06/17/world-is-tender/","text":"笔记本里去年的年终总结都还没有写完。。。结果这一年都过了二分之一了。就顺便写一下这一年多来的一些感慨吧。 有时不得不说时间在推着我走，仿佛毕业是昨天的事，又仿佛过了很久。在交替间的错乱，使我觉得生活还在继续，却又发现有些地方已经回不去了。 其实所有都是关于内心的自我审视。我一直在努力把握自我的内心状态，剖析自己的内心，想逐渐成为一个明晰自己缺点，然后努力成为更好的人。 城市四年前去台湾的时候，从厦门出海，觉得在没有变化的环境里，感受不到自己的前进，甚至现在内心生出，像实习时一样几个月或者更长一点几年，换一个城市去工作生活的状态好像很不错，当然我也明白换工作换城市的成本时很高的，更何况也要不断的与友人告别。当然最近意识到，原来我就是个折腾的人，不甘于呆在舒适圈，总想要去冒险 XD，以前看到朋友从神经网络的角度说“当你过于专注某件事时，大脑会逐渐对这件事过拟合，感觉你在变聪明，如果停止接收新鲜的事物，从泛化的角度讲其实你在变笨”。 毕业离开了南京。我记得离开的那一天，风雨相送，我拖着所有的家当，下起暴雨来误了动车，然后改签。临别的感受却是，我真的太喜欢南京了，可是我知道我要离开她了，不会再回来了。 2017.06.07 江苏南京 | Fi 给我拍毕业写真 然后抱着这样的决绝回了 2017 年仅有的一次成都。那几天约见友人，路过了高中时补课的地方，一下子万千回忆。 我终于明白了我为什么要逃离自己喜欢的城市了，是真的太喜欢了，在这个城市遇见了太多的人有了太多的回忆，可我并不想靠着回忆过活。 暑假的时候，凭着一腔孤勇，去北京实习，一个 AR 的创业公司，总共不到 15 个人。有一段时间忙工作，头大又没进展，也逐渐适应了每天一个小时多的通勤，某一天一个人走在四惠转公交的天桥上，无数错乱即将击溃我，忽然意识到原来这就是一个人的北京，起初是骄傲，我终于靠自己，来到了年少时期待的，这个国家的中心，闯进了这座辉煌而陌生的城市，后来是心疼自己一个人的勇敢，北京真的太大了，大到有次下到一号线站台，满满的全是数不清的人，却仍要迎着头皮挤进地铁车厢。 其实其中的某一项挫折是工作，得坦然承认的是我并没有天赋，但仍然不能把缺乏天赋当作放弃努力的借口。（知乎名句，与大多数人的努力相比，根本轮不到拼天赋）有时候就是真的受挫，害怕面对缺乏天赋的残酷真相。 “所谓的天赋，难道不是那种，非常非常热爱的感觉吗？无论发生什么，都不会让你放弃，那种执着和斗志之类的东西，不就是天赋吗？至少我是这么想的。” 不过所幸的是实习的公司，每天一起下楼买饭，大家在一个大桌上一起吃饭，老板是个很厉害的人，总是能指出我的 bug（捂脸）那段时间真的学了很多，心怀无数感谢。 秋之红叶狩的时候又去了一次东京，内心变成了，我还是想要在大城市生活啊，既然城市都是一样的，那为什么不去一个更好的更大的城市呢？ 2017.11.08 日本东京 | 代代木公园 东京爱情故事 我以后会生活在哪一个城市呢，决定养猫之前自己要去养花，嗯呢已经有了重新养花的勇气~自己的房间有一面墙不仅要贴满拍立得，也要贴满收到的明信片。会继续练习做饭，嗯已经开始期待起来了呢，我一定会成为一个对待生活温柔的人吧。 焦虑去年实习的时候有一段时间内心特别焦虑，主要是来自同龄人的压力，发现身边认识的谈恋爱的伙伴都几乎到了见家长的环节，这种里程碑式的阶段令我感到紧迫，但我仍然觉得用几年时间决定今后几十年要一起生活的人，真是太可怕了，即使可以分手离婚，但都是有成本的。 更往以后是不是会更现实，是不是以后再也不能为了一个人发光了，让我产生恐惧。 有一次和朋友聊天，我说到以后拒绝 996 的公司，因为我周末还要去 dating 呢。。不然怎么找女朋友_(:з)∠)_，然而朋友说我目前充实忙碌又有所调节的有趣的生活，以为我不需要女朋友呢。。。然而仿佛是个似曾相识的对话，Fi 曾跟我说，想象不出来我有女朋友的样子，觉得我现在的生活挺好的，而且好像没有地方安排一个女朋友。 我却只能胡诌几句，我当然知道一个人也有一个人的活法，两个人也有两个人的生活，我可能是太爱自由了，不过希望有女朋友的时候能把对世界的温柔都给她。 然而以上的想法现在看来都是错误的，我觉得是因为我根本就没有把女朋友这件事放在我的人生计划里，放在我的未来里。大概在想象未来的时候，默认自己仍然是一个人，也不需要为其他人承担什么责任。比如毕业后去哪倒是全由我个人决定。 有一天兔子跟我指出，说我跟她一样仍然不懂得怎么爱人，对方是个人啊，并不是说你想对对方怎样你就能做到的，你们也会有矛盾冲突，也会把脾气撒给对方。当时的我恍然大悟，当头棒喝，一切都只是我这么认为。 后来我终于明白了，并不是要一下子就肯定自己要和谁相处一辈子的，有时候真的就是，觉得和谁在一起开心，然后想一起走一段路，然后等到某一天机缘巧合，一个平静的下午，然后决定要一起过一辈子的。 有时候焦虑也来自于自己的现况，觉得自己对当前把握的不够，怕走弯路，怕迟到，怕一时失意。那段时间有一个鸡汤文说每个人都生活在自己的时区，奥巴马五十岁当选总统，川普七十岁才当选。可是美国西海岸比东海岸晚三个小时，然而他们的太阳都在各自的 12 点到达最高的位置啊，我就觉得自己的人生时刻就应该做什么事情。 可是并不是这样的，人生并不是一定要按部就班，人生是可以试错的。你花了几年时间，意识到自己不喜欢当前的东西并决意要跳出来，并不是说你的人生就这样失败了。所以很佩服认识的那几位退学重读的朋友，就连看见别人 gap 一年再去工作，也觉得真好，毕竟健康工作五十年，根本看不到头呢（逃）。所以才会决定今年要晚一点入职工作。 独居也许是内心不够强大，我这么一个喜欢独处的人，这四年，一个人去过一些地方，到头来，却输给了自己一个人的独居生活。 那时候是室友回国了，我一个人在这边打工加自习，然后开始生活规律紊乱，每天失眠到凌晨四五点，有时候干脆一宿不睡，直接起来做饭，然后就去打工四个小时，回来后终于累了倒在床上。更或者在自习室不顾时间的做自己的事情，凌晨两三点骑车回家，冬夜里的风，更吹得令人清醒。 独居生活里唯一觉得在活的时候是自己做饭的时候了，深刻的意识到自己只是个初级的厨师，料理是我内心情绪的外化，有时候因为失眠，厨艺水平变得十分糟糕，就连用烤箱这种如此简单的厨具也会失手。 终于那段做饭的时间，领悟了很多关于每日不断重复的料理与不断推石头的人生的关系。其实每天做不同的三餐是很难的，所以不如认真做好每一天的三餐。也终于明白自己，为什么喜欢下厨了，因为在做饭的时候，自己很专注于这件事情，这种专注的感觉超棒的，会让我上瘾。专注令我意识到我在活。 到现在仍然过着紊乱的生活，有时候会一下子兴起，把屋子整理干净，躺在地板上开着窗吹凉风，仍然会对以后抱有期待，将来生活的房间要像现在这样，在屋里光脚，墙上挂满喜欢的东西，周末作息规律。 旅行去年开春的时候，第一次去了东京，日思夜想的东京之旅，去独自看了富士山。 想去东京大概是 18 岁的事情了，终于在 22 岁之前完成。却也差一点死在了东京之旅的前一日。 2017.04.09 日本东京 | 目黑川上飘落的樱花 那一次车祸令我感悟很多，从姐姐家高崎一路哭到上野，然后一个人昏昏沉沉的睡一下午来缓和自己的内心。 然后我就这样到达了东京，去看了目黑川上飘落的樱花。关于富士山，是很多年前一句“谁能凭爱意要富士山私有”，富士山不能动，但我可以走过来啊。那种略带“我偏要勉强”的不甘。结果就是被认为是付出型选手，忽视对方个人意志。 2017.04.11 富士山 22 岁 一个人出去玩似乎变成了调节自我的方式，我谙于享受全程只有我的自言自语的旅程，不用太在意别人的感受，可能我就是太自私了，只想让自己舒服。 可是这种自私的惯性带进了日常生活，有时候就是只顾自己的舒适，如果我觉得和你聊天找话题太累了，那我只想保持略微尴尬的沉默。 然后是夏天，回国实习前去久留米看的花火大会，西日本最大，花火大会快要成为我夏天最美好的回忆，那一天逢魔之时开始的花火大会，河堤边的晚风浮动着杂草，穿着浴衣躺在草坪上，好朋友在身边聊天，仰天看着花火闪耀，真的，此生无憾的感觉。 2017.08.06 日本久留米 | 筑后川花火大会 冬假的时候去了北海道，冷酷仙境与世界尽头，一个人搭雪国列车，苍茫天地，窗外树影快速滑过，去往小樽偶遇的彩虹，去往星野看过的深山，去往函馆全程的海岸线，都是我收藏进内心成为我抵抗世界的温柔记忆。 2017.12.25 北海道小樽 | 冬天的海 以及自己的第一个旅拍 vlog ~ 从北海道回来后，九州下了好几次雪，可是我却变得怠惰，开始无感，内心只是：“噢，下雪了“。没有了以前的激动和欢喜（我可是南方人诶）。仔细想了想，不能归咎于曾经沧海难为水。如果去过远方而放弃眼前的日常，那我宁愿未曾去过冷酷仙境，不然怎么温柔对待生活。 其实也有和伙伴夏天穿浴衣逛京都，冬天穿短袖游台湾。无锡的毕业旅行，上海的夜里游街，玩到精疲力竭的大阪环球影城，在开往关西机场特急 JR 前的告别，时隔半年在花莲的石砾滩上看火花，在九份围桌夜聊，平溪天灯淡水落日，还有在台北的客居日常。那天从台大回来，路上买了个给阿姨准备的生日蛋糕，一路拎回来，当时居然有一丝在这个城市生活的错觉。这些所有一切，除去故事进行时反反复复的破除羁绊，然后就是强烈的不真实感，真的是大学时代最好的朋友了，以及结束后的落寞。 在今年 23 岁前，随性去了四国爱媛，松山和伊予，去看了莉香和完治分别的车站，梅津寺站，在松山站看到一张伊予下滩站的照片吸引住，是因为真的太漂亮了，于是第二天前往，才知道原来是青春十八宣传海报名景。 2018.04.12 日本爱媛伊予 | 下滩车站 说到梅津寺车站，后来才想起原来也是《龙族》里路明非和绘梨衣乘着阳光盛大逃跑最后的分别地点。江南更《龙族 5》的时候重新回看了龙 3 最喜欢的章节，那段被命名为 Tokyo Love Story 的行动，路明非带着绘梨衣跳出了设定的剧本飞驰前往爱媛，在梅津寺町山上看暮色如海潮般涌来。 2018.04.11 日本爱媛松山 | 梅津寺站 关于绘梨衣令我印象最深刻的故事就发生在此。 “世界很温柔。”绘梨衣给路明非看小本子。 世界很温柔？路明非从没想到温柔这个词也能用来形容“世界”这么巨大的东西。 “以前世界不是这样的，没有那么温柔过。”绘梨衣又写。 “以前你觉的世界是怎样的？”路明非问。 “蛇群守护的宝石，很漂亮、很远、很危险。” 北京以上大段其实都写在很久之前没有完工，中间甚至博客被自己删库了。。。我以后再也不拖这么久了。。。因为这段时间很多想法游发生了改变。。。不久前终于定了自己的 offer，要去北漂啦。 Tusimple，图森未来，激光雷达传感器工程师。 拿到 offer 的那天，晚上赶着去和伙伴聚餐，在地铁通道里跑的时候，笑的很开心，觉得要很开心的接纳北京啦，北京也有不好的地方，一直觉得整个城市灰头土脸的，春天来的时候漫天的柳絮，冬天的雾霾。 可是北京是年少时的向往啊，终究是作为首都的这个国家的心脏，这个城市有着其他无法比肩的资源与机会，有着无数的展览和文化活动，我太相信眼界的力量了，一直想要去看，更广大的世界。 2017 年 合辑 标题其实是我去年在北京实习时我的老板说的一句话，事到如今我仍然觉得很有道理。充实人生的常态是成长的阵痛，所以要不断的去战斗。 去年我的新年计划完成 春天去东京 顺利毕业 毕业写真 找到打工 实习 保佑伙伴考研 日语 N2 找到正式工作 今年的任务是 工作 樱花季 去 tw 花火大会 研究生顺利毕业 去 sg 去 us 毕业旅行 自己租的房子里养一只猫 养活一盆花 房间的照片墙和明信片墙 这一年里拍的拍立得 即使计划里依旧没有…但我已经有了重新种花的勇气。","tags":[]},{"title":"当我们约会时我们会玩什么","date":"2017-10-22T00:08:00.000Z","path":"2017/10/22/dating-events/","text":"从高一开始组织各种活动，时至今日已有九年。其间有独行的玩耍，有两个人的约会 ，也有超过二十人的集体活动，甚至是十人以上的集体旅行，以下绝大多数都是我组织过的~ 广义上的约会，其实就是和伙伴，或者伙伴们，一起跳出日常！让生活充满新鲜感和仪式感！ 本文为 组织聚会/团建玩什么/约会去哪 不完全指北！快来关注我叭！ 感谢 Google Photos， 想要啥配图，搜一下关键词或者记忆中的时间线就能找到。 以下内容大部分来自我之前一个回答《知乎：约会时除了吃饭看电影还有其他推荐吗？》，略有更新。 两三人活动不得不提的是，两三个人的活动和集体活动是完全不一样的，因为可以直接单独确定活动内容，要追求氛围，活动的有趣性，行程的安排很容易都能满足。 常规玩法： 吃饭 - 看电影 - 甜品店此为最常规玩法，个人认为看电影这个活动除了电影结束时能对剧情有所讨论，其他根本就没有约会所需要的互动。。。所以甜品店就是个很适合坐下来聊天的地方~ 去景点为什么日常不能去景点玩~ 南京先锋书店等创意书店也算！ 然后是不同的馆子！ 看博物馆到一座城市你想了解它的过去首推博物馆，当然日常有兴趣的话也能去博物馆，博物馆不只是陈列一些老古董，每段时间其中一片展区会更新现代当代艺术家的作品。最喜欢故宫博物院了！不仅可以看展品，还可以看建筑，还可以看满园春色。 2017.09.02 北京 | 看过的没有人的故宫 2019.02.20 北京 | 紫禁城上元之夜 看展子展子是永远也刷不完的！各种有趣的展，比如漫展，艺术展，观展信息可以从各个途径获得。 app： 豆瓣同城，活动行，iMeuseum 小程序：知亦行博物馆小程序 游乐园游乐园其实适合两三个人，人多了也会走散的。虽然以前经常是个独行侠出去玩，不过游乐园在我心中还是适合和伙伴一起来的。 迪士尼 环球影城 欢乐谷 方特 2017.07.14 大阪 | 环球影城 约图书馆自习学生时候放假玩得最多的项目了 XD 约图书馆一定要注意在哪吃饭，高中暑假几乎每天去市图书馆自习，然而每天都要走很远才能吃到饭（那时候还没有外卖）。成都市图书馆，四川省图书馆，国图都有去自习~ 逛宜家宜家适合玩和拍照！一定要注意避开人流高峰。。。 压马路比如上海有很多有趣的马路，巨鹿路，甜爱路什么的，夏天走在上海梧桐接天的街上，就能觉得好苏胡啊o(￣▽￣)ブ 2017.06.18 上海 | 淮海中路 露营山顶，河边，海边！一定要坚持起来看日出~虽然冻成狗，可是都成了美好的回忆qwq，我甚至在学校草坪上露营过两次。。。 2016.07.30 南京 | 李文正图书馆前的大草坪露营，等待日出 音乐节 音乐会 推荐 app：大麦网 2015.09.28 南京 | 南京森林音乐节 话剧 实景话剧 live酒吧清吧适合聊天，也可以选择去蹦迪hhh（人老了就不蹦迪了。。。） 动物园/植物园/科技馆科技馆还真去过几次。。。比较偏科普，动物园和植物园也适合两三个人~ 2018.07.28 新加坡 | 夜间动物园 Night Safari 然后是各种大众点评能搜到的店 烘焙体验 2015.02.10 成都 | 烘焙体验店 在厨房做黑暗料理做黑暗料理和吃火锅是不一样的！可以安排一个人出一个菜，火锅就是大家直接买菜往锅里丢。。。 留学期间练习做的黑暗料理 最开始使用烤箱都会很黑暗。。。 做陶艺不过通常做出来的不能立即带走，烧制需要一周，然后自己再来取。 体育活动！ 跑步最简单的体育活动了，校园夜跑超级适合！相当于是晚上约会（想太多 游泳还是去游泳馆游泳比较好。。海水真的太咸了。。。 溜冰推荐刀冰啦，旱冰场地有点局促。在北京过冬天的时候还想去后海，看很多人在坐冰车，觉得这活动我有点接受不能XD 打羽毛球凑够四人双打最好，一个小时就行了，一直打还真的挺累的。 小众体育剑道 棒球 骑马 射箭 2017.10.14 北京 | 剑道体验 2015.08.01 成都 | 棒球 密室逃脱体验馆大众点评上能搜到很多！ 比如成都和上海有 黑暗中的对话体验馆，素描油画体验店 2017.6.18 上海 素描体验 集体活动组织集体活动是一项非常考验人的事情。。。毕竟人类的本质就是咕咕咕。不过后来都能直接哪些鸽率较高，给安排容错，最开始组织的时候要挨个私聊，活动当天要提前集合别单独前往，还有最保险的办法是先收定金不要自掏腰包预付款。。。很多血和泪的经验。。。 KTV郊区骑行注意防晒！ 野炊烧烤海边河边更好，通常可以和骑行结合在一起。 2018.06.09 日本北九州 | 海边烧烤 钓鱼读书的时候，学校在很村的海边，就能去钓鱼抓螃蟹www 煮火锅/烤肉处理食材轻松很多，我甚至准备过研究室聚会40人+ 4个锅的食材调料XD 留学期间 在我家吃过大大小小无数次的火锅、烤肉 轰趴馆 2019.02.10 成都 别墅轰趴 约打麻将四川人… 桌游馆读大学的时候我们甚至就在室外，铺防潮垫席地而坐，玩狼人杀。。。因为学校里没有能玩到12点后的场所XD 电玩厅高一高二玩过几次后再也没有组织过了。。。 真人CS卡丁车社畜活动约逛对方公司很成年人的活动hhh，适合有园区或者一栋楼的科技/互联网公司。啊比如超级想去 微软的 center one … 参加展会和社区活动，沙龙比如参加过36kr的没想到游乐园！一起去听一场书/科技公司的沙龙/分享会，一起参加hackathon（结对编程？）（码农属性暴露） 滑雪因为滑雪还蛮贵的，还是得上班赚了钱才行。。。第一次是在北海道星野，滑一天算下来要一千？ 自驾游才成为社畜的我，这周要自驾游去居庸关赏樱~ 后来，真的一个城市都玩遍了还可以做的事情是： 馆子和展子是永远也刷不完的！好吃的店也是！大众点评查找新体验馆！ 个人觉得更高级一点的玩法是 时令限定 是只要在那段时间才能去做的事情。读书的时候，知道日本人很讲究 赏味期限，和一期一会。所以才会想念看过的转瞬即逝的樱花，紫金山夏夜的萤火虫，花火在夜空闪耀身着浴衣的夏祭，秋的红叶狩，冬天考试周下雪天夜里进城吃过的炸鸡看过的玄武湖。 跨年时分，无数生日的相聚。那些短暂重逢，深夜从诗词歌赋，聊到人生哲学的朋友。 2017.08.05 日本久留米 | 筑後川花火大会 总结 类型 项目 适合人数 说明 推荐指数 校园 压马路 2-4 跑步 2-6 约图书馆自习 2-8 看展 看画展 2-4 看话剧 2-4 看 live 2-4 看电影 2-4 看博物馆 2-4 约逛对方公司 2-4 参加展会、沙龙和社区活动 2-6 逛公园景点 2-8 探店 甜品店 2-4 游乐园 2-4 迪士尼、欢乐谷、方特、环球影城 逛宜家 2-4 麻将馆 4 酒吧 2-6 音乐会 2-4 音乐节 2-6 蹦床 2-6 动物园、植物园、科技馆、天文馆 2-6 电玩厅 2-6 密室逃脱 4-8 KTV 2-10 做陶艺 2-10 蛋糕饼干烘焙 2-10 体验馆 2-10 黑暗中的对话体验馆，素描油画体验店 卡丁车 4-10 桌游馆 4-16 真人 CS 6-20 轰趴馆 8-20 运动 潜水 2-4 室内潜水 剑道 2-4 游泳 2-6 滑雪 2-6 打羽毛球 2-6 乒乓球 2-6 冲浪 2-6 室内冲浪、海边冲浪 射箭 2-6 滑板 2-6 骑马 2-6 溜冰 2-8 刀冰、旱冰 棒球 2-8 户外 自驾游 2-5 泡温泉 2-6 露营 2-8 钓鱼 4-8 郊区骑行 4-10 野炊烧烤 4-12 居家 投影仪看电影 2-4 在厨房做黑暗料理 2-4 打游戏 玩 party game 2-8 煮火锅、烤肉 2-8","tags":[{"name":"event","slug":"event","permalink":"http://www.yvonshong.com/tags/event/"}]},{"title":"富士山下/爱情转移/春夏秋冬","date":"2017-03-12T04:00:00.000Z","path":"2017/03/12/fujisan/","text":"富士山下 爱情转移 春夏秋冬 陳奕迅 陈奕迅 荒木 毬菜 富士山下 爱情转移 春夏秋冬 日语翻译 陳奕迅 陈奕迅 荒木 毬菜 拦路雨偏似雪花 徘徊过多少橱窗 どれほど にぶさに 饮泣的你冻吗 住过多少旅馆 まけてたら 要有多迟钝 这风褛我给你磨到有襟花 才会觉得分离也并不冤枉 なみだにきづかないのか 才不会察觉到掉下的眼泪 连掉了迹也不怕 感情是用来浏览 どれほどプライド 怎么始终牵挂 还是用来珍藏 きずつけたら 要有多受伤 苦心选中今天想车你回家 好让日子天天都过的难忘 ほめことばにどうじないのか 才不会被赞美的话所动心 原谅我不再送花 熬过了多久患难 まっすぐなまま 多亏了那么多弯路 伤口应要结疤 湿了多少眼眶 すすめてたら 最终才能与你 花瓣铺满心里坟场才害怕 才能知道伤感是爱的遗产 そのてとははぐれていた 走到了一起 如若你非我不嫁 流浪几张双人床 あたたかいほお 抚摸着你温暖的脸颊上 彼此终必火化 换过几次信仰 ちいさなホクロ 那颗小小的痣 一生一世等一天需要代价 才让戒指义无返顾的交换 「もうすこしこのままでいよう」 “再继续这样呆一会儿吧” 谁都只得那双手 把一个人的温暖 まゆをひそめて 你皱着眉头 靠拥抱亦难任你拥有 转移到另一个的胸膛 きたいするあしたは 所期待的明天 要拥有必先懂失去怎接受 让上次犯的错反省出梦想 ぼくのいばしょがあるのか 是否有我的容身之所呢 曾沿着雪路浪游 每个人都是这样 タバコのけむり 香烟的烟雾 为何为好事泪流 享受过提心吊胆 ふたりのあいだに 弥漫在我们中间 谁能凭爱意要富士山私有 才拒绝做爱情代罪的羔羊 うそもみぬけないほどに 看不清你善意的谎言 何不把悲哀感觉 回忆是抓不到的月光 うしろからだきしめて 假装从后面抱住 假设是来自你虚构 握紧就变黑暗 「あいしてる」 说声“我爱你” 试管里找不到它染污眼眸 等虚假的背影消失于晴朗 かぜからきみをまもった 只为了保护你不被风吹到 前尘硬化像石头 阳光在身上流转 きおくおぼろげ 逐渐模糊的记忆 随缘地抛下便逃走 等所有业障被原谅 かみのにおいだけで 凭着你头发的味道 我绝不罕有 爱情不停站 「わたしも」と 往街里绕过一周 想开往地老天荒 かえしてくれる 我便化乌有 需要多勇敢 としんじてた 坚信你会回应“我也爱你” 情人节不要说穿 烛光照亮了晚餐 どれほどながい 只敢抚你发端 照不出个答案 しんごうまつと 要等多长的信号灯 这种姿态可会令你更心酸 恋爱不是温馨的请客吃饭 いそぎあしがとまれるの 急促的脚步才能减缓 留在汽车里取暖 床单上铺满花瓣 どれほどくらい 应该怎么规劝 拥抱让他成长 へやにいると 要在多黑的屋子里 怎么可以将手腕忍痛划损 太拥挤就开到了别的土壤 なくしたものがひかるの 失去的东西才会亮光 人活到几岁算短 感情需要人接班 まっすぐなまま 多亏了那么多弯路 失恋只有更短 接近换来期望 すすめてたら 最终才能与你 归家需要几里路谁能预算 期望带来失望的恶性循环 そのてとははぐれていた 走到了一起 忘掉我跟你恩怨 短暂的总是浪漫 このおもいでを 现在的我只想 樱花开了几转 漫长总会不满 のこしたいと 留下这仅有的记忆 东京之旅一早比一世遥远 烧完美好青春换一个老伴 しゅんかしゅうとうがとまるころ 直到春夏秋冬停止那天 谁都只得那双手 把一个人的温暖 まゆをひそめて 你皱着眉头 靠拥抱亦难任你拥有 转移到另一个的胸膛 きたいするあしたは 所期待的明天 要拥有必先懂失去怎接受 让上次犯的错反省出梦想 ぼくのいばしょがあるのか 是否有我的容身之所呢 曾沿着雪路浪游 每个人都是这样 タバコのけむり 香烟的烟雾 为何为好事泪流 享受过提心吊胆 ふたりのあいだに 弥漫在我们中间 谁能凭爱意要富士山私有 才拒绝做爱情代罪的羔羊 うそもみぬけないほどに 看不清你善意的谎言 何不把悲哀感觉 回忆是抓不到的月光 うしろからだきしめて 假装从后面抱住 假设是来自你虚构 握紧就变黑暗 「あいしてる」 说声“我爱你” 试管里找不到它染污眼眸 等虚假的背影消失于晴朗 かぜからきみをまもった 只为了保护你不被风吹到 前尘硬化像石头 阳光在身上流转 きおくおぼろげ 逐渐模糊的记忆 随缘地抛下便逃走 等所有业障被原谅 いきするこえだけで 却凭着你呼吸的声音 我绝不罕有 爱情不停站 「わたしも」と 往街里绕过一周 想开往地老天荒 かえしてくれる 我便化乌有 需要多勇敢 としんじてた 坚信你会回应“我也爱你” 谁都只得那双手 把一个人的温暖 もういちどあの 如果再回到第一次与你 靠拥抱亦难任你拥有 转移到另一个的胸膛 めがあうひもどれたら 眼神相对的那天 要拥有必先懂失去怎接受 让上次犯的错反省出梦想 わらってくれたのだろうか 你还会对我微笑吗？ 曾沿着雪路浪游 每个人都是这样 ゆめもげんじつも 如今已经分不清 为何为好事泪流 享受过提心吊胆 わからないまま 梦境与现实的我 谁能凭爱意要富士山私有 才拒绝做爱情代罪的羔羊 またひとりあのきのした 又一个人步履到那棵树下 何不把悲哀感觉 回忆是抓不到的月光 うしろでだれか 假设是来自你虚构 握紧就变黑暗 そっとしたほはば 身后不知是谁的步伐 试管里找不到它染污眼眸 等虚假的背影消失于晴朗 おもいだせないやさしさ 带着似曾相识的温柔 前尘硬化像石头 阳光在身上流转 ほほえんでくれる 没有半点疑虑 随缘地抛下便逃走 等所有业障被原谅 あせることなく 她面露微笑 我绝不罕有 爱情不停站 「かえろう」と 说着“回家吧” 往街里绕过一周 想开往地老天荒 なぜかこのてを 然后不知道为什么 我便化乌有 需要多勇敢 にぎりしめた 牵住我的手 你还嫌不够 你不要失望 めのしたの 只是在她左眼下 我把这陈年风褛 荡气回肠是为了 ちいさなホクロ 那颗小小的痣 送赠你解咒 最美的平凡 はどこかで 好像在那里见过","tags":[]},{"title":"Hexo 进阶与优化","date":"2017-02-20T07:39:00.000Z","path":"2017/02/20/hexo-advanced/","text":"在经过申请域名到搭建hexo，以及利用 Appveyor 实现持续集成，hexo 已经实现了基本的编辑模式，就是我 push 文章的 md 文档，然后会自动发布 hexo 生成的静态网页，只需要 git 环境。接下来我们对博客进行优化，尝试各种插件。 qiniu sync 同步资源文件到七牛，能加速一些资源。 SEO 搜索引擎优化 我们发现百度和谷歌并没有收录到此博客，于是我们去提交我们的站点 Google搜索引擎提交入口 百度搜索引擎入口 提供三种验证方式：文件验证、html标签验证、CNAME验证。 1.文件验证：您需要下载验证文件，将文件上传至您的服务器，放置于域名根目录下。 2.html标签验证：将html标签添加至网站首页html代码的标签与标签之间。 3.CNAME验证：您需要登录域名提供商或托管服务提供商的网站，添加新的DNS记录。 验证完成后，我们将会认为您是网站的拥有者。为使您的网站一直保持验证通过的状态，请保留验证的文件、html标签或CNAME记录，我们会去定期检查验证记录。 建议先使用文件验证，只需要从网上下载验证的html，然后同步到git仓库根目录下，就能成功。 提交sitemap 利用生成站点地图的插件 12npm install hexo-generator-sitemap --savenpm install hexo-generator-baidu-sitemap --save 在博客目录的_config.yml中添加如下代码 12345# 自动生成sitemapsitemap:path: sitemap.xmlbaidusitemap:path: baidusitemap.xml 生成xml文件，然后让搜索引擎去访问，地址是 博客地址/sitemap.xml和 博客地址/baidusitemap.xml 在这里 你可以进行站长管理 https://www.google.com/webmasters/tools/home?hl=zh-CN http://zhanzhang.baidu.com/dashboard/index?site=http://www.yvonshong.com/ CDN加速 百度云加速 更换DNS，或者设置CNAME记录 访问量计数 不蒜子在主题的某个js文件下插入 12&lt;script async src=\"//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js\"&gt;&lt;/script&gt; &lt;span id=\"busuanzi_container_site_pv\"&gt;本站总访问量&lt;span id=\"busuanzi_value_site_pv\"&gt;&lt;/span&gt;次&lt;/span&gt; RSS 我记得以前看到一句话，叫做【支持RSS，是美德。】会用的人当然很喜欢RSS。我们可以利用rss生成插件 1npm install hexo-generator-feed --save 装完hexo-generator-feed后，将其配置到根目录的_config.yml 12345678910# Extensions## Plugins: http://hexo.io/plugins/#RSS订阅plugin:- hexo-generator-feed#Feed Atomfeed:type: atompath: atom.xmllimit: 20 然后你便能在 博客地址/atom.xml 看到生成的rss了","tags":[{"name":"hexo","slug":"hexo","permalink":"http://www.yvonshong.com/tags/hexo/"}]},{"title":"Hexo 利用 AppVeyor 持续集成","date":"2017-02-19T18:18:00.000Z","path":"2017/02/19/hexo-ci/","text":"在第一天尝试了 hexo 之后，觉得这个静态博客远比不上 wordpress 托管到主机上的博客方便，因为太依赖本机环境，需要 nodejs 和 git，每次更新后需要自己生成静态页面（虽然也就两行代码的事情），这一点都不 cool！并且有一大弊端，当你转移电脑的时候，你需要转移你根目录下很多配置文件和之前的 md 文件，（图片等资源文件我是利用插件同步到了七牛的，所以资源文件不用担心），这也需要备份！（这个时候我想到了利用我 Github Pages 的同一个仓库，通过建不同的分支来实现，比如我是 username.github.io 仓库，master 分支为 hexo 生成同步的 web 展示页分支，我新建一个 hexo 分支，就是包含了我根目录下的 themes/, source/, _config.yml,package.json 然后就能在其他环境下重新搭建 hexo） 为了达到自动更新和在线编辑的目的，我遍寻方法。【2020 更新： 最新请直接使用 Github Action】 ide.coding.net Coding WebIDE 是 Coding 自主研发的在线集成开发环境。用户可以通过 WebIDE 创建项目的工作空间，进行在线开发，调试等操作。与此同时，WebIDE 还提供了可分享的开发环境功能，用户可以保存当前的 Terminal 环境，分享给团队的其他成员。 利用 coding WebIDE 远程 hexo 教程 绿色版本的 git 和 hexo 好吧这依旧不酷。。。。就是拷进 U 盘而已 百度云/Dropbox 同步 没差，没有运行环境，也需要重新配置。 利用AppVeyor远端持续集成！ 上一次接触到持续集成这个概念，还是暑假我实习的时候，当时是我们利用公司自己搭的 gitlab，利用 git 提交代码到服务器主机，也有 ftp，然后主机自己会把汇集在一起的代码进行检测，检测通过后发布。（当时去学了下持续集成，持续发布等的概念。。。也算是学到的知识吧） 现在！我们也可以利用持续集成，通过 push md 文档到 git，远端自己 pull，然后自己构建 hexo，然后 push 到我的 github pages 的仓库。（这里我依旧利用了两个分支，master 分支发布，hexo 分支编辑。） 当时主要是看到了这篇文章，介绍了 AppVeyor，当然后面也有查阅到使用 Travis 自动部署 Hexo，而且 AppVeyor 是唯一支持 Windows 的服务商。。（虽然 hexo 也并没有必须 Windows） 下面介绍我使用 AppVeyor 趟的坑 注册登陆 AppVeyor free for opensource project AppVeyor 新建 Project Github 授权，关联相关 repo（更新文档的 repo）（我都是在/blog ）设置项目 setting-general setting-env 配置 appveyor.yml 到文档 repo 需要利用 GitHub Access Token，这玩意儿相当于你的 git 的密钥，GitHub 上生成 token 的相关官方文档 然后由于你 .yml 是在 Github 上公开的，所以你的 token 必须利用 AppVeyor 的加密工具进行加密 12345678910111213141516171819202122232425262728clone_depth: 5environment: access_token: secure: 【替换成自己加密后的 GitHub Access Token】install:- node --version- npm --version- npm install- npm install hexo-cli -gbuild_script:- hexo generateartifacts:- path: publicon_success:- git config --global credential.helper store- ps: Add-Content \"$env:USERPROFILE\\.git-credentials\" \"https://$($env:access_token):x-oauth-basic@github.com`n\"- git config --global user.email \"%GIT_USER_EMAIL%\"- git config --global user.name \"%GIT_USER_NAME%\"- git clone --depth 5 -q --branch=%TARGET_BRANCH% %STATIC_SITE_REPO% %TEMP%\\static-site- cd %TEMP%\\static-site- del * /f /q- for /d %%p IN (*) do rmdir \"%%p\" /s /q- SETLOCAL EnableDelayedExpansion &amp; robocopy \"%APPVEYOR_BUILD_FOLDER%\\public\" \"%TEMP%\\static-site\" /e &amp; IF !ERRORLEVEL! EQU 1 (exit 0) ELSE (IF !ERRORLEVEL! EQU 3 (exit 0) ELSE (exit 1))- git add -A- if \"%APPVEYOR_REPO_BRANCH%\"==\"master\" if not defined APPVEYOR_PULL_REQUEST_NUMBER (git diff --quiet --exit-code --cached || git commit -m \"Update Static Site\" &amp;&amp; git push origin %TARGET_BRANCH% &amp;&amp; appveyor AddMessage \"Static Site Updated\") 这是我第二次接触到 yml，yml 可以转换成 json，语法严格，连冒号后空格都要限制必须只能一个。。。 .yml 仔细一看，都是 bash 操作啊！ 基本完成！ 好吧这是网上的博主。。。我是又遇到 bug 了（配置什么的，最烦了！）当时已经在 appveyor 上 build 了，遇到无数次报错！ 拉取失败过项目配置的 branch 有误，更新文档的 repo 的 branch 才有 yml hexo generate 成功了然后毫无反应。。。。我也不知道为什么 仔细查看 yml我查看 yml，发现 12build_script:- hexo generate 欸只有 generate 呢？我就擅自加了个 hexo deploy然后遇到了权限报错，回想了一下 hexo 在部署的时候，我是需要手动输入 git 的密钥的。。。看来是 git 上有问题，可是我明明有 token 啊？我在查阅相关 key 配置时，发现有个东西叫 credential？？诶 yml 文档里面也有这个欸！ 12- git config --global credential.helper store- ps: Add-Content \"$env:USERPROFILE\\.git-credentials\" \"https://$($env:access_token):x-oauth-basic@github.com`n\" 这里 yml 将环境变量，我传进去的 access_token 用到了，这里应该就是配置 ssh 免密。于是我想通了，不应该用 hexo 自带的部署，直接用 git bash 命令上传，于是我把后面部分修改成 1234- git add -A- git commit -m \"Update Static Site\" - git push origin %TARGET_BRANCH%- appveyor AddMessage \"Static Site Updated\" 这里又回顾了一波 git bash 命令（通常都用 sourcetree 的我。。。） 然后终于成功了！！！ 至此，接下来只需要深入了解 AppVeyor 的自动集成周期等更详细的信息就行了。AppVeyor 还可以根据你 git 更新打的 tag 来触发！欢迎尝试！ （凌晨一点终于搞完 hexo 持续集成，然后又花了一个小时写博客。。。） 最新：用 GitHub Actions 自动化发布 Hexo 网站到 GitHub Pages https://juejin.im/post/6844903961435045902","tags":[{"name":"hexo","slug":"hexo","permalink":"http://www.yvonshong.com/tags/hexo/"}]},{"title":"Hello world on Hexo, my new personal blog.","date":"2017-02-17T16:00:00.000Z","path":"2017/02/17/hello-world-on-hexo/","text":"利用 Hexo 在 Github Pages 上搭建个人博客 之前在腾讯云校园活动里购买了个一年 .cn 域名，于是用上了一阵子的腾讯云，用 wordpress 搭了个博客，可是腾讯云经常宕机需要跑到后台去重启（是的我就是那么简单粗暴😂），一年到头也没宣传也没分享没更什么文章，前几天觉得 Github 能直接给每个仓库开 Github Pages，觉得太有用了，脑子一热，又打算重新搭博客了。挑来挑去，最后买了 shong.win 十年域名，win 可以理解为微软粉嘛，这篇文章主要分享下搭博客的过程。 域名在这里根据续费查询域名商以及挑选后缀在这里找到续费域名最便宜的域名商最后选择了在西部数码 子域名在域名管理处增加 url 跳转，比如 blog.shong.win 跳转到 www.shong.win/blog 这样就实现了子域名。 邮箱有了域名就可以作邮箱， .win 域名由于不太常见，腾讯企业邮箱不支持(2020年注：目前已支持)，所幸的是网易域名邮箱支持163域名邮箱。并在域名管理处增加 MX 记录，起效后便能使用邮箱了。 Github PageGithub Page 是 Github 自带的功能，能够直接给仓库开展示页面，网址是 username.github.io/reponame在 Github 中创建 username.github.io 仓库，然后便能开启 Pages 功能，我们在这个仓库下添加一个名为 CNAME 无后缀的文件，内容是购买的域名，并在域名管理处增加记录，www 的 CNAME 记录，指向 Pages 仓库。然后便能使域名跳转到 Pages 仓库的页面了。 Hexo由于在 Pages 仓库里面自己写每个 web 的话太麻烦了，我们利用在本地 nodejs 环境下搭建 hexo，hexo 会自动将其环境下指定的 markdown 文件渲染成博客文章。自带首页，查询等一系列功能。详情请参见网上别人写的更详细的中文教程 Themes然后我们给 hexo 更换主题，主题的配置也十分简单，参见文档 hexo.io/zh-cn/docs/themes.html 我使用的是 hexo-theme-yilia Pluginhexo 可以使用很多插件，并且内置了多说（让游客可以登录社交媒体账户对你的博文进行评论）配置文档也可以使用七牛同步你的照片和文件，减少对 Github 仓库的占用，配置 hexo-qiniu-sync 接下来就可以愉快写博客啦！ Create a new post12$ hexo new [layout] &lt;title&gt; More info: Writing Sync Pic with qiniu七牛指定了 /static/image/ 这个文件为同步文件夹。 在文章中引用照片可以者直接利用七牛给的网址前缀，文章中直接在图片地址的前面加七牛前缀。 1![](http://personalname.bkt.clouddn.com/static/image/folder/filename.jpg) Run server1hexo s Generate static files1hexo g Deploy to remote sites1hexo d 个人觉得这个博客的好处搭完网站后，我便将自己以前在自己开的微信公众号啊，豆瓣啊，知乎专栏啊，空间啊什么四处写的文章都迁移过来了，毕竟自己掌控的东西更能自主一点。 首先是支持直接将 Markdown 渲染成 web。 自己写的博客，能够在发布后随时更改错别字。 可以迁移之前写的文章。 hexo丰富的插件，能够有多说的评论，主题自带的打赏功能，搜索功能，tag，categories 等功能。 下一阶段接下来想尝试hexo的其他插件，并利用 coding 试一试 coding 的功能，比如 web IDE，增加 coding.yvonshong.com后面可以再尝试在 Microsoft Azure 上搭建 ss（之前一直失败。。。），就能充分利用子域名指向 ip 实现各种功能啦！","tags":[{"name":"hexo","slug":"hexo","permalink":"http://www.yvonshong.com/tags/hexo/"}]},{"title":"2016 年 MSP 的创新之旅","date":"2017-01-23T16:00:00.000Z","path":"2017/01/23/imagine-tour-of-mspchina-in-2016/","text":"时值中国的岁末年关，2017 年已经逐渐拉开了她的序幕。当回首 2016 年，作为 MSP ，这一年里，我们做了什么？让软妹来带大家走近，这一年来，那些可以看到的成长。 微软创新杯在中国的宣传时有一个称号，叫做创新之旅，它讲的是一群工程师，设计师，项目管理者等人，在创新的驱动下，用代码谱写，用 PS 绘制，无数策划，一起描绘迸发的灵感。对于微软创新杯的参赛者来说，这一年，在创新之旅上走得更坚定，而对于 MSP (Microsoft Student Partners) 呢？ 创新4 月末，在经历了几轮微软创新杯区域赛，省赛后，中国区总决赛在海南三亚举行，当时几十位天南海北的 MSP，赶赴三亚，参与 MSP China Summit 和报道 IC China Local Final 这场盛事。 海南炎热的天，为信仰燃烧青春的我们，分组跟进参赛选手，拍摄比赛和大会素材，在网络上进行写稿播报，甚至通宵剪辑视频。 来自全国各地的 MSP 更多关于我们剪辑的视频，请访问微软妹叫你来三亚 优酷播单 7 月，中国区的两名优秀 MSP，同角逐出的 IC 中国区冠军远赴美国西雅图，微软总部，参加 MSP Global Summit 和全球总决赛。 最终来自中国的由东北大学、北京师范大学、UC Berkeley 联合组队完成的 BoneyCare 项目从众多参赛项目中脱颖而出，获得组委会特设的 Ability Award 奖项。 创新杯决赛现场的中国国旗 BoneyCare 是一款基于云端语音识别技术和波形分析技术的口吃辅助治疗 App，结合口吃治疗的传统模式进行 “朗读训练” ，通过提供文章供用户朗读，将语音传至云端并进行分析，同时反馈给用户个性化的评价和指导意见。 BoneyCare 团队 自去年设立，Ability Award 旨在奖励致力于改善残障人士生活的团队项目，有潜力让世界更加包容亲近。BoneyCare 团队未来将重新回到雷德蒙德，在微软专家的帮助下完善自己的项目。 如今又是新的一年了，而我们又在为 2017 年的微软创新杯积蓄着力量，开始了新一轮了校园宣传，不同于往年，我们开创了式新的形，借助 B 站直播 ImageTour 主题讲座，用弹幕来进行互动。 Imagine Tour 主题讲座宣传海报 关于 Imagine Tour 主题讲座请访问 http://aka.ms/ICChina 在路上MSP 其实不仅仅是一个围绕着创新杯而展开的组织，记得在中国区总决赛的时候，我们要为最后一天的晚会进行排舞，在夜晚的楼下，在卫生间对着镜子，练习，编排动作，最后在晚会前教会他人，或许，这对我们来说也是一种成长吧。 来自深圳万科梅沙书院的高中生 MSP 与来自南京东南大学的 MSP 在台上领舞 所以，其实我更想讲的是，在这一年的创新之旅中，关于我们进步的故事。 在线下，我们更为他人的创新贡献着我们渺小的力量，我们发动身边的同学一起共同观赏关于技术的盛宴——微软 Connect 大会；我们带领大家去动手实践，组织编程一小时活动，在编程中发现乐趣；我们试图用热情，去宣传 MSP，让更多的人加入我们这个大家庭。 Connect 大会Build 2016 大会的时候，微软粉丝就像是在过年，在微博上发动态，在微信群里刷弹幕，更有微软科技媒体组织 B 站的同声传译，和邀请嘉宾进行点评。而更技术向的 Connect 大会不同于这种发自于对微软的热爱而自行进行观看的活动，作为 MSP，要组织大家聚在一起观看视频直播，这个形式其实是有一些难度的， 从很多 MSP 的反馈来看，范围不够广，不够吸引人，一直都是线下活动中最突出的矛盾。 可是 MSP 是来自群众，走到群众中去也十分容易，于是我们便以寝室为单位，带动身边的同学，一起进行观看。 根据反馈而制成活动照片墙，覆盖近 20 所高校 Hour of Code这是一个工程师能利用编程改变世界的时代，程序已经逐步渗入我们的日常生活中，更有人呼吁，将编程纳入小学教学。当风靡全球的游戏——“我的世界”，和编程结合在一起，会发生怎样“添码行空”的故事？ 我们逐渐进步，在更大的范围内推广我们的活动。 电子科技大学 河北建筑工程学院 福建警察学院 海南大学 我们开始去感染更多的人，甚至是非计算机领域专业的同学，让他们开始涉猎计算机科学，埋下对编程兴趣的萌芽。 于是，我们开始走向更广大的舞台，我们会举办更大的会议； MSP Recruitment 大连理工大学 我们召集更多的人，我们走向户外。 MSP Recruitment 大连理工大学 不满足于 Build2016 般线上的狂欢，我们开始线下面基，前往北京参加 Microsoft Ignite China 微软技术大会。 Microsoft Ignite China 微软技术大会开幕 微软技术大会期间相约在一起的 MSP 微软技术大会分会场 微软技术大会·来自全国各地的 MSP MSP 参观微软大楼的 Center One 甚至，我们开始走出国门，我们借助网络，和派去西雅图的伙伴，联络起其他国家的 MSP。 7 月 World Final &amp; MSP Global Summit 11 月 MSP in MVP Summit 也正是在 World Final 和 MSP Summit 的两次西雅图之行中，我们参与了原先亚太地区 MSP 兴起的 msp-times 项目，开始逐渐面向范围更大更广阔的世界。 MSP Times 网站首页 最开始喜欢上微软的原因是觉得“科技予力众生”(Empower Us All)，这个概念真的太酷了。后来加入了 MSP，一起迈上了创新之旅，在这途中，曾被三亚秀丽的景色吸引，也曾艳羡去西雅图大本营的伙伴，然而我觉得最重要的，不是收集到的多少微软纪念品文化衫，而是认识的其他 MSP 啊，“在同一片天空下，我们彼此，为着共同喜爱的东西，一起进步，即使相隔很远，我们也会有机会见面，我们也会分享喜好，分享彼此的生活，到见面的时候，像是认识多年的老友。” 这一切的一切，都起源于迈上创新之旅的那一步。 2016 年的创新之旅，有关于微软创新杯的盛大赛事，也有关于 MSP 成长的故事。","tags":[]},{"title":"在世界中心呼唤爱的野兽","date":"2017-01-02T14:00:00.000Z","path":"2017/01/02/socrates-in-love/","text":"“荞麦面/神社庙会/寺院初诣 品味足足日式的新年，无论是知恩院的一百零八声撞钟，还是出来后随着人群走到高台寺，坐在篝火旁分发的热酒酿…”一时，我竟不知道如何开头，学着王家卫的语气说，“那一刻，我很暖。” 2016.12.31 日本京都 | 知恩寺初诣 在等待新年的钟声 今天才意识到，喜欢的乐队年前说的要休团，而 1 月 1 日在台北进行最后一场演出，若想要去他们的演唱会，得是很久以后了。他们完成韦瓦第计划，春夏秋冬四部曲，那我也按四季来讲一讲，这一年来的故事。 春·日光我记得春天的时候，是关于很多很多的阳光与花的故事。 是去这个国家最东边的岛屿上看 21 岁的第一轮日出，开启我一生的黄金时代，时至今日，我仍然希望保留我的那颗少年心，是叫嚣世界的勇气，和对待生活温柔的心。在来霓虹之前讲过了，我也不再赘述。 2016.04.10 浙江舟山东极岛 | 想在 21 岁生日那天在东极岛看日出 是去三亚为热爱和信仰的东西挥洒汗水和燃烧青春，开始一点点的意识到自己的梦想，要为梦想去发力，有一次道别的时候，Lancer 跟我说，“梦想之巅再见。”，现在看着伙伴站上了他曾经说想要站上的舞台，我也要加油。 2016.04.27 海南三亚 | MSP 在进行舞蹈彩排 我在聚光灯下 2016.04.28 海南三亚 | 微软创新杯总决赛 MSP 合影 是在南京的第三年又去看了樱花，去赏了二月兰。也是年前种下的，潜伏了一个冬天的种子发了芽后，在春天开了花，虽然历经短暂的盛放后枯萎了，我也很感谢她的盛放。不过最近很开心的是，曾经以为被我遗弃，深深怨念着的花，在一轮又一轮的冬天后，还是会绽放的，希望遇见的人能明白，哪怕花瓣再微弱，她也准备了一个冬天。 夏/狂热夏天，很多时间都在和院里的伙伴准备材料，跑手续，拿了早大的 offer，曾经如此梦寐以求的霓虹自由行，最后没想到最后以留学的方式成了现实。也很开心一起来的伙伴里，有从大一开始就多少次互相伤害后来变成互相安抚的伙伴，夏天里那次那一夜的暴雨，和 Aki 在学校里到处找喝醉的伙伴，淋了个湿透的大家，现在想起来也仍是如此迷醉的一夜。 2016.07.31 江苏南京 | 30 多度的夏夜 在李文正图书馆前大草坪露营 也因为要留在南京跑手续的缘故，选择了在南京实习，育儿网，实习前端工程师，虽然感觉实习的三个月里没为老东家做太多贡献，但还是挺感谢我的第一个“我司”的。 去写字楼的夏天，是不同于往常的，办公室里的空调与外卖，和外面街道上炽热的太阳，聒噪的蝉栖息在盛夏的梧桐树上，绿荫的街道，突如其来的暴雨，每日早餐的包子豆浆，当然也不能忘了我吃了将近半年的螺蛳粉。也托研究生学长的福住在了四牌楼（这里非常感谢炎帝），也开始有了对未来的想象，我会变成一个什么样的大人呢，由于我善良开朗又自在，我应该会更帅吧（。），以后工作的时候我想要住在公司旁，不用挤漫长的地铁，好好装扮我的小家，不会加太多班，下班后做一些自己感兴趣的事情。三年后，五年后，我们会变成什么样子呢？ 2016.06.13-08.29 江苏南京 | 从写字楼里看到的夏天的南京 2016.08.24 江苏南京 | 炎帝骑自行车接我下班 一起去吃望湖璇宫旋转餐厅 路上遇见的紫峰大厦和夕阳 然后在这座城市呆过了又一个完整的，闷热的，潮湿的，聒噪的夏天.上班的闲暇之余也有与友人相约，去上海找 Annie 和 Mike 玩，去找 zn 和陌陌做黑暗料理，也有多次约饭票去玩期待了很久的事情，入夜后的紫金山，承包了工作日里的溜冰场，在天空树上看见「我♥南京」。 2016.09.18 江苏南京 | 出国前和饭票约在天空树吃饭 外面的「我♥南京」 秋：故事秋天大概是关于离别和收获的，在夏天的末尾，和三火约在学校里拍了一套纪念写真，在操场的看台上，摄影师把 M 豆放在我脸上摆造型，巧克力豆慢慢融化，留下了彩色的残渍。 2016.08.13 江苏南京 | 天气太热了 只能在学校室内拍纪念写真 然后是不断的和伙伴告别，也短暂的回了家，缺席了第四年的同乡会，很久没有在家过的中秋，就像是我前一阵子骑车去学校，看到路边金黄色的银杏树落叶，才想起很多年没有看过成都的银杏了。 2016.08.26 江苏南京 | 东南大学焦廷标馆外 和川群的伙伴一起在新生入学时摆摊这一年 和川群仍然有很多故事 2016.06.19 江苏南京 | 大一学团联的伙伴，学长学姐们要毕业了 然后我开始启程，又去往另一个异国他乡，走上了自己选择的路。 2016.09.20 上海 | 浦东机场 飞机起飞前 计软伙伴的合影 曾经有个问题是，什么才是真正的成熟？撇去关于感情和世故，能为自己做决定，也能为自己的决定负责，这大概就也能算成熟了吧。其实我也未曾后悔过来到南京，现在自然也是不会后悔，因为，我相信眼界的力量。十六岁的时候，说想要哆啦 A 梦里的道具，未来日记和任意门，想要的东西和想去的地方，瞬间就可以。现在，未来依靠自己的双手去谱写，走路去旅行，要去看更广大的世界，一直没有变过。 2016.09.24 日本福冈北九州 | 入学式的正装 冬 未了后来我开始慢慢习惯了离开南京的日子，人生大概是个不断跳出舒适圈，不断甩下包袱，然后才能不断向前的过程。开始习惯了住在离海 10 公里，偶尔心情不好便能去看海，每天自己做饭，上课，骑车。冬假一个人去了关西，大阪奈良和京都，在语言不熟的国度，一个人旅行会孤独么？我大概真的很喜欢现在自己这样的状态，说起来可能是自私，我可以就只照顾自己的心情，旅途中随心所欲，遇见有趣的人可以搭讪，而也不用花太多的精力去和他人相处。其实我能享受一个人的过法，也会去珍惜和伙伴一起的生活。所以我深刻的记得，有一次我和饭票约出去玩，一天下来走了很远，她很累了。晚上从颐和书馆走回鼓楼地铁站，一路我俩都很安静，路过紫峰大厦，我问她，觉得两个人不说话会尴尬么？所幸的是，我觉得我好像遇见了很好的 partner。 2016.07.27 江苏南京 | 闷热的潮湿的夏天 和饭票走在入夜后的紫金山上玩 日本的冬天和南京大概是不一样的，去年冬天还是考试周，和川群的伙伴约图书馆，考试前夕连夜进城去看下雪的南京，炸鸡配啤酒。 2016.01.22 江苏南京 | 最后一年短时间内下了两场雪 回家前一天的凌晨在学校里拍照 今年呢，跨年还是像去年在紫金山顶时一样冷，不过会有了不一样的期待。不过去年的孔明灯，承载着不一样的愿望和不一样的心事，在回忆里也开始变得很美。 2016.01.01 江苏南京紫金山 | 等待新年第一轮日出 2016.12.31 日本京都音羽山 | 最后一轮日落 2016 年就这样再见了，当我试图去叩问自己，这一年，我有什么遗憾么，下一年，我有什么希望么？思来想去，居然是觉得，没有，我接纳了发生的所有事实。 甚至我在回北九州的游轮上继续反思，我是接纳了所有的我。无论是卑怯胆小懦弱的我，还是年少勇敢随心的我，无论了当花枯萎而愤怒将其丢弃的我，还是自己选择了 hell 模式来到异国的我。无论是待人接物总是内心戏太多的我，还是领悟不要逃避要去勇敢面对的我。 这些，都是真的我，都造就了今时今日的我，出现在了你的面前。 而我，要接纳所有真实的我，去反思，去改善，然后努力成为一个更好的，更温柔，更能实现自我价值的我。 至此，关于是 21 岁前最重要的 eva，以及小王子和花的故事，我都将其领悟，收入行囊。不会再去害怕心之壁和玫瑰的刺。 花就算凋零了，只剩下淡淡的香味，也会向着太阳散发出香气。 渐渐的那朵花的香味也会变淡，我们也会长大成熟。不过呢，那朵花，一定会在某处继续绽放。是呢，我们会一直一直，实现那朵花的愿望。 ————《未闻花名》 是呢，我也终于领悟到了，《在世界中心呼唤爱的野兽》，eva 剧场版里最后一话，我接纳了所有的自我。 新的一年有什么愿望？ 我想去今年春天去东京，想回国和伙伴拍毕业纪念写真，顺利毕业！想好好写代码，找到打工，去实习，还有帮伙伴求的御守也能显灵！ 更勇敢，去做想要做的事情！ 世界很温柔，我也要更温柔！ 「おめでとう」「恭喜你呀」 Take care of yourself.","tags":[]},{"title":"那么多的人，你要去哪里","date":"2016-09-19T13:00:00.000Z","path":"2016/09/19/start-on-a-journey-to-japan/","text":"一下子在九龙湖这个地方呆了三年，当我知道我过了 Waseda 的时候，很开心的跟伙伴打电话分享，那天阳光很好，我骑着单车飞驰在回寝室路上，那时候还是春天，却忽然意识到，那我是不是要说再见了。 在不断的毕业的离别里，我学会了隐忍与释怀。我知道离开也终究是不过如此，哪来那么多一生一世。 我试着去回顾这些年里自己的成长，却发现自己疏于表达自己的内心，很难再拥有去讲故事的能力。 读大学的时候，我毅然决定要出川，我知道路途遥远，却是我现在和别人回想起来，这是我最不后悔的一件事情。有很多东西都是你选择之后才会知道是怎样的发展，离开了故乡才会知道自己会思念她。来到东南的那年，军训的时候，我某次回头看过人群去，我发现穿着迷彩服的人们，人是那么的多，又是那么的相像，我开始产生了恐惧，是不是终将平庸在了人群里。 可是我知道我现在最大的问题的知与行。 今年暑假的时候去上海找同学玩，夜也要深了的时候，我搭着伙伴逛校园，我在前面像是在独白一样讲我的一些心事。 “我觉得上海是中国最好的城市诶，这么多年了你喜欢它么？” “我觉得我挺喜欢南京的。” “可是我前一段时间读一本散文集啊，卡尔维诺的《看不见的城市》，他说，其实城市和城市都是相似的，每个城市都会有它的地标，公园，学校等等等等。就像我喜欢成都，很多原因是因为我在那个城市发生了很多的故事遇见了很多的人。所以大概我喜欢南京也是因为，我爱那些在这座城市遇到的人吧。” 2016.09.18 江苏南京 | 摄于天空树 在大学的时候，我又养过花。是啊，继完全没有发芽的玫瑰之后，我终于再次鼓起来勇气去养花，是用玻璃瓶栽的水植风信子。 2016.03.03 江苏南京 | 发芽的风信子 在等待发芽的日子里总是漫长的，最开始要帮她除腐烂的根，每周换一次水。 原来还是会再次充满期望的，当她含苞欲放的时候，我也是满心欢喜。 当发出芽来的时候，我想要去摸新芽，却又不敢，那个瞬间，我才意识到了什么叫做 想触碰却又收回手。 当花绽放的时候，真的好美。 How wonderful you are. 无奈的是花期不长，花期之后，我再也无心打理，去等到她的重生，于是花枯萎之后，我也就狠心的将它丢弃了。 当年没有发芽的玫瑰花种子，还在我身边的抽屉里，而这朵花呢，开花时无比绚烂，我觉得这个世界都不及她的美，可是枯萎的时候却深深的刺痛了我的心，养不到下一轮花期了，枯萎的日子里慢慢丧失了对我的致命吸引力。 不过我还是很感谢那短暂的花期，和没有发芽的种子是不一样的，养花的人和要开的花，都是要努力去绽放的，而我是知道的。可 爱是互相驯养啊，只剩我一个人知道，又有什么用呢。花瓣落尽，累积了足够失望，过了期限。 其实不是因为它不再开花啊，而只是因为，它刺痛到了我。 那些关于未来的美好画面，那些初次相遇的回忆，那些动过心，留过情的人，你们都去了哪里。 大学其实是一个消磨人激情的地方，你容易在校园里开始变得懒散，开始习惯去翘课，考试抱着及格就行的心态，开始习惯平庸。 有一段时间我特别迷茫，而且是过了项目之后，开始面对实习，开始意识到每个阶段都有每个阶段的烦恼。某一天发牢骚，有伙伴来私戳我，问我在烦恼什么，说觉得我其实做的很棒了（讲我传教方面。。。）想来也算幸运，大二下期开始真正接近 Microsoft，去了解它，被它“科技予力众生”的理念所折服，意识到这才是改变世界的事情啊。开始有点喜欢上自己的专业。也找到了奋斗目标。 其实最重要的是，在丰富自己羽翼的同时，找到那份自己喜欢的事情。 当然还有——当机遇来临的时候，紧紧抓住它。 人生是可笑的，回想起两年前的那个闷热的躁动的无处逃避的夏天——人生总是充满了阴差阳错啊。 “还好没转过去”的侥幸与当时的痛楚，隐隐有一丝的讽刺与可笑。 我在六个月前，我也不知道我的人生轨迹又会如此迅速的发生变化。我曾经准备过直接工作，考研，结果却是走项目出了国，还是我曾以为一早比一世遥远的 nihon。 我也曾错过很多机会，错过很多人，比如有些实习的机会，如果那时候定下来的话，可能现在又是不同的一番风景， 当时伙伴跟我说，万一后面有更好的呢。 可是我还是觉得，未来不要管，当下最重要，一定要把握住机会。 在大学的几年历练下来，我总是自诩有着少年心。以前的我总是讨厌大人，讨厌成熟与讨厌故作成熟。 我也不知道是那朵花教给我的么，我已不再畏惧长大，即使成年之后的压力真的如潮水般涌来，特别是明天开始，就要开启 hell 模式了。。。这是自己选了一条看似轻松，其实更艰难的道路。 我不害怕长大啊，我想活成我想要的大人的模样啊。 尤其是在经历了很多事情之后，一个人去看了《小王子》，还有后来的《垫底辣妹》，我开始懂得了父母身上背负的压力，对子女的期许，懂得了他们的隐忍和无奈。 而什么才是我真正的少年心呢？这是个我想了很久的问题。 才不是年少幼稚，曾经轻狂时的肆意妄为。 今年 21 岁生日的那天，想要给自己长大的仪式感，去这个国家最东边的岛屿上看第一缕阳光。我想爱，想吃，还想在一瞬间变成天上半明半暗的云。什么也锤不了我。 后半段出自王小波，虽然他后面说的是：我后来才知道，生活就是一个缓慢受锤的过程，人一天天老下去，奢想也一天天消失，最后变得像挨了锤的牛一样。可是我过二十一岁生日时没有预见到这一点，我觉得我会永远生猛下去，什么也锤不了我。 《龙族》里绘梨衣说，觉得以前的世界是蛇群守护的宝石，很漂亮，很远，很危险。 其实我这几周前开始磨磨蹭蹭写下的文字，居然被前几天收到的一段话的内容讲得所剩无几，那一段话说的是，少年叫嚣世界的勇气和对待生活温柔的心。 所以我想要永远保留我的少年心啊，就是受挫千万次也能爬起来说世界我还要和你再战一次的决心和才不顾前方艰险的狂妄啊！ 我知道接下来的日子会很苦，可是我要去活成我想要的样子，梦里双眼清澈，衣袂翩翩，骑着单车飞驰在路上的少年。 请不要忘记你曾是怎样的小孩，请不要忘记你想成为怎样的大人。 可是觉得大学里面自己要去改正很多地方，我意识到以前的自己对好朋友的毒舌之弊，意识到了要去保护他人的喜悦，明白了朋友之间的感情经营。 曾经和他人吵架的时候，说我只是希望在别人身上延续我转系的念想，这件事情过了很久，我还是在反思，是不是这又是我的那颗病态的自爱的心在作祟。可能看到 stand by me 的一段话，说【大熊是一个可以真诚的为他人的幸福而快乐，为他人的痛苦而悲伤的善良青年】 我是真的希望身边的人能过得很好，当然也希望我也能过得很好，才不是去眼红伙伴取得的成就，而是去真心的为彼此开心，更甚者以之为榜样。 这也是当时和伙伴分享一些关于自己的好消息的时候意识到的。就是那种，嗯，我知道你会为我开心的朋友。 其实最后，我还是想感谢那朵花，虽然花期短暂，虽然故事早就结束了，虽然刺痛了我，虽然…. 我还是很感谢你的盛放，也谢谢你懂我。 前几天从成都回来的动车上，夕阳的余晖，在苍穹之下，将楼和树的影子拉得好长，向东行驶的列车，西下的落日，我明明在朝着日出的地方行进，为什么会感受到有一丝悲伤呢。 是感觉真的要长大了么，可能是吧，触摸不到的时间却化成了有形的光与影，以后会早一个时区，人生的进程会早一年。 可这都是我自己做出的选择啊。 我所梦想做的事情，我正飞奔而来。","tags":[]},{"title":"窗外日光弹指过·席间花影坐前移","date":"2016-08-25T13:03:50.000Z","path":"2016/08/25/temporary-separation/","text":"我也不知道该如何给这组照片取名 可能只是要比较长时间的离开这个地方罢了 再见·东南大学 我记得拍照的那天，大概 38 度 热花了所有的妆… 拍外场简直想自杀… 算啦 明年回来拿毕业证的时候再拍 想起我还有 去爬教学楼楼顶看日落的打算 还没落实 忽而复夏 想起自己在大三的时候 说还没解锁 【登上焦标】 这个成就诶 于是去报了新生文化季哈哈哈 吃了一个夏天的螺蛳粉 喝了一个暑假的维它柠檬茶 虽然没有出去玩 可还是做了很多事情 多年前 伙伴跟我说 “最美的夏天, 永远是没有过完的那一年” 嗯！ 大学三年 每一年都足以难忘 我还是会期待 下一个闷热又潮湿的夏天 夏天 结束了 一直度过的季节 就连道路旁盛开的花也渐渐变化了 那个季节所绽放的花的名字叫什么来着？ 小小的摸上去的话有一点点刺痛 花就算凋零了 只剩下淡淡的香味 也会向着太阳散发出香气 渐渐地那朵花的香味变也会变淡 我们也会长大成熟 不过呢，那朵花，一定会在某处继续绽放 是呢，我们会一直一直，实现那朵花的愿望 要说再见啦。 摄影师：独木成针叶林","tags":[]},{"title":"Hospital Website based on VUE.js+PHP+MySQL","date":"2016-08-01T11:05:39.000Z","path":"2016/08/01/hospital-website/","text":"2016.8.1 在 #265 个 issue, #380 次 merge request 后，阶段性的完成了我们的橙灵诊所管理系统 在入职培训期间，我们实习生组成了一个 team，大家分模块完成一个项目，项目的内容是一家医院的在线诊所管理系统，从医生工作站，护士工作站，前台工作站，到预约-登记-分诊-接诊-医生门诊-检查-治疗-药房-收费全流程，还有系统设置，病人库，排班，统计报表等内容的前后端。 其中我负责的是系统设置里的诊疗费管理 medicalFees.vue 的前后端，接诊页面的 reception.vue 的前端，和其中的报告 report.vue 的前后端，和实验室检查 inspect.vue 的前后端。并在其中两个模块的开发过程中作为 项目的技术选型为前端使用 vue.js+bootstrap，后端使用 PHP+Apache，MySQL 数据库。 在开发的过程中，我有一些如下的感悟： 技术经验的积累PHP 的 CodeIgniter 框架的使用 前端 vue.js 的使用 vue 的理念是数据驱动，利用数据修改样式和样式的内容。 我们的 vue 的开发过程，大概是利用假数据，定好数据的格式，手撸出前端，并做好数据绑定，所以在进行数据绑定的时候，数据的格式尤为重要。然后调试后端，发 POST 请求到数据，处理数据为需要的绑定的格式。 git 的客户端 SourceTree 和 GitFlow gitflow 最主要的是区分了 master-develop，并在 develop 上建立 feature，master 上建 hotfix。 C:\\Users\\daiwe\\Documents\\picbed\\o_git-flow-nvie.png 踩的坑AJAX 的 POST 请求是异步操作 一些软件设计MVC 架构写后端 PHP 时，MVC 的理念是将接口和实现分离，controller 层接受数据，并对数据利用框架进行安全过滤（而不是让 POST 贯穿整个 controller-model），通过传参的方式调用 model 层进行操作数据库。 所以在 model 层里面写如何操作数据的方法，在 controller 层里面写业务逻辑和如何调用 model 里的方法。 model 操作数据库，control 调用操作，view 展现视图 甚至是 MVVM（Model-View-ViewModel） 模块化在写前端的过程中，由于我们是分组，对不同的模块进行开发，所以我们对我们自己负责的部分无法很好的设计，比如在诊所管理项目中，我们很多地方需要用到病人信息的展示板 patientInfo.vue， 结果各个小组都是按自己的方法和格式去实现前端发 post 和后端读取数据库再返回，不同格式的绑定。 这增大了前端代码的冗余和后期维护的难度。显然应该在模块划分的时候，尽量的解耦合和去冗余。 解耦合的目的，不仅仅是利于开发过程中的模块划分，更方便与小组的人员分工，达到并行的开发。 软件开发流程我也是第一次接触到公司里面的开发的过程，期间最主要的还是 git 的使用，以及 merge request 和 issue。 理解产品需求，与产品经理问清楚，业务的逻辑细节，前端操作的细节。 整理需求，并与产品沟通是否正确。 理清数据库结构，和业务操作表的流程 根据需求列出接口，可以写出 api doc，api doc 的内容涵盖 12345api {post} urlapiParam 各个参数apiParamExample 发送 post 请求的参数格式apiSuccess 返回的数据格式类型，比如 jsonapiSuccessExample 成功时返回的数据格式 然后进行前后端的开发 后端利用 Postman 进行测试 进行前后端连通的测试 使用 git 合并最新的 develop，然后发送 merge request to develop 等待提 issue，然后自己在 develop 上建立 hotfix 或者 feature，关联到 issue 号 在公司的软件开发，不同于个人开发的地方主要是协作，在代码层面，是需要利用 git 解决冲突，拉取最新的小组分支或者 develop 分支 团队协作和在人力的协作方面，这次我出现了很多问题，我的两个模块的两个小组，都有着分别不同程度的 delay，我们的模块的复杂程度是一方面（需要操作三层的业务数据表），我的分工也是一个方面。 软件工程的理解软件工程不同于 Computer Science 计算机科学的地方，在于它更强调一个工程的概念，所以我们在课堂里学到软件工程导论，软件项目管理与实践，都是当时无关紧要的课，现在更突显价值。","tags":[{"name":"web","slug":"web","permalink":"http://www.yvonshong.com/tags/web/"}]},{"title":"MatlabLens","date":"2016-06-11T11:05:39.000Z","path":"2016/06/11/matlablens/","text":"本程序是基于 MATLAB 的 GUI 界面的类 Office Lens 应用，还有很多待提高 其中主要功能有 GUI 界面，方便快捷的操作 文件选择功能 透视变换 图像手动剪切 图像降噪 调节对比度 图像二值化 无限撤销功能 保存图像 详细说明 GUI 界面这次是简单的尝试了下 matlab 自带的 VB 似的 GUI 界面，异常的好用，连监听啊什么的都不用自己写。 文件选择功能利用 uioutfile 函数，调用 Windows 熟悉的文件选择 透视变换透视变换时本程序效率最低，大概需要跑 2min 的功能，利用 MIT 的算法，从左到右从上到下选择要进行透视变换的四个点，这四个点之间的图像将被处理变换为矩形，其原理是将这四个点的坐标，转换为矩形定点，联立求解四元四次方程组，得到透视变换矩阵，将透视变换矩阵作用到四个点中间的其他坐标进行变换。效率最低的地方应该就是解方程的步骤。 图像手动剪切利用 imcrop 函数，本想在透视变换后直接利用顶点坐标进行裁剪，但其实透视变换后，处理后的图像会对变换后没有像素的地方进行黑色填补，导致顶点坐标发生变化。 图像降噪对图像进行进行高斯滤波。 调节对比度 图像二值化利用 im2bw 进行二值化，本想是在二值化后进行 OCR 功能，但微软的 API 接口变了，百度的接口变成收费的了，而且还需要考虑利用 MATLAB 调用 Python，所以没有实现。 无限撤销功能在每一步进行图像处理时，将图像 push 进一个数组，撤销时 pop 出数组并移动指针。不过发现想增加前进功能时，需要考虑很多操作逻辑，必须撤销三步之后又操作了一步，这个时候又前进，等等等等，所以取消了前进功能。 保存图像将处理后的图像保存到本地。 感想最可惜的是没有实现 ocr 功能，和自动进行边缘检测之后进行透视变换，再自动剪裁。OCR 需要的是接口，自动边缘检测的难度在于图像二值化的效果必须很理想，然后选择合适的算子。令人开心的是，已经基本完成大部分功能，自动化是进行优化。不过以下有一些疑问： 如何将 .m 文件编译成不需要 MATLAB 的可执行文件 如何对透视变换进行优化","tags":[{"name":"matlab","slug":"matlab","permalink":"http://www.yvonshong.com/tags/matlab/"}]},{"title":"深入理解卷积","date":"2016-04-13T11:05:39.000Z","path":"2016/04/13/convolution/","text":"卷积相关知识的梳理 内积(a1,b1,c1)·(a2,b2,c2)=a1*a2+b1*b2+c1*c2 相关有一个和卷积很容易混淆的概念，叫做相关 首先我们来比较一下： 自相关函数 R(x)=∫f(t)f(t-x)dt 移-积-和 卷积 g(x)=∫f(x)f(t-x)dt 褶-移-积-和 相关和卷积只差一个反转的过程 相关描述的是：把一个信号 平移一段后，与原函数的相似程度 具体怎么个【褶-移-积-和】后面再讲 相关的物理意义相关最早是用来概率论中描述随机变量之间关系的概念，如相关系数。 实际上信号一般是一个随机过程，为了实现信号的检测、识别与提取，经常要了解两个信号的相似性，或一个信号经过一段延迟后自身的相似性。但相关系数有缺陷。 因为分子是两个信号的内积，如sinx和cosx,从波形上看只是相位不同，而相关系数为零（因为正弦和余弦正交），因此引进相关函数，将原来两函数直接内积改为一个函数和另一个函数的延迟作内积。 其实二者从概念没有任何联系。由于相关函数第一个函数和第二个函数的延迟作内积（内积就是乘积累加），所以相关函数不满足交换，而卷积可以。延迟不同结果不同，所以相关系数是个数，而相关函数是函数，是延迟的函数。 卷积在泛函分析中，卷积是通过两个函数f和g生成第三个函数的一种数学算子，表征函数f与 经过翻转和平移的g 的重叠部分的累积。如果将参加卷积的一个函数看作区间的指示函数，卷积还可以被看作是“滑动加权平均”的推广。 一维信号g(x)=∫f(x)f(t-x)dt 1234褶：f(x) -&gt; f(-x)移：f(-x) -&gt; f(t-x)积：f(x)f(t-x)和：∫f(x)f(t-x)dt 反转平移之后重叠部分做内积(乘积累加) 某种意义上，对任意一个t，h(t)对它做了一个相同模式的贡献／变化 一些便于理解的例子辐射：设某核电站事故中，某工作人员每天到抢险现场工作T分钟，接受一定剂量的辐射，辐射会自然地衰减，如此工作N天，如何计算总的辐射量？ 信号：一个物体时刻会受到一个周期性的固定模式的的能量的冲击。并且，物体在受到某个时刻的能量后，会按照一个关于时间的函数进行变化。如何计算 某个时刻 之前所有冲击信号的遗留和现在受到的冲击信号的能量之和？ 复利： 本金 第一年 第二年 第三年 第四年 第五年 +100 100*(1.05)^1 100*(1.05)^2 100*(1.05)^3 100*(1.05)^4 100*(1.05)^5 +200 200*(1.05)^1 200*(1.05)^2 200*(1.05)^3 200*(1.05)^4 +300 300*(1.05)^1 300*(1.05)^2 300*(1.05)^3 +300 300*(1.05)^1 300*(1.05)^2 +200 200*(1.05)^1 +100 多项式乘法： 多项式a(n1)乘多项式b(n2) 对应的系数矩阵(向量)为a[最高次的系数,…,常数项系数] 和 b[最高次的系数,…,常数项系数] 多项式相乘结果的系数为c[最高次的系数,…,常数项系数] 1c(i)=\\sum_{k=0}^i a(k)b(i-k),i=0~(n1+n2) 二维图像对应一维信号处理过程，把时间t的定义域空间换成图像的平面矩阵形状空间 二维离散卷积公式 二维连续卷积公式(f*g)(t1,t2)=∫∫f(x1,x2)g(t1-x1,t2-x2)dx1 dx2 一些例子的理解将图像按照模板进行处理对于图像而言，离散卷积的计算过程是模板翻转，然后在原图像上滑动模板，把对应位置上的元素相乘后加起来，得到最终的结果。如果不考虑翻转，这个滑动-相乘-叠加的过程就是相关操作。 滤波比如最简单的高斯模板，就是把模板内像素乘以不同的权值然后加起来作为模板的中心像素值，如果模板取值全为1，就是滑动平均；如果模板取值为高斯，就是加权滑动平均，权重是中间高，四周低，在频率上理解就是低通滤波器。 投影因为当前模板内部图像和模板的相乘累加操作就是图像局部片段和模板的内积操作，这个过程可以看作图像的片段的空间 向 模板空间上的投影，一幅图像和一个模板卷积，得到的结果就是图像各个片段在这个空间上的投影累加和。如果这样的模板有一组，我们可以把这一组看成一组基，常见的如用一组Garbor滤波器提取图像的特征。 总的来说在泛函分析中，卷积是通过两个函数f 和g 生成第三个函数的一种数学算子，表征函数f 与经过翻转和平移的g的重叠部分的累积。如果将参加卷积的一个函数看作区间的指示函数，卷积还可以被看作是“滑动加权平均”的推广。 （赋予不同的权值的想法）（加权累加） 二者在时间上不一定同步。卷积关心的正是二者在时间不同步的情况下（各个时间）激励和响应作用的结果。并且，这种响应是非因果的，即是不仅要考虑某一时刻输入信号的响应，还要全部包含这之前所有输入的响应。 离散卷积：图像本身是离散的 所以权值也是离散的,模板是格子般的 忽略远距离的像素点的低权值影响，所以模板是有限的格子 权值分布的按照不同的函数分布，便是不同的卷积核，只不过受像素格的影响，是取离散的值。 整体就是个：褶 -&gt; 移 -&gt; 积 -&gt; 和 的过程 卷积的类型离散卷积和连续函数的卷积线性卷积和循环卷积通常说卷积时指的是线性卷积，在信号处理领域是跟线性时不变系统有关的一种运算 循环卷积我理解是使用DFT(FFT)计算线性卷积时的衍生品。 一些问题：为什么要反转？ 卷积的其中一方参与者是冲击响应，它所描述的的曲线方向与时间流逝一致。而卷积的输出等于以前的信号效果累加，这个累加必然从当前时间点逆时间流逝方向进行的。很显然，离当前时间越近，那个输入残留在系统中的回响就越大。 也可以从之前的多项式乘法的解释上理解。 卷积核可不可以是改变的？某种意义上，对任意一个t，h(τ)对它做了一个相同模式的贡献／变化 h(t)能否是变化的？ g(x)=∫f(x)(t-x)dt —–&gt; g(x)=∫f(x)f(x,t-x)dt 比如考虑边缘情况，边缘时模板就不相同了。 模板的大小是有限的二维卷积时 什么情况才能忽略远距离的像素值呢？万一远距离的像素的权值更高呢？ （收敛的想法 h(t)得是收敛的） 线性时不变系统连续时间系统与离散时间系统 线性系统有两种定义： （1）根据系统的输入和输出关系是否具有线性来定义满足叠加原理的系统具有线性特性。即若对两个激励x1(n)和x2(n)，有T[ax1(n)+bx2(n)]=aT[x1(n)]+bT[x2(n)]，式中a、b为任意常数。不满足上述关系的为非线性系统。 （2）根据组成系统的元件特性来定义由线性元件和独立电源组成的系统。 时不变系统 系统的参数不随时间而变化，即不管输入信号作用的时间先后，输出信号响应的形状均相同，仅是从出现的时间不同。用数学表示为T[x(n)]=y[n]则 T[x(n-n0)]=y[n-n0]，这说明序列x(n)先移位后进行变换与它先进行变换后再移位是等效的。 线性时不变系统 既满足叠加原理又具有时不变特性，它可以用单位脉冲响应来表示。单位脉冲响应是输入端为单位脉冲序列时的系统输出，一般表示为h(n)，即h(n)=T[δ(n)]。 任一输入序列x(n)的相应y(n)=T[x(n)]=T[ δ(n-k)]； 由于系统是线性的，所以上式可以写成y(n)=T[δ(n-k)]； 又由于系统是时不变的，即有T[δ(n-k)]＝h(n-k)； 从而得y(n)=h(n-k)=x(n)*h(n)； 这个公式称为离散卷积，用“*”表示。 卷积定理两个函数卷积后的傅里叶变换=两个函数的傅里叶变换后的乘积 卷积定理指出，函数卷积的傅里叶变换是函数傅里叶变换的乘积。即一个域中的卷积对应于另一个域中的乘积，例如时域中的卷积对应于频域中的乘积。这一定理对拉普拉斯变换、双边拉普拉斯变换、Z变换、Mellin变换和Hartley变换等各种傅里叶变换的变体同样成立。在调和分析中还可以推广到在局部紧致的阿贝尔群上定义的傅里叶变换。利用卷积定理可以简化卷积的运算量。对于长度为n的序列，按照卷积的定义进行计算，需要做2n-1组对位乘法，其计算复杂度为O(n^2)；而利用傅里叶变换将序列变换到频域上后，只需要一组对位乘法，利用傅里叶变换的快速算法之后，总的计算复杂度为O(n*log n)。这一结果可以在快速乘法计算中得到应用。","tags":[{"name":"matlab","slug":"matlab","permalink":"http://www.yvonshong.com/tags/matlab/"}]},{"title":"深入理解快速傅里叶变换","date":"2016-04-09T11:05:39.000Z","path":"2016/04/09/fft/","text":"傅里叶变换相关知识的梳理 傅里叶变换的物理意义: 时间域 &lt;-&gt; 频域的转换傅立叶原理表明：任何连续测量的时序或信号，都可以表示为不同频率的正弦波信号的无限叠加 推荐一篇关于傅里叶变换的文章 - 掐死傅里叶教程 傅里叶变换示意图 时域-相位 时域-频域-相位 傅里叶变换的种类 变换 时间 频率 连续傅里叶变换 连续，非周期性 连续，非周期性 傅里叶级数 连续，周期性 离散，非周期性 离散时间傅里叶变换 离散，非周期性 连续，周期性 离散傅里叶变换 离散，周期性 离散，周期性 mapping 时间的连续 &lt;–&gt;频率的非周期性 时间的离散 &lt;–&gt;频率的周期性 时间的非周期性 &lt;–&gt;频率的连续 时间的周期性 &lt;–&gt;频率的离散 FFT是DFT(离散傅里叶变换的快速实现) 快在哪里？DFT：按定义求值需要O(N^2)次运算 FFT：利用库利-图基算法，以分治法为策略递归地将长度为N=N1*N2的DFT分解为长度为N1的N2个较短序列的DFT 通过许多小的更加容易进行的变换去实现大规模的变换，降低了运算要求，提高了与运算速度， 复杂度降低到O(N*logN)。FFT不是DFT的近似运算，它们完全是等效的。 时间抽取算法 基2按时间奇偶抽取的FFT 频率抽取算法 也分奇偶 W_N^nk=e^(-j2Pi*nk/N) 对称 周期 可约性 特殊点 傅里叶变换的种类与之间的关系 为什么选择正弦函数？正弦函数的优势正交基 压缩拉伸平移 傅里叶变换的优势 傅立叶变换是线性算子,若赋予适当的范数,它还是酉算子; 傅立叶变换的逆变换容易求出,而且形式与正变换非常类似; 正弦基函数是微分运算的本征函数,从而使得线性微分方程的求解可以转化为常系数的代数方程的求解.在线性时不变系统的卷积运算为简单的乘积运算,从而提供了计算卷积的一种简单手段; 离散形式的傅立叶的物理系统内,频率是个不变的性质,从而系统对于复杂激励的响应可以通过组合其对不同频率正弦信号的响应来获取; 著名的卷积定理指出:傅立叶变换可以化复变换可以利用数字计算机快速的算出(其算法称为快速傅立叶变换算法(FFT))。 弊端只能处理线性 傅里叶变化：只能对能量有限的信号进行变换（也就是可以收敛的信号），无法对能量无限的信号进行变换（无法收敛的） 拉普拉斯变换（拉氏变换）：在原先的傅里叶变换公式中乘以一个衰减因子，使得能量无限的信号也能进行时频变换。 Z变换就是离散信号的拉氏变换。 只能在全局范围内处理信号 短时傅里叶变换 - 加窗与延拓 小波函数 - 加窗 时域和频域的局部化矛盾 -频域分辨率和时域分辨率高精度不能同时达到 1从傅里叶变换公式可以看出，它是以正弦波及其高次谐波为标准基的，因此它是对信号的一种总体上的分析，具有单一的局部定位能力，也就是在时域的良好定位是以频域的全部信号分析为代价的，对频域的良好定位是以时域的全部信号分析为代价的，时域和频域分析具有分析的矛盾，傅立叶变换的频率谱中要么频率是准确的而时间是模糊的，要么时间是准确的而频率是模糊的，它不可能同时在时域和频域都具有良好的定位的能力。 -时域和频域信息的绝对分离 1在频域不包含任何时域信息，在时域中同样找不到任何频域信息的影子。对于傅立叶频谱中的某一频率，不知道这一频率是何时产生的，只能从全局上分析信号. 不能处理非平稳非线性时变信号 基只能是唯一的么？正交基的概念 其他函数变换：小波变换（小波函数）、hht变换(本征模态函数) 二维图像的频域一维信号的频域，我的个人理解 12将信号拆分为几种频率的信号，而对于某一个频率的信号来说，频率决定了这个信号变换的快慢。 图像的频率是表征图像中灰度变化剧烈程度的指标，是灰度在平面空间上的梯度。 如：大面积的沙漠在图像中是一片灰度变化缓慢的区域，对应的频率值很低；而对于地表属性变换剧烈的边缘区域在图像中是一片灰度变化剧烈的区域，对应的频率值较高。 实际上对图像进行二维傅立叶变换得到频谱图，就是图像梯度的分布图，当然频谱图上的各点与图像上各点并不存在一一对应的关系，即使在不移频的情况下也是没有。 傅立叶频谱图上我们看到的明暗不一的亮点，实际上图像上某一点与邻域点差异的强弱，即梯度的大小，也即该点的频率的大小（可以这么理解，图像中的低频部分指低梯度的点，高频部分相反）。 一般来讲，梯度大则该点的亮度强，否则该点亮度弱。这样通过观察傅立叶变换后的频谱图，也叫功率图，我们首先就可以看出，图像的能量分布，如果频谱图中暗的点数更多，那么实际图像是比较柔和的（因为各点与邻域差异都不大，梯度相对较小），反之，如果频谱图中亮的点数多，那么实际图像一定是尖锐的，边界分明且边界两边像素差异较大的。 对频谱移频到原点以后，可以看出图像的频率分布是以原点为圆心，对称分布的。将频谱移频到圆心除了可以清晰地看出图像频率分布以外，还有一个好处，它可以分离出有周期性规律的干扰信号，比如正弦干扰，一副带有正弦干扰，移频到原点的频谱图上可以看出除了中心以外还存在以某一点为中心，对称分布的亮点集合，这个集合就是干扰噪音产生的，这时可以很直观的通过在该位置放置带阻滤波器消除干扰。 代码演示1234567891011121314151617181920rgb3=imread('pic.jpg');I=rgb2gray(rgb3);FFT=fft2(I);IFFT=ifft2(FFT);figure(1);subplot(2,2,1) imshow(I); title('the original gray picture');subplot(2,2,2) imshow(FFT); title('the spectrum after FFT');subplot(2,2,3) imshow(fftshift(log(1+abs(FFT))),[]); title('shift -&gt; (log(1+abs(the spectrum))');subplot(2,2,4) imshow(uint8(IFFT)); title('ifft'); 彩色图像的傅里叶变换分为RGB三通道执行FFT 傅里叶变换的误差在测试原图像和反傅里叶变换后的图像之间的差异时，我将原图像的矩阵强制类型转换为double，后与反傅里叶图像的矩阵相减。所得矩阵遍历求和为非零，也就是存在误差。 并且单独用两重for循环测试了图像中间的部分，发现并不是边界的问题。 而另一个求和是都转换成uint8 8位无符号整数，精度下降，我有理由推测，是精度的问题。而非吉布斯现象。 FFT在数学上是完全可逆的。 但是数字在计算机的中的存储是有精度的。 因为这个变换采用了浮点运算，因此需要足够的精度，以使在出现舍入误差时，结果中的每个组成部分的准确整数值仍是可辨认的。为了FFT的舍入误差，应该允许增加几倍log_2(log_2(N))位的二进制。以256为基数、长度为N字节的数可以产生大到(256)^2N阶的卷积分量，所以为了正确存储，需要16+log_2(N)位精度，若数i是浮点尾数的二进制位数，则有条件： 16+log_2(N)+x*log_2(log_2(N))&lt;i 如果i=24，对于任意感兴趣（N&gt;256）的N值，单精度是不合适的；如果i=53，也就是采用双精度，则允许N大于106，相当于几百万十进制位。所以，用FFT作大数乘法时，向量数组选用双精度类型。 吉布斯现象吉布斯现象Gibbs phenomenon（又叫吉布斯效应）： 将具有不连续点的周期函数（如矩形脉冲)进行傅立叶级数展开后，选取有限项进行合成。当选取的项数越多，在所合成的波形中出现的峰起越靠近原信号的不连续点。当选取的项数很大时，该峰起值趋于一个常数，大约等于总跳变值的9%。 由于子图像的变换系数在边界不连续 ，而将造成复原的子图像在其边界也不连续 。于是由复原子图像构成的整幅复原图像将呈现隐约可见的以子图像尺寸为单位的方块状结构，影响整个图像质量 。当子图像尺寸较小时更为严重。 阶跃信号不可以用正弦波叠加得到(能量近似)。 解决方法二维余弦变换（DCT）代替二维傅里叶变换。 基本思路为：用一个对称的 2Nx2N 像素的子图像代替原来NxN 子图像。由于对称性， 子图像作二维付立叶变换，其变换系数将只剩下实数的余弦项。这样，即可消除Gibbs现象。","tags":[{"name":"matlab","slug":"matlab","permalink":"http://www.yvonshong.com/tags/matlab/"}]},{"title":"兰因絮果","date":"2016-02-24T18:10:00.000Z","path":"2016/02/24/vicissitudes/","text":"最近脑海里一直回荡着一句「好多年好多年以后」。 你只是学着令狐冲感慨，在一个地方待得太久，就容易忘记时间。所以你才忽然又开始想逃离，想不顾一切，又甚至想抛弃所有。 你在别人 20 岁生日的时候告诉她，说愿有往事可回首，可是在自己寒假回高中那天，跟老师聊天，说道高三那段时间的好。究其原因，竟是今不如昔，所以下了决定不再回头。恍惚间大学学生生涯已经要到了最后，会懊悔会顿挫会逃避么，不不不以上都不是你的性格所幸也就并没有这么做。你终于学会了将所有愧疚坦然，学会了将所有秘密释然。 你仍自诩是少年，也偏偏做着年少妄知妄为的事，终究是不懂感情。以前你总是纠结，那个困扰了你多年的“爱自己”的问题。原来时间终究是最好的老师，给了你圆满且逻辑自洽的答案。只不过最后，都化成了在合适的时间，无声的倾诉。 「后来我终于知道，它并不是我的花，我只是恰好 途经了它的盛放。」 可什么是爱？什么又是孤独呢？ 茕茕孑孑二十年，依旧是不懂爱也不懂情。 想起哪一次和远洋的基友视频，聊完他人近日的状况后问道： “你还有什么想问的么？” “恩。 你最近过得好不好。 你太孤独啦。” 高中的时候，一直都是和基友吃饭，期间有段时间关系冷淡，也转投和别人一起吃饭。导致了后来有一次，跟别人聊，说，现在好后悔毕业照没有和他站在一起。大学开始，你却兀的习惯了独处。所幸的是，毕业后关系也更融洽了。 结果是经年累月的独处，14 年你去独自旅行，可是并不觉得孤独。 跟别人谈起孤独的等级，你说自己是 20 岁生日的时候想去玄武湖看日落，然后一个人吃了一顿火锅，点了你最喜欢吃的无骨凤爪鸭肠毛肚脑花还有惟怡，因为一个人行为诧异而令老板娘印象深刻，可是并不觉得孤独。可惜后来遇见的人仍会给你以疑惑，你假托领悟到生老病死，爱别离，怨憎会，和求不得。 求不得，怨长久，放不下。 直到有一天，你重读到高中时读过的那篇周国平的《爱与孤独》你明白了，原来孤独分为两种，形而上学的孤独致使自己产生人生哲思，而这种孤独产生的爱，是大爱，是无边界予众生的爱，就像高中思“爱自己”而无果，转于诉诸神爱与宗教一样。而形而下学的，社会性质的孤独，迫使人走向他人和人间的爱，若求不得，便如兰因絮果。可是你却也会觉得，好像有时候两个人在一起的状态也不错。一个人有一个人的活法，两个人有两个人的生活。你说你不愿将就，嗤之以鼻，我说放屁，你根本就是还没彻悟什么是爱。比如你还不懂为什么有些形而下学的孤独产生的爱是私有排他且独占的。还有这么多年你为什么执着于那个问题？ 你是不是怕自己在还没明白的时候就开始拒绝，害怕形而下学的孤独，害怕失望，害怕求不得。你害怕的是在没明白爱的实质的时候，发现爱，的目的是利己。 尽管你小心翼翼的保留，但似乎一松手，就要云散，你立马就要化身成铁人，无坚不摧。 可我不要这种无坚不摧。 你根本就不相信却又一步步踏入迷途，很多人感情里付出太多而却想要平等的回报，这便迷失了初衷。 所以大概至尊宝才会参透世间的感情过于狭隘，想取得大乘佛法渡众生。绕来绕去又回到了大爱。 好多年前你有次超级感慨与失落的时候，你在种花，那个时候每个课间把花盆带到走廊晒太阳，可惜的是花没有长出来。后来你逐渐看清了，收藏起花的种子，也学会了一些种花和选花的知识，可是却没有勇气再种花，怕的就是失望。 好多年好多年以后，对，就是那句「好多年好多年以后」，你重新有了种花的勇气。买了风信子，花语恰好是「重生的爱」，爱也是互相驯养。 更会努力去尝试，比如为了克服 stagefright 敢当同乡会的主持人，hackathon 的主持人，想去上焦标的舞台，敢于夜深翻过墙去找人，敢做勇敢的事而不再是最后空留遗憾。 可是你怎么能害怕花不是只为你活而欲将其视为普通的花呢。 其实我只是进退两难罢了。还有好多关于羁绊与责任，爱的形式与方法的感悟，还有好多关于一改高二时的 ATF，领悟到豪猪之间的距离，以后再说吧。 感谢你，教我收余恨，免娇嗔，且自新，改性情，休恋逝水，苦海回身，早悟兰因。","tags":[]},{"title":"随轻轨呼啸而过的夏天 -- 记重庆社会实践之消失的棒棒","date":"2015-08-30T18:02:36.000Z","path":"2015/08/30/summer-in-chongqing/","text":"在开学一周内，我敲下了这篇感悟，在开学前的十天里，我们六人，前往了山城重庆，去调查那即将消失的棒棒。 我是一名四川人，自然对重庆有着特殊的印象，无论是巴蜀人特爱的辣椒，夏天也要吃出满头大汗的火锅，还是川渝地区的美女。巴与蜀，1997 年，重庆从四川省分出作直辖，自然我是年幼无感，这次却是我记事以来第一次踏上这片土地。 论说重庆和四川的差别，自然是重庆这依山而建的城市，轻轨在山体与楼房之间穿梭，嘉陵江汇流，这几天下来，对重庆的感觉颇为微妙。巴蜀因湿寒而特爱火锅，以此祛除体内的寒气，火锅当然是麻油加酸，成都会加耗油，绝非江浙地区的花生酱等佐料。重庆的火锅与成都的火锅又不太相同，他强调的是辣，而特辣的级别却并不会另我难以接受（可能是成都人练出来的？我伙伴都挺难以承受这辣的，甚至得将食材在锅里煮后得在白水里涮一番褪去表面的辣油），而成都更偏重于麻，火锅里的花椒有时挑出来能放满一碗，辣在舌后，麻在唇口。一说到川菜，人们就会想到大把的花椒和辣椒。说到两地到底哪边的饮食更美味，其实也是一个非常纠结的问题。重庆代表认为，大菜当然是重庆江湖菜取胜，麻辣鲜香俱全，而成都方面在小吃上做得更好，口感也更全面。而成都代表则认为重庆菜一味麻辣，而且“乱劈柴”，就拿一道回锅肉来说，重庆人可以用洋葱、白菜、胡萝卜、花菜等多种配料，成都人则只会用蒜苗。 在与房东接触的时候，我便深刻感受到川渝女性之间的差异，房东是一名九几年重庆工商大学毕业的地道重庆人，在我们采访的时候，她使用的普通话与他人并无二异，但在接电话的时候使用重庆话倒令我立马感受到了重庆女性的火辣与强势 ，有人评价的是重庆女性脾气火爆，而成都女性多委婉可也够折腾人，各种滋味，欢迎各位来感受。而房东使用的方言，虽然在外地人听来，成都话重庆话差别不大。可在两地市民听来，这区别可大了。成都话婉转，儿化音多，有很多饶舌音；重庆话很多平舌音，不拖泥带水。成渝两地的人，都喜欢模仿对方的口音说上那么几句调侃的话。 而城市方面，重庆层层叠叠的建筑，阳台外面的山与高架，轻轨穿山而过，洪崖洞从一楼进，顶楼出的时候又是一条马路。甚至下到第 5 楼，中间居然还藏着又一条街道！不得不佩服。 对这座城市的印象大致如此，夏天的重庆，烈日，轻轨，地表温度高得要烫熟鸡蛋，吃一碗酸辣粉回味无穷，倾斜的车道，无数的台阶，这座三维立体城市，也就造就了这里泼辣的人们，造就了朝天门码头卸货豪爽的挑夫，在无数梯子和倾斜的坡道上劳作的搬运工，这些人，也就是我们即将要采访的山城棒棒军。 我作为四川人，在团队中主要做翻译采访的任务，犹记小的时候还在电视上看过一部电视剧，叫做《山城棒棒军》，可能这就是我未来重庆之前，对我们的社会实践的全部印象。其实四川重庆云南贵州这一带的方言都很容易让外地人听懂，而在社会实践的过程中，我通常用方言，也就是这边的西南官话，在外和商家路人进行交涉，跟棒棒们进行聊天，将采访中方言中最令人疑惑的——也就是方言中的特殊用语翻译给我的伙伴听，这倒令我觉得十分有趣。比如最经典的，“摆龙门阵”，就是聊天的意思，“dia 东西”就是提东西的意思。有时候我们聊得切口转换不过来，竟然会对棒棒哥老倌说普通话，跟我的伙伴说方言，令人捧腹。 论说这几天下来我们接触的棒棒，多是十分热情的与我们交谈，也经常会有我们在聊着聊着的时候，旁边路过的棒棒过来听听，我记得我们去专访一个房东介绍给我们的棒棒程师傅时，他们一群人正在树下乘凉，我们对他进行采访，他经常给我们介绍“诶这个棒棒，都是在重庆买了房子的。”“那个棒棒，每个月挣好多好多！”，采访完准备合影的时候，程师傅便拉着他旁边一个伙伴说，“诶拍照片呢，来一起拍”，而那位棒棒却有一些羞涩，程师傅便强行抱住他，我们抓拍住这个画面时都觉得蛮好笑又温馨，或许这算是工友之间的感情？ 而对于棒棒这个职业，我也是通过这次社会实践才真正的试图从他们的角度来观察来思考，棒棒们没有医保社保，是因为本身月收入也不高，更无暇去交社保医保，而当地市民对棒棒的态度是习惯他的渐渐消失，因为在城镇发展的重庆，城中村在逐步改建，社会服务也愈发发达，搬家公司，快递，社区超市，都逐步取代了 90 年代左右棒棒的作用，我和我伙伴在讨论时在想棒棒的出路，要么转行，要么对棒棒这个职业进行规范化约束，比如，现在已经有”棒棒军搬家公司“，有类似于将零散的棒棒挂在棒棒公司的名下，公司收取中介费，并对棒棒的行为就行约束，更能礼貌对待客户。可在采访中我们也发现，棒棒们认为这样并不自由。我们甚至想，将棒棒打造成类似于老北京三轮车一样的特色服务，可棒棒军的核心是下苦力，对游客来说也就搬运行李，与其他地区的搬运工的差异仅是那跟赋予他们职业名称的棒子。 而在采访中，市民其实只是觉得棒棒们可能会不讲卫生，并不是低贱，因为这也是一种职业，他们靠他们的力气和勤劳去挣钱，行得光明正大，做得又对自己来说自由，甚至打趣得告诉我他们经常在商店里撺掇，因为里面有空调！ 我认为，我们对于棒棒的社会实践，不仅仅是因为人文关怀之对劳动人民基本保障的呼吁，我们在采访时更能感受到棒棒们所特有的”棒棒精神“，这或许才真正是对于重庆的地形来说，他们成为一种标志的原因。 基本敲完那时的思路与所见所感的我，不禁有一点点想念火热夏天里，在重庆和伙伴一起吃的那碗酸辣粉，真的太好吃了。。。。 重庆·轻轨·辣·热 还有棒棒。 know more","tags":[]},{"title":"一个人活","date":"2014-08-29T16:39:00.000Z","path":"2014/08/29/lonely/","text":"故事 大概要从两个月前出发的一个人的旅行 开始说起 2014 年 7 月 4 日前往厦门 于 7 月 9 日金门中转飞往台湾 后顺时针独自环岛 经台中 彰化 台北 花莲 垦丁 7 月 16 日于高雄佛光山参加禅学营 5 天后随营前往台南 嘉义 新北 台北 后独自回上海 于 7 月 27 日返回南京 关于厦门 在鼓浪屿上住了两天 晨起沿着海边能趁游人还未来时感受下小岛的静谧 鼓浪屿论旅游算是极佳之处 沙滩下海游泳 在厦门本岛环岛路沿着海边骑了一下午的自行车 因为心中一直有着对海咸湿的梦 然后去了台湾 很多人觉得一个人说走的旅行很酷 可是大概不然 那 24 天的旅行里 其实也没多少人能完全忍受孤独 我到达台湾的第一天 没有开漫游电话也没有翻网墙来预订住宿 什么都没有准备 就这样一个人拖着行李先找住宿 甚至想不至于第一天就流浪街头吧 不过我倒是知道要做什么 我准备好了各个青旅的资料 然后先直接去买电话卡 再一个一个拨就好 主要看当天是否有空房 其实感触还真的蛮大的 台湾更多的是中華文化 像是传承了真正的传统 初到彰化 一个人拉着行李 路上的阿姨关心我是哪家小孩要去哪 我说我是大陆的在找运营商营业厅 她还用手机帮我查在哪 在垦丁骑了几十公里单车 几次骑山路太累下车推行 路过的机车都会对我说:加油!” 后来在 seven 的电视上看到说 是因为台湾人对骑行文化还蛮鼓励的 因为他们认为这是对年轻人的一种磨练 而机车在三米宽的小路口仍停下来等待红绿灯 还有 在台北车站 算是人流量最大的车站了 所有人都在排队等地铁 而绝非全堵在门口 上扶梯的时候 人流量超级多可全都是排队走右边 左行右立 把左边留给有急事需要在电梯上跑动的人 还有在西门町 台北超级繁华的地方 四处都找不到垃圾桶 可地上就是没有垃圾 (因为台湾实行垃圾不落地什么的？不太了解) 还有垃圾分类 还有丢牛奶盒饮料瓶时需要把它压扁节约空间 真的还有太多太多 旅店老板的热情 seven 店员的每一声谢谢(当然我也会回声谢谢~) 都给人留下深深的印象 以至于离开的时候我在想 我们要把文明带回来 在路上遇见的人有趣的人 台北青旅店里遇见的大三政法系学生 和他交流问了很多台湾文化差异上的细节 在垦丁遇见真正的骑车环岛的学生 互相讲讲各自的经历 顿时对骑行环岛心生热血 当然还有禅学营遇见的人 这里按住不表 后面再叙 我觉得我最开心的是在花莲 在骑单车去往七星潭的路上 有无数心绪 在一个马上到达海边的小巷上 沿着下坡飞驰 一下子多少释然 因为我知道 无论怎样 前方都是我日思夜想的大海 阿信有一段时间特别迷惑 在骑机车过自强隧道之后一下子豁然 「我只能有一个自强隧道那麼长的迷惑。 」—— 阿信 我害怕船行在无尽的大海 徒步沙漠 和飞在浓厚的云层中 因为我觉得 周遭的一切是如此的迷茫而你根本就感受不到自己是否在前行 感觉就是人的生活状态 我无法知道自己是否在上进的时候 会恐惧 会迷茫 因为我知道这样的无知与若停滞不前 这不是我生存的意义 而我生存的意义又是什么呢 在垦丁骑 70km 穿过恒春半岛 沿着太平洋到达台湾最南端 在去往的路上 大太阳 山路崎岖一个坡骑不过去 我当时在想 我这样在大太阳下晒成这样 究竟是为了什么 人生终将有好多疑惑 但我知道 出发之时 我想的是 独自去看一下更广阔的世界 去穿过山和大海 去见人山人海 事到如今我依然不知道 但我知道这个世界仍然值得让我为之奋斗去了解自我存在的意义 说到自我存在 我便会想起高中时 高二的时候 世界观开始形成 开始去看这个世界 那时候发现 我还有好多不懂 感受到的是对这个世界的无知与无奈 那时接触到宗教 个人感觉宗教讲的是这个世界的起源、对这个世界的认知方式和如何处在这个世界里 大一的时候因为 EVA 接触些许基督教 去几个教堂 去过平安夜 后来机缘巧合 接触了人间佛教 有了这次去台湾参加禅学营的机会 较系统性的了解佛教与禅宗 世尊于灵山会上，拈花示众。是时众皆默然，唯迦叶尊者破颜微笑。世尊曰：“吾有正法眼藏，涅槃妙心，实相无相，微妙法门，不立文字，教外别传，付嘱摩诃迦叶。”后经西天二十八祖，传至菩提达摩，是亦为禅宗初祖。 其实我上山感受最深的是星云大师的“包容”，他包容五大洲不同肤色不同地区的人们，甚至不会介意来自新西兰的慧峰法师外国人身份而予其当代理住持；他包容禅学营的参与者我们可以怀有不同的信仰或是无信仰来礼拜这佛光山的诸佛，甚至他包容我们去质疑佛、去质疑佛教而多次给我们开示。他包容人们信仰的差异而立佛光山却以教育先行。禅学营的开创初衷，是为了个世界各地的青年一个交流的机会，给大家感受台湾文化的机会，也给大家一个正确的系统性的认识佛教的机会。而参与者多为在校大学生或研究生，是因为有一定文化基础的我们，能从更深层次的、更多元化的角度去看待去思考佛教，去感受佛陀所讲的生命的意义和与人相处的原则。而绝非像中国广大无知如祥林嫂一般的人为求消罪孽而功利化的去拜佛。 而从宗教文学这一方面，上的几门课印象最深的就是唯识学，讲人的六根本烦恼“贪嗔痴慢疑不正见”与三随烦恼 讲人感知世界的方式 讲外境本空 唯心自闹 还想了解道教 这新学期的选修课我就选道家思想论 额 好像和道教还是有点区别 道教讲有与无 佛教讲因与果 基督教讲罪与罚 倒是在禅学营遇见的人颇为有意思 小组内北大佛学院的 南大哲学系的(竟然我们真有在讨论学术性的问题…) 一个马来西亚的妹子也颇为有趣 大四毕业 刚工作 却觉察到的多为世界的恶意 可世界它不认识你 它不是善意也不是恶意的 它是无意的 室友里有武大的 天津的 隔壁寝的一个台湾小哥真的也超级帅 最后一天在山上我们居然去串女寝 台湾小哥去找那几天认识的一个妹子 还有我下铺的一个台湾人 算是略负面的 老是嚷嚷我们没有网墙我们言论自由 我说佛光山上的生活简直就像共产 主义 他一脸不屑 你这就是言论自由下的无知 当然还有后来环岛参学时一起玩耍的南农学姐和南大的小高不过小高为什么要在台北 101 带我们进奢侈品店装逼 深井冰啊= = 一起去吃夜市 一起在楼道口深夜打牌 其实在台湾发生了很多我不想写出来的事情 这些就烂在自己的心里吧 关于离开了的活动前面有一篇日志 还在讲前路的迷茫 只是后来 离开的人是我 没有留任下来 无他可说 只有对主席团一些处理方式的略微不满(反正主席看不到这里 嗯哼) 结束的时候 主任们的信里 史主任说 「每次都卖掉自己的节操来换得大家的开心，真是辛苦你了。虽然表面上一直都是嘻嘻哈哈毫不在乎的样子，但是我看得出你是所有人中对活动感情最深的一个。」对活动的感情 算什么呢 大概只是因为最初时在大学里给的第一份归属感 结束了 还是开开心心一起复习期末只是我有时会想 人生海海 后会无期 有一段时间我发现我越来越能适应一个人生活(越来越适合孤独一生…) 每晚趁着夜色从教学楼走回寝室 一路上都是我的自说自话 情绪少与他人分享 也能自我娱乐 想着一些东西发笑起来 “The need to find another human being has always puzzledme.人类穷尽一生追求另一个人共度一生的事我一直无法理解。Maybe because I’m so interesting all by myself.或许我自己太有趣，无需他人的陪同。With that being said, may you find as much happiness with each other as I findon my own.所以，我祝你们在对方身上得到的快乐与给我自己的一样多。”——— Sheldon 娴姐问我的那个问题 关于喜欢过的人 我说我不知道 我是真的不知道 我觉得我不懂爱情 还有太多的不懂 人际交往方面的各种问题 在意与变形的问题（我慢慢懂得了自己的变形与异化 变形是唯心自闹 使 我 不是我） 婚姻与永远的问题等等等 所以我大概就是还不适合谈恋爱 说个简单的问题 就是你现在遇见的人 (怀疑论)谁能保证会永远 那么 婚姻又有何意？束缚？知乎上有人说 是一种为了后代关于社会的协议 法律上有效的婚姻才能一定程度的保障后代良好的成长环境 可是这无关两人之间的感情状况啊 所以我还是不懂 而可是 你以为谈恋爱就不孤独么？一个自己都活不出趣味的人 就不要妄以为会给另一半带来多少乐趣了 看过身边很多感情 唯一的成长是逃脱了自我施幻 关于转系这篇文拖了好久 从上学期期末就在记些感想(记一些回来路上的自说自话) 今天得知了转系结果 这下 终于等到三连击了 失败了，我个 loser。 没有抱怨 是因为我发现我的分数和录取线还差得很远 说明 我太渣 仔细想来 在假期之前就意识到自己这一年来根本就不够努力 不要以为暑假留校复习能说明什么 我自己清楚我在学校里的效率和做的事情 甚至到了转系考的前几天 我 开始变得迷惑 开始打游戏 MC 来逃避 完全不想复习 根本是因为自己已经失去了信心却无法接受失败 最后终于还是失败了 还差得远呢 留校复习是因为这一年来你知道英语很重要却仍然不好好学它 是因为你居然还逃避英语也懒得复习了就刷高数还美其名曰英语背单词没有多大用 可笑的自己 转系考之前的迷茫 大概无处与人说因为还要故作勇敢去面对考试 那时已经天昏地暗想挣扎却无法自拔 偶尔会觉得不再像高三那样身边有个人一起奋斗一起热血即使跌倒姿势也会很豪迈 终于自己坚持不住了 crash 了迷茫了 本没留多少退路 没当部长 没有仔细考虑大二之后若还在软院的规划 暑假也没有报校史系统设计竞赛这些专业课和别人又拉开多少差距 留在软院大四实习的话考研/出国/工作什么的又完全没有规划 活活一个 loser 你就是活该啊 细想自己为什么要转土木呢 想利用自以为的空间思维技能 因竞赛学偏物理方面的 所以最开始偏执的想读土木 晖少提醒过我 是否知道要转的院到底是干什么的 而我大多是因为自己本身的偏执和自我施幻 我懂 在软院其实仍可以做到很多 最孤独的是过早的进入了自己的内心 明明知道自己内心的想法 却不能按照自己的想法去做 逼自己适应现实的生活 却又无法放弃内心自我 不 我其实根本就不了解我自己的内心 考试的唯一结果就是自责 闲言碎语扯了几千字 这些大概都是独处的时候想的 反正大概还要这样过好长一段日子 多好 现在唯一要做的是让上次犯的错反省出梦想 需要作出改变 好好得准备当前的生活 考虑自己未来三年的规划 唯有「专注」这件事可以避免孤独 因为你一直都有很「专注」地活","tags":[]},{"title":"我所领略的禅与佛光因缘","date":"2014-07-30T11:47:26.000Z","path":"2014/07/30/foguangshan-in-taiwan/","text":"2014 年夏天，7 月 24 日，从台湾回来，回想这七天的禅学营生活，已经要把自己归为佛光人了。唯识学里讲种子的起现行和回熏的轮回，佛光山的那颗种子，必定结于今年和南京雨花精舍的相识。那时无神论与怀疑论者的我正对宗教哲学挠有兴趣，同学引荐而与雨花精舍相识，经一系列手续之后，于 7 月飞往了宝岛台湾。期间那个种子正在酝酿，慢慢生根发芽。 7 月 16 日，拉着行李，上了佛光山，参加“2014 国际青年生命禅学营”。所见绝非仅有佛光山寺的宏大与庄严，回首山门时“回头是岸”的会心谶语，而是选佛场上法师们的夹道欢迎，不同肤色不同地区的人们的面孔和室友温馨的结缘。 妙光法师的高超翻译能力，小威老师相见欢时的互动，令禅学营更添生色，大家开始融入小组，融入这个集体，融入佛光山。而后教授我们佛门礼仪，开始体验佛门生活，享清规戒律，静心思禅。也有在佛陀纪念馆的大觉堂内感受梵呗和佛光青年歌咏，那时我便震撼于佛光青年为信仰而以歌弘法重新组建人间音缘歌唱团。 其实，我上山感受最深的是星云大师的“包容”，他包容五大洲不同肤色不同地区的人们，甚至不会介意来自新西兰的慧峰法师外国人身份而予其当代理住持；他包容禅学营的参与者我们可以怀有不同的信仰或是无信仰来礼拜这佛光山的诸佛，甚至他包容我们去质疑佛、去质疑佛教而多次给我们开示。他包容人们信仰的差异而立佛光山却以教育先行。禅学营的开创初衷，是为了个世界各地的青年一个交流的机会，给大家感受台湾文化的机会，也给大家一个正确的系统性的认识佛教的机会。而参与者多为在校大学生或研究生，是因为有一定文化基础的我们，能从更深层次的、更多元化的角度去看待去思考佛教，去感受佛陀所讲的生命的意义和与人相处的原则。而绝非像中国广大无知如祥林嫂一般的人为求消罪孽而功利化的去拜佛。 世尊于灵山会上，拈花示众。是时众皆默然，唯迦叶尊者破颜微笑。世尊曰：“吾有正法眼藏，涅槃妙心，实相无相，微妙法门，不立文字，教外别传，付嘱摩诃迦叶。” 后经西天二十八祖，传至菩提达摩，是亦为禅宗初祖。根据分组课程里“唯识学”妙南法师所讲在人间的六根本烦恼—“贪嗔痴慢疑不正见”，而“禅”，便是教会我们如何在世间面对这六根本烦恼，它是一种心境，在每早的山水禅中，在三餐前的诵经合掌中，在佛陀纪念馆门口的献灯祈福中，那便是一种至为详和、宁静安闲的心境，因外境本空，唯心自闹，唯有此般宁静无所他求，才能无欲无贪、无拘无束、熄灭生死、超脱轮回——这是出世的禅。而佛光山开山宗长星云大师所弘扬的人间佛教，讲佛陀出生在人间，修道、成佛、说法度众都在人间，是想我们人人行三好，世界更美好（做好事，说好坏，存好心）——是入世的哲学，以得四给五和的理想社会。我想，不才的我应该能回答小威老师在“相见欢”时提出的“什么是禅”的问题了。 道教讲有与无，基督教讲罪与罚，佛教讲因与果。大概我与佛光山因缘的回熏不止于回念而写下这感想，而且讲禅学营的信息传播给周边的朋友，虽没有慧根未信佛，但至少我知道佛光山所传承的积极入世，三好四给的言行标准是值得遵照的，如同在台湾环岛参学时所领略到的台湾人民的淳朴与热情，他们因有信仰、良好的教育和环境的熏陶，造就了在台湾人潮涌动的捷运站仍有序排队候车，在三米宽的小路口仍停下来等待红绿灯，在西门町的闹市路边无垃圾桶地面却毫无垃圾。我们佛光青年至少要把这些文明这些律己的准则带回来，不仅独善其身求得内心的禅静，更是兼济天下用自己的知行合一去感染身边的人，人人行三好，世界更美好。 不虚回本山此行。 2014 国际青年生命禅学营 Life and Chan 南京雨花精舍","tags":[]},{"title":"写在前路未知时·爱在心口难开","date":"2014-05-24T10:26:00.000Z","path":"2014/05/24/seu-unite-hd/","text":"今天凌晨 3、4 点写的…懒得改时间称呼了…说不出感动的话 等下还有去和他们自习 hhhh 爱在心口难开 今天终于在学团联散伙饭时大喝一场，喝了好多酒，向老主席和新一届主席们敬(灌)酒，当小桥、小明明、霓学姐、范学长、馒头哥哥等上一届乃至上上一届等祖师爷级别的活动中心成员和我们的主任，干事们围在一起喊了好几次“活动万岁！”的，那时真的幸福感爆棚。 玩游戏，徐玉秋被派去灌孟主席，居然变成炮灰被她手下挡酒了…我们去敬老主席、高级干事和新主席们，我酒量不行一会就开始上脸了。 酒劲起来的时候，有开始哭的了，毕竟我们主任也没有留下来。然后我们开始和伙伴们碰杯，相拥，我还祝福了异地恋的伙伴以后要好好的呢 T^T。 今天我喝下的酒，都替代我想要流下来的眼泪。 上一次这种情形，大概就是高中毕业时的谢师宴，吃饭已是次要，拿着酒杯去敬他人，去合影。最开始是欢笑的灌酒，结果酿出苦涩的眼泪。高中毕业后我更懂得了离别，知道有些人或许真的再也难见，去 KTV 唱歌嘶哑得吼出多少无奈。 下一周要填申请表了，然后是面试，也不知道能不能留下了。 对学团联的感情好像更多了一分。 大一入学百团大战的时候，是被这张喷绘吸引的： 这是上一届社巡闭幕式，那种全体穿会服的成员感这是今年的我们： 然后报了学团联活动中心，且不接受调剂。 今天喝酒的时候还能跟徐玉秋说那次一起过二面的情况，还有我印象最深刻的是第一次全体大会上霓学姐说：学团联是一种家文化。通常办活动都是所有中心一起上，而学生会是各个部门承办自己的活动。 后来我们过了干事培训，第一个场控精品活动答辩会，后来办九周年庆典，去露营，在慢慢八卦的环境中感情越来越好。其实，是活动给了我大学里第一份也是最深刻的归属感，总共 14 个伙伴和主任。 我们去参加精英发展论坛闭幕式的舞会，去准备元旦跨年舞会，在热血的跳了 6 个多小时精疲力竭中度过 1314，这学期主要就在准备第三届学生团体巡礼节，开幕式的时候布置场地，最后在夜色，在聚光灯下收拾胶布，打扫场地，闭幕式也有太多太多的想说的，当大家走上舞台高举双手谢幕的时候，站上焦标舞台上，头上聚光灯，感谢那段时间的汗水。 在准备开团代会换届的时候，忽然意识到，好像能为学团联做事的时间不多了，因为我也不知道会不会让我留下来。 团代会前一天的学年最后一次全体大会，听分管活动的霓学姐将她那一届的活动中心可能会被注销，第一届社巡闭幕式时的狼狈，感慨良多，第二天去搬砖，中午开始分材料，下午去布置场地，累得一逼。团代会选出了新主席，下周最后一次值班。Sigh。这就是前路未知，而珍惜最后这在团联的日子。 上学期最后一次例会后我说：若是加入了学团联，是因为喜欢某一件事情。若是去融入，留了下来，那是因为喜欢那里的一批人。 如今自然是不后悔，学团联是一种理想的生活方式，那里有自己喜欢的一拨人和自己喜欢的事业。 不管谁留下了，我们都相信能够带好活动，今天之所以这么感伤，是因为我们知道，今后见面的日子确实会少了，没有了一起共事的时间，在偌大一个学校就偶尔的碰面，主任们没有进主席团，而我们也要面试竞选，今天主任们一个一个的拜托新主席团照顾好活动，是觉得那么的无奈。KTV 唱到最后也在讲心里话，小桥也提到竞选主任被调剂到其他中心而感觉并没有当初的那么有爱，今天散伙饭也有几个干事没来，他之所以经常和我们厮混，说，是看到了当初大一时的他们。而我也变得恐惧调剂，如果留下来被调剂去其他中心，和另外两个不熟的伙伴，再带领 10 多个干事….算了，据说也不一定有调剂的机会呢。我真真想留在活动。 前路未知的恐惧。和对伙伴们聚少离多的无奈。多么像是毕业，搞笑，又不是见不了了。暑假还有一起去玩呢，下学期还想一起做 SRTP 呢，杨文聪台湾交换一学期回来后还可以春招进来当干事呢 hhhh。 最后心里话娴姐以切身经历说她大一的伙伴之后也很少聚会。我说：人生就是不断的放下，但最遗憾的是，我们来不及好好告别——少年派。就像最后和老主席团，范学长大三的他们告别时，有种后会无期的感觉。不管怎样，至少在一起时是多么的开心充满笑颜，敬酒的时候都是真心的，拥抱也是，祝福也是。 遇见很好的人，娴姐最开始真的有点“小凶”（hhhhhh），昕姐跟我明明同是川渝地区的却从没说过方言，史主任自然是本中心搞基始祖。几名丧尸今天一起喝交杯，还有一起起哄和八卦的几名叛教徒，还有经常一起搭档的 partner，交院基友们，经常被我黑的处女座。 还要桥姐，还要翟主席，聂学长，晓琛学姐，小明明，人事中心的小伙伴。 下周值班去把我社巡给大家签名的我的会服 拿去偷偷盖一个学团联的章以彰显我活动中心日常审批的职能 hhhhh 还有好多想说的…时间轴也好混乱 等下周结果出来了再说吧 至少感谢大学最疯狂的时候 是和你们。","tags":[]},{"title":"后高考时代","date":"2013-10-13T06:41:22.000Z","path":"2013/10/13/after-college-entrance-exam/","text":"请别忘记你为何出发以及付出的努力 学习毕业之后 进入大学 经历的很多事情 也见过身边的小伙伴对现况的迷茫 大学究竟要干什么 能做什么 面对学业难度的陡增而畏惧 这四年究竟想成为什么样的人 自己又何尝不是 高三的时候我们过得多么努力 小心翼翼的在每个课间挣扎着不在题海沉沦 跟人聊高三一天做的事情现在大学一周也做不完 那时一大早起床去教室早读 课间在课桌上打乒乓球 走廊踢毽子楼下打羽毛球 大课间的时候冲去超市买零食回来瓜分 那时还学习打网球 看博弈论 学无机、有机化学 小组的总结本也是学习利器 如今混在寝室少去图书馆 不是上网就是睡觉 自习时效率低下 刷微博人人 高数几代的课昏昏欲睡 看不清未来的方向 梦想这个关键词一下子变得对我们来说是多余 因为一下子把自己的人生粗鲁地分为活着和死掉两个阶段 高三的热血流向了哪里 一下子又回到了听老男孩时的状态 其实究其现在的所以 还是过去三年曾体悟的一句 终点只是个虚晃的借口 到了也不是我们停歇的理由 阔别高三 那些挣扎与那些不甘 都成为我们那时背水一战的支柱 有梦想有目标有激情 多都在这三个月的假期和大学生活中消磨 多归罪于自己本身的惰性与环境的腐化 异化成自己当初瞧不起的人 “你只要把高三这款游戏里的东西都忘掉就好了 但请别忘记你为何出发以及付出的努力” 唔 得做出改变才行 在“一个”里看到张皓宸《迷茫先生》里一段 开始对梦想有了信仰的崇拜，自然也就在追寻它的路上奢求及时的回应。谁都懂得如果自己认真做一件事，就会完成得很好这个道理，但很多人觉得它始终是个假命题，因为做一件事要服从当下的情绪和环境，再努力奔跑的人也终会有停下来撑住膝盖喘息的时候。不过，休息之后要想再跑起来，就会力不从心，而如果不停顿咬着牙一直跑到终点，你是不会感觉太累的。 即使现在看不见目标也得奋力去奔跑 像闵老说 不要把顺序搞反了 是坚持了你才看得到命运 因为看不清和对未来一无所知而感到迷茫和恐惧 于是我们腐化堕落 我们张皇失措如惊起之鹿找不到方向四处奔跑 周围埋伏的狼声何在 可无奈的是我们只有在有限的视野范围内继续前行 见招拆招 高三给予了我们很多 不光是现在的大学和认识的人 学习习惯和逆境的心态都是一生受益 坚定了短期目标 大一这一年得超级努力 追求达到高四的状态 （中科大暑假还要补课 这是高五的节奏）去寻找树立长期目标 和 Lancer 说四年想成为什么样的人都付诸笑谈 毕竟意识到人生是何等狗血 又回到高三做周计划的习惯 但惜于花了四周熟悉大学生活节奏 记事本上的记录还是很乱 笔记本没有开始用 零零碎碎的纸张记下课堂所讲 周计划疏漏较多正在改版 大学突发事情太多未吸取高三经验留下缓冲时间来机动 还没有列出大学想读的书单来充实自己的人格 很多人看不见终点而焦躁地思考人生 结果就是在一次又一次的自我否定中而彻底暂停但每个人都有不同的阶段 会有不同的境遇 想得太多不如简单去做 当你对未来产生疑惑 试着去思考当下的自己可以做的事 工作加了院学生会新闻部和学生团体联合会活动中心 最近开始特别忙 忙开例会院运会校史竞赛采访干事培训的素拓各种策划 PPT 培训周年庆排节目 觉得应该能学到很多东西 新闻部是因为毕业的语录排版印制的缘故 去学些技术 活动中心是三年组织那么多次活动 这里有更高的平台 受众更广 忙过这一阵子 就可以忙下一阵子了(TAT) 生活6 月骑游时给任大戏言 “毕业之后的我们 怎么了”（《Tiny time》）一下子四个月了 经历了更多事情 慢慢看着好友们的改变 分享着彼此的生活 可细看自己除了远端和你们的开心 现实中的自己碌碌无为在做出绝命的挣扎 终究还是孤单的状态 注意 区分于孤独 孤独是基于心灵 上学放学都是自己一个人骑车往返 耳边只有嗖嗖的风和自言自语 我们为何出发 这几个月来前两个月都是忙碌 像晖少说的一样没有时间去想没有时间去悲伤 后来几十天里又在修正着自己的世界观 幸于价值观仍存 还能摸索着方向 向堕落的自己伸手挽救 人要活得像一支队伍 这个队伍里有搜查有救护有自我 情感上的挫折却被这三年间形成的自愈能力所掩盖 原来自己已经不知不觉有了这样的能力 父上最近问我班上有恋爱的么 我怎么知道 他说什么差不多大二才谈恋爱 这是在暗示什么么 = = 芳心已许高数 奈何独自一往情深 明天改版的周计划表可以投入使用了 灵魂拒葬","tags":[]},{"title":"青春荒唐我不负你","date":"2013-06-10T20:01:00.000Z","path":"2013/06/10/youth-of-high-school/","text":"高考倒计时 10 天，高考倒计时 1 天，高考，高考完的那个晚上，毕业典礼，谢师宴。也就在恍惚之间，高考并没有想象中的那么轰轰烈烈，仿佛是想要凭此事刻下自己来过的痕迹。 那时心中充满了不安与恐惧，看不清未来而迷茫。最后备考的日子，仿佛每个言行，都标志着“最后一次”。(“最后一节班会课”除外你懂的)，最后一天同班最后一节课，最后一天同组同桌，最后一次上自习，最后一次留校，最后一次穿校服。高考那几天仿佛大家都很轻松，进考场前的说说笑笑，相互鼓励，终于熬过最后一科，想要大喊却只感受到一种虚幻感，这就是等了十二年的高考么。 “半天在路上，半天享受亲情，剩下一天做六科总结。”你应该这样对我们说的，出门却只看见你向我们挥手，给我们拥抱。三年就过去了。 高考完了的第一天晚上，其实谢谢那是个美好的回忆，是明白彼此的重要性。 毕业毕业，口试完赶回学校参加毕业典礼，在音乐厅里传着多少人的校服来签名，看着高新的拓荒者们这三年的点点滴滴，本计划拉着苧来照毕业照结果却没有找到人，在混乱的排队中照下了毕业照。我们毕业了。 回教室收拾东西，还把教室里自己觉得有意义的东西搬回了家，相框，明信片，留言条，写下的梦想，教室纸堆里变得如此混乱。 寝室搬空，认真的和生活老师说了再见。 再见墨池书院 404，再见 258。 再见高新，即使我们再回来，你已经蜕化成另外一个名字——-母校。 “这三年，我过得并不容易”” 你们送给我的每一份礼物，我都用心保存””字字句句满是爱与关怀。”“舍不得结束，就不要开始。”最后节加油班会，这几句话却莫名戳中泪点，或许是在这里看见了一个真正的老师，也或许看见了自己。 这三年过得并不容易。 看过去留下的几条短讯，高一时的自己，现在却觉得做作虚假，整天会嬉皮笑脸，话语里充满了装嫩与傻逼气质，不像高三时 Yuri 说我过得其实并没有表面上的那么开心，直截了当回了他一句 我也觉得。现在的自己否定以前的自己，在不断变化的躯壳里自己还是不是最初的那个自己。高二时觉得自己人生观成熟速度发展到了极致，对他人对自己的认知，一步步的修改着最初的人生观，那时又遇见了 EVA。高三的状态趋于稳定，是明白自己追求的到底是什么而认真的落实每一天，有过背水一战，只为自己不后悔。 高一时学过一年竞赛，也无法坚持而退缩，算是三年来较大的遗憾，那时纠结于电容完全看不懂而直接上课持续打瞌睡，而今当初觉得莫大的事到现在看来也不够尔尔。 高二时非常迷 EVA，因为在那里我看见了碇真嗣，看见了明日香，看见了 A.T.Field。看见了碇的徘徊犹豫与自我，明日香隐藏在内心的那个脆弱的自己，看见了人与人之间那层永远也存在的 ATF。”你可是花了三年诶。”别人的一句戏言。我可是花了三年诶，却永远无法中和别人的 ATF，每一次以为要突破，却被一句完全否定给打回原型。 在高三时算是自我安慰认识到 ATF 存在的必要性，豪猪之间的距离这个比喻还不够恰当，只能说是 正是每个人都存在 ATF 人类才想要去与他人交往。世界观的修正。而这两年一直念叨的爱自己也抱歉还没有找到正解。 最好的年华 这三年，终于在同学录里多少个人写着我对班级的贡献而觉得自己完全就是为了自己而崩溃，为了自己晚自习的时候自己能够高效，为了记录下点点滴滴以彰显自己过得很好，为了今后会有个美好的回忆。 说我变得成熟不再矫情我倒觉得是真的。但我敢说当纪律委员到毕业我都没有从别人背后捅刀子。 【以上各种脑抽请勿自我代入】 “或许有些人今后就很难见面，可今天却过得向平常组织的活动一样，吃饭唱 K 电玩国王游戏秀下限，或许知道有些人是此生永远也无法分开，干了几十瓶酒，拥抱，亲吻，醉笑陪君三万场，不诉离殇。” 我们说好不分离，要一直一直在一起，就是与时间为敌，就是与全世界背离。 这三年来朝夕相处，每次深夜电话，每次活动去体验自己从未做过的事，每次你们损死我的话，温暖过我的话，每一次倾诉，每一张贺卡，每一份礼物，每张照片，摄影，刻的字，唱的歌，都留给我封存作回忆。而今后将制造更多比夏天还温暖的事。 曾经有说 想要成为任意打扰和不怕投降 可最后终究只是想要，或许后来还会加上过去式，更或许后来成为过去虚拟。也认识融入彼此生命的人，也相信一直一直在一起，也有一起拥有太多的回忆的人，却在时间的磨损下知道 如果看不见的话，一万公里和一个转身的距离也没有差别，终于知道不在一起这个事实。有过近乎三年最近的人，最后却因本质的哲学冲突而淡化。有每次损到死的最佳损友在高三 1500 米跑完时虚脱紧紧抱住，有说好唱专属的歌来回忆一辈子的人，有给过深深拥抱却还没有认真说再见的人，有一起交流了多少感情历程却最后都放弃的人，有习惯性分她刘海说某个漂亮发型的人，一起回家而纠结于合照打不开而忘了我们一直都在的人，有每次向我倾诉最后看透我感情的人，有每次都一定会被我拍肩吓到的人，有每次说我幼稚一起荒 X 的人，有有过争执却被她的抱歉而觉得自己才该认输的人，有并肩作战革命友谊嘲笑我胆怯的人，有每次都会洗他暑假仍然一起刷题的人，有一群一起在聚光灯下跳舞的人，有一群约定今后一定要出来吃肉的人，一起打球的人………… 这三年，其实我过得很好。 天真岁月不忍欺，青春荒唐我不负你。【我艹太晚了我来不起了还没写完】 流光容易把人抛2013 年 8 月 12 日 2:00 高考，也过去两个月了吧，这两个月里又发生了多少【比如本班多少人内部解决了啊喂！】来顺便先帮 Rich 的番外理一下顺序~当然是第一视角。。。你自己收集下其他的做上帝视角。。 6.08 高考结束第一天晚上 6.09 毕业典礼 6.10 谢师宴 6.13 毕业舞会 6.14 欢乐谷 6.19 温江骑游+烧烤 6.22 语录定稿并印制 得知高考成绩 6.23 开始三天筹备毕业旅行后填志愿 7.02 毕业旅行组出发 7.09 返程成都 7.14 开始筹备夏令营 7.18 夏令营给新生的讲座 7.19 终于得知录取详情 7.21 夏令营终于结束不用再滚学校搞传销了 7.24 幸福梅林烧烤 7.25 资阳行 7.26 回成都送别晚宴 8.01 拿到录取通知书 开始自习 8.09 返校语录组请客 ~~~ 8.10 留美送机 8.11 和安暂别 充实无比的暑假~这三年来的暑假真是越来越丰富。 【Rich：最美的夏天，永远都属于没有过完的那一年】 毕业典礼那天，有多少人拿着油性笔在校服上签名，仿佛都还是昨天的事，时间一下子把所有都摧枯拉朽怕今后忘记，不过很庆幸有人说还有语录和电子相册。谢师宴那天一直感叹过得好平淡如同平时活动聚会，待到晚上大家几瓶酒下肚，醉意阑珊，又开始真心话与大冒险。像闻到了一股陈酿的美味，时间将高考酿成了多少缸，高三奋斗的酸甜苦辣都杂糅在里面，不喝酒或不善喝酒的我那天也来举杯，致我们的青春。一塌糊涂。 语录才一直是苦大仇深终于算是解决了，其实我们排版校对大概就 4 天。。其他都去耍了。。后来还加印了 150 本跑了多少次学校赚到了第一桶金。。返回夏令营骗新生才特么像是传销啊。。。也能明白讲座上康大师说了再多（几万字发言稿的心路历程啊！），我们这些一同鉴证的能够体会，新生懂个鸟啊。还多谢康大师的签名那天让语录畅销。。。后来光荣的和晖少商讨给语录组每人买了留念礼物请一起来学校的吃饭~【梳子最开始以为只是语录组吃饭问能不能带家属啊喂！】 毕业旅行那几天很梦幻，一开始的暴雨大家被淋得多么狼狈，在火车上在小巴上，看过多少风景，从高原湖泊风吹草低现牛羊到一望无垠荒凉戈壁，旅途中有寄很多明信片~写着当时所在与自己的心情。还有最后一天在宾馆组内人员你们都懂的奇葩一夜= = 后来得知录取，虽然不算圆满但也还好不负高三，即使走在码农的路上走在学霸的路上绝对仍然一起奋不顾身。 去资阳的时候唯一可惜的就是钊哥和纯洁没有来到，不然我大 258 就齐了说好了今后一起吃肉！高考前每周必有肉！ 说起班上内部解决的节奏真是大吃一惊，两个月成了四对你们是要搞毛。强烈想加点什么 JQ 篇之类的。 后来有一天看 Rich 做的电子相册，看到大家毕业典礼在校服上签名，看见谢师宴酒杯与酒杯相碰，看见那么多的集体照，看见灯光照亮了我们的裙裾与衣角，雪白的衣领上系着我们鲜红的梦想，多少个瞬间让自己落泪无数，就像权威说，好可惜，那么多一起走的人就这样散了。 曾经有跟别人聊及康大爷，别人问他和全班关系好么。那时我是多么的自信说我们全班关系其实都很好，因为，真的是三年了。 昨天送走了歌歌和乐子的时候，看着她们进了安检还一直在向外面挥手的时候其实鼻子也觉得有点酸，毕竟一个是经常一起回家的人，还有个对彼此太重要，最后只有用赶她们走的手势说了再见，转身离开。 今早送了安，在快要进站的时候才发短信给她说 我在身后。匆匆一别。 明天好像是 Rich 和苧要走了吧，韩洋那一对就不说了。原来一到八月中旬，真的就开始分道扬镳了。 那天约你出来看的《小时代 2》里说到她们的高中毕业愿望。 毕业愿望是什么~ –当个很厉害的人！ –功成名就衣锦还乡。 那么我的高中毕业愿望是接下来的这四年里不输高中的精彩，还希望柯腾那样让这个世界因为我而有所改变~好多想对你说的话部分写在同学录里还给你了哈主要是太赶了赶到一点半滚去睡了。 前几天有把毕业照和歌歌这些年来给我画的三幅画拿去过塑，才不是封存，而是为了更好的珍惜。 高考后学校返还我高一写给自己的“金色时光”，看见那句：你明天可以不成熟，但不可以不成长。这些回忆杀像电子相册一样算最致命，真的比三年前成长多了，那年初中毕业太多的不舍与矫情，如今终能廓然无累一句：不诉离殇。 或许知道有些人不会走远，今后班上有什么事只有说请我吃面就一定帮忙（吃面你懂的哈哈哈哈哈哈哈） 高考，这东西真是令人又爱又恨，6 月之前我们感谢你，我们 50 多个人全心全意的为着一个目标而奋斗的日子，毕业后又多么讨厌你，这个暑假一过就是各奔东西。可至今梦里我们仍然梦见高三，靠着自己的信念走过来而熠熠发光的日子。这是我们的青春年华。 很多对同学想单独说的话就不像你们一样一一写出来嘛，那些没写完的同学录开学后我会寄给你们的啦。 送机时给歌歌引用的那首诗句： 何日功成名遂了，还乡，醉笑陪君三万场。不诉离殇。 【我又要滚去睡了后面慢慢写= =】 晒图2013 年 8 月 19 日上午 今天在收拾文件有翻到自己高三里写的每周计划表~也有看到自己自招的经过，那么多份自荐信，报名表，笔试准考证，面试证。也有在毕业离校那天搜刮教室里面的东西留下的照片无数，谢老给我的班上的奖状，班旗【真当我收破烂的班助队长啊= = 】话不多说直接上图 大概是三次换组照的小组照吧 毕业留念做出来的东西 那个 成长与离别 的光碟鉴于经费不够只刻了 5 张，我留有一张，其他的让家长给老师去了= = 三年里我到底买了多少明信片 剩下了多少明信片 oh shit= = 这大概就是三年里收到的信件吧 【应该没有搞丢的= =】 苧的，歌的，安，特马拉的 ，欢仔的，Apple 的，Rich 的， 我姐的，兔子的，代卑鄙的，（有人生收到 第一封盖了邮戳的信哦） ，刺儿的。就连生日 lulu 用包装纸折的白莲花我也夹在里面，草草画的可达鸭也有~ 桑桑的那包随意贴也留着。【你们能找到各自的么~ 】这些信大概就封存在家里了吧，不带去大学， 这是歌歌的大作！！！ 柯南和键人的画是画于高一，柯哀是毕业后画的~【永远不知道右边那幅画上的铅蓄电池电极反应式是什么心态= =】 与你许下这最后诺言 微笑着离别的夏天2013.9.11 晚上 南京第 20 天。 这座城市有像成都一样，没有明显的春秋过渡，学校在郊区令我仍有高新的感觉。21 天的军训还在进行中，和一个排的同学躺在操场上，躺在街边，看星星看云朵，骄阳曝晒，雨打风吹，只是抱歉还没有高中的那种归属感，这座城市也是。 常常想起成都，可大概真的只有离开，才能认识到家乡。和大家说了再见，才能意识到对彼此的依赖与想念。 但你还是要离开才行。所以会写明信片会寄信会打电话会视频。 最近和班上聊天，总是不经意间笑聊当年，大家变化有多大，那时在做什么事。大家真的回不去了嘛（真的好想穿校服，头像都换成校服装 ）。即使距离最恐怖的是你不知道别人是把你怀念还是把你遗忘，可那种真真切切的归属感令人感到一种自信，因为我好想你们。 把临别前的一张学校南门的照片设为锁屏界面。军训休息的时候躺在操场旁台阶上，风袭来一股凉意，睡着了，梦见在学校网球场，一颗网球被用力打出了场外，隔着球场的网看着它滚远的感觉就像隔着屏幕望着学校，无可奈何。多么痛的领悟。那里面的三年真的成为了我们人生的印记，院学生会招新面试的时候讲经历与经验，轻轻松松提起看电影唱歌吃饭溜冰做蛋糕献血宣传骑游烧烤毕业旅行，讲语录收集排版印制设计海报宣传讲座售卖，学长说那你高中三年经历蛮丰富的嘛。忽然就想起 谢老说的 积累资本。这些都成了人生的履历。还有那些多少个 G 的照片和录影，占据着多大的内存占据着多少的回忆，满满三年。或许应该做的是 打好下一颗球。 大学这几天面基的人员以及超过三年贴吧认识的人了 ππ，才几天就已经学会翘各种晚上的什么安全宣讲急救知识会… 大学总是充满迷茫 不知道这四年要干什么能做什么，像是回到了高一的那个梦里，一片雾霭，有限的可视范围带给自己的是恐惧与茫然。唯一能做的，大概只有跑起来，可能会觉得看不见目标奔向迷雾觉得可笑，天堂未必在前方，但地狱一定在身后（from 伯爵在城堡）。 觉得有点累 这个没有行政班级概念的地方，不会像三年前一样和 Ismus 记班级语录了 哦 今天是 9.11，9 11 语，九世呓语的含义。带了两本语录来，还带着个别收藏的东西，高中的情谊这里不会感受到了吧，难忘三年。 夏天结束啦，这个微笑着离别的夏天。 高中，再见。","tags":[]},{"title":"我不怕千万人阻挡","date":"2012-08-24T05:41:00.000Z","path":"2012/08/24/last-year-in-high-school/","text":"2012 年暑假 别人的暑假从七月算起，我们却还在补课，提前进入的高三。零诊后的释放，挥别高二。补课最后过于喜欢安东尼的《这些都是你给我的爱》，把整个绘本抄完了，也是想着和高一读这本时心境又大不一样，毕竟，否定之否定嘛。 这个暑假也是太多的经历。虽然说生活不是时光旅行，我们还是又重回到了图书馆，陪着去听演唱会，练习游泳，约去打羽毛球，一起做蛋糕，第一次滑刀冰。学着去做好多好多自己不会做的和自己不敢做的事。 最开始是看见一句话：小的时候觉得游泳很麻烦不去学，等到长大后喜欢的人约你去游泳你只有耸肩说：我不会诶。 我们都是需要这样大胆的尝试，任性的勇敢。其实这都过于温暖。 为你做的微小动作和一起的时间。过程中都会情不自禁。 那是秘密。 “你要赶紧来爱我，等我变成长颈鹿，你就只能看到我的膝盖了”云治里，鹿角男孩望着远处的城市的方向，终究放心不下一个人，伸长了脖子去探望，最后终变成了长颈鹿。 那些失恋了的人，带着过去的记忆生活，犹豫着是不是要忘记，可曾经那么真心的喜悦和担心过，怎么可能彻底忘记。或许只要等到对的时间，让你觉得一切都好了，犹如季节变化多端冷热交替。遇见另一个长颈鹿，他是特效药。 有人总是说去年总是在眼中倒带，现在又是不一样的感受，陪着的人又不一样了。容许我用暑假的研究性课题相对论来解释，时间是单向，我们把 365 天命名成一年，可是这根本就是个伪命题啊。那个一直从山底推石头到山顶的西西弗，他每一次的过程即使重复，终有一些不同。生活里不同的感受，也不就正是我们经历的成长么。 反正我，再也不怕千万人阻挡。 十几个小时后就启动禁网计划了。 明年 6 月 8 日再见。 不再投降。","tags":[]},{"title":"西西弗续","date":"2012-08-16T16:44:00.000Z","path":"2012/08/16/sisyphus/","text":"“听过很多的故事 看过很多的恋人 但是 想你的时候 我就把他们都忘记了 不会拿来温习 计划 参考 警告 过去已经不在了 将来也不想考虑 只想此时此刻 为了你任性地勇敢” ———安东尼《云治》 前天去逛了另一家西西弗书店，店里的非书籍类确实很精致，很高兴的看到摆有花种，却苦于找不到想要的玫瑰花，还是买了个再倒掉，装自己以前留下的种子。 上次种花还留着的备用种子。 不敢再种下去的种子。 本着是若我不种 就不会知道它开不出来了这种自欺欺人的理念，将它装进了封闭的小试管里。 我才不管你高温失活还是干燥失水，只想不要破碎掉不要风干成屑。 只是想留下一点点希望。 守和教的：这是个小概率事件， 路鸣泽却说：但不等于零。 其实我是在害怕以后不敢种花了。而或许，我已经为我以前说的那句“为一朵花闪耀的日子”这句没有谓语的非句子找到了谓语。为什么不开花结果就得闲置在一边。 “你知道西西弗书店名字的由来么？就西西弗的神话。” “他是一个君王，西西弗因足智多谋触怒了众神，诸神惩罚西西弗不断地把巨石滚上山顶，而石头因为它自身的重量又会滚下去，他们完全有理由相信没有比这徒劳而无望的工作更可怕的惩罚了，然后西西弗看着石头马上朝着更低的地方滚下去，在那里，他不得不把它重新滚上山顶。西西弗要永远地、并且没有任何希望地重复着这个毫无意义的动作。” 我看到他回到山下，迈着沉重而整齐的步子，走向他永远不知道尽头的痛苦。当他爬上山顶，渐渐凌越在诸神的领地，而他爬上山顶所要进行的斗争本身就是足以使一个人心里感到充实。西西弗是幸福的。 至于一直在纠结的爱自己的问题，西西弗的目的并不是要推石头上山，而这个过程他已经幸福而已。并不是迫不及待的去爱，而喜欢自己喜欢一个人的状态而已。 放暑假前曾几天之内把最喜欢的安东尼的绘本抄完了 相比于两年前 有了不一样的感受 付出都是值得的 那些为一朵花闪耀的日子 填充在现在的我和之前的我之间的缝隙 这些都是你给我的爱吧","tags":[]},{"title":"玫瑰色","date":"2012-04-30T12:45:00.000Z","path":"2012/04/30/rose/","text":"清明时种下花的种子再也不会开，纵使自己每天给它浇水那也怎样，天气好的时候捧着它到走廊去晒太阳，贴上标签怕它掉了，说那是自己的花要对它负责，可它不会给你长出幼芽的机会。 Una rosa es una rosa. 玫瑰终究是玫瑰，如果长出来的花定会太脆弱，仅是靠着浇水的滋润，无法拥抱自由的土壤灿烂的阳光，那离开它离开 B-612 的人又何尝不是呢。 结果是爱上了浇花的过程。回校时为它满心欢喜，一直惦记着为什么还没有发芽，放在窗边放在桌上，最初只是想圆去年的一个愿望，更多感受到的却是一种迟到的苦涩，近三十天，好多个月，一点点的推下去更多的是知道它不会发芽了对吧，自己当初种的时候只是以为好好爱着它就对了吧。 再也不要让一朵花如此举足轻重的充溢着自己的脑海，可却被告知是自己对花还不够好，连芽都没有长出来。可就是没有长出来的过程当中，为一朵花闪耀的日子。 考完半期的那天，一个人坐在操场主席台边，夕阳，将世界像血一样染红了的，太阳最终的宿命。说着那句独白，“我还可以看多少次这样悲哀的天色。” 眼中玫瑰色的夕阳也比不过满天星夜。 Rose. 其实再也不用了对吧，自己也再也不会去了对吧。 I will never let go.","tags":[]},{"title":"17","date":"2012-04-11T05:00:00.000Z","path":"2012/04/11/seventeen/","text":"在周末苦逼到花了一个小时在路上，一个人去看了画展，作为吃货收到去年暑假在外面一起去吃的好多鸭脖，周二看到某人回来结果还是没能当面给我的贺卡。然后，我就满了 17 岁了。 收到长长的贺卡和好久不见的朋友那长长的短信，还有礼物。谢谢微博上＠我的人呦，虽然零点关机没有收到的绝对的第一条短信；谢谢两个还把我当吃货的人，某人满满的盒子，还能叫我ｓｈｏｎｇ的人。有的贺卡会长到其实我好想哭，有的可以让我高兴到午休躺在床上结果会笑着睡不着～中午几个人在一起让我破例许的愿。17 岁。 上一个年纪算是感性与理性的交织的产物，学着用理性去分析自己的感情，分析小团体的维系，重新审视自己的爱国主义倒宁愿相信民族虚无。再细点就是最近的随笔，“时间如蚀”考虑自己在时间中的变化，变得不再过于相信眼中的世界；“自我拉扯”分析自己是如何回忆和感知自己的世界；半期后想完善下“自恋理论”来分析自己的爱与被爱。 如果论 16 岁这一年的收获，当然最重要的是与他人的爱，去学如何更好的爱他人，这里就留到以后的自恋理论再来讲吧。 还收获了六个人的感情，不久前送的徽章（ＩＬＭＣＡＹ）。收获了对一些爱的认知，当初多少的纠结，像是种的花现在仍没有发芽。 但发现挖去想留在自恋理论去讲的事情，也就没剩下什么了也好，毕竟自己在前一阵子都是怕到了最后变成爱自己，而在学了弗洛姆之后反倒释怀了。 工藤的十七岁。语尽。","tags":[]},{"title":"光年外自我拉扯","date":"2012-03-25T01:55:00.000Z","path":"2012/03/25/light-year/","text":"前几天发现 自己总是到了某处地方 然后总是去想念以前的模样 去过的地方它搬家了不在被拆了 心里空荡一下 和别人或一个人在某处散步会想起上次一起的又是谁 过去的某个位子放置了什么东西却还是因为定语是过去的而发生演变 渐渐的能记起更长一段时间里的记忆 慢慢推移成几周前 半年前 去年暑假 乃至几年前 记忆会像蚕一样包裹吞噬当时的心情 自己却无法抽丝剥茧的迷 慢慢长大 记忆越来越长 现实与记忆纠结 变成无可救药的自恋 现实里揣测人心多变 轻视那些尔虞我诈的计谋 担心某人会出事会改变 阴谋与诡计 华丽的面具 却只剩我一个人念叨当初你说过要还我一个单纯的你 对有些人不设防 是足够相信 终有一天距离变大破坏爱 免不了变成痛与恨的牢笼 在学从细节处看别人的倾向 结果更多的是负面的受伤 殊不知在观察的过程中 自己变成了那种察言观色用心与别人博弈更痛苦更难受却还是自己讨厌的那种人 现实的痛楚会因回忆的过于美好而形成正反馈调节 想办法努力寻找现实与记忆的平衡点 当初到期的承诺会在记忆中永远 当初的支言片语 当初的照片与录影 当初给的信里的字与句 愈发的感觉记忆的美好 可心理学却告诉我自己是将不连贯的信息整合起来重构自己的过去 最后通常是爱自己 美国作家保罗 泰鲁说”旅行只有在回味时才是迷人的” 自我内心的整合 记忆里味道 眼神 拥抱 泪水 笑容 和你一起吃的 在一起的时间 走过的路 消磨过的时光 我是要死心塌地的找回你 还是微笑后坚定的转身 从此变得聪明 说周朴园不爱鲁四萍不爱梅四萍 爱的是三十年间的他自己他做的这些重构了他自己的记忆 也只是为了爱他自己 成长和我们所有的人都撒了谎 记忆与现实的煎熬 我努力想蜕变 拔不出这片沼泽 就像是要到了夏天 当初的汗水 慢慢的在阳光下蒸发 透过最后的那么一点点的光 留在现实抓不住的游丝 却已经以最大速度远离我 一光年 长大以后还会遇到的 再长大一点 长得足够大 直到记忆叠加成整个生命的长度吧","tags":[]},{"title":"像不变星空陪着我","date":"2011-12-31T15:39:00.000Z","path":"2011/12/31/star-company/","text":"在青春的旅程中，总有关于成长的苦涩与生命的不完美，但紧要的是我们如何拥抱着这样的遗憾，继续走向遥远且未知的未来。 在 2011 年末，用林书宇的话作开头纪念 2011 年吧，这一年里，那些或黯淡或璀璨，却照亮了我高中三年的一半边星空。 &gt;&gt;&gt;新年里录了好多个”2011”，却永远也不会播出来的一句话算是变成对后来的日子里的一种讽刺；我在 2010 年遇见了十一班，一起度过了二零一一年的一半，后来我们变成了九班，提前结束了那句话。[在这里能不能最后让我说一次，憋了四个月的话，能不能最后让我还能说声：【二零一一，爱你十一。】]我也会记得高一下学期里发生的故事，篮球赛；变声器&amp;裙子的《明天会更好》；文理分科。 &gt;&gt;&gt;美丽的假期，图书馆；社会实践；七夕情人节；生日怕踢。 &gt;&gt;&gt;一年一度的运动会，高新不再那么冷清+苦逼了；某人飞了欧罗巴而我们去了立志成才；12.21 世界末日前一周年，教育的不公和畸形，学生的无知和愚昧，以及另一些学生的勇敢和理智。 2011 年的暑假，花了好长一段时间去收获一段很美好的回忆，夏日里火烧的天空映得苍穹下都是朦胧的像洒了金粉的艳丽玫瑰，当然她还没找到她的小王子；吃班戳或咖啡馆里走很远后的休息，即使被放了无数次鸽子也还一直相信着，就像给你贺卡里写的：如果互相看不见的话，一万公里和一转身的距离并没有什么不同了。 就算隔了一万公里的星空，其实我们一转身就能看见对方的，对吧。而你给的贺卡里写着 “躲在夏天的街角 你还等着我吗 雪糕被太阳吃掉 流汗的脸颊 我踮脚在你耳边 说 快点长大 长大 保护我吧”。好吧虽然这是歌词，其实觉得挺像的。【今天你开门进来的时候，还是会有一刻的错觉，还很好奇你当时的心情~】 12 月 14 日，陪你去看流星雨，落在这地球上~现在的流星雨，我又陪着谁看？谁的流星雨又落在谁的梦里。就像是遇不到我那一百五十颗中的一个，就算那些流星是”一次的擦肩而过可能就再也见不到了(M15)”，就算怀着无比饥渴(…)的心情望着没有流星的天空，空许下的好多不切实际的梦想，都空说给了这一夜的星空。 都要 2012 了，马上又是寒假~虽然研究性学习小组多半崩盘，可一想到又可以荒 X 的度过真是惬意。 2010 年到 2012 年，我们经历了好多事情，都可以用年岁来度量了，这其中的时间之差，又是多少个日日夜夜的星空。 我出生的那一年的时间，就意味着我不曾经历那之前之后的一百年，比如我初三的化学笔记本用到高一的时间跨度，比如放在窗边晒了一整个暑假的塑料罐褪了色，比如不久前想起去年十二月半下的雪和现在与那时不同的心情，落得最后我在时空坐标系中有着不同的位置，可坐标不同的点终究是不同的点啊，那到底，时差下的我，还是真的我么。 后来某一天，要去找高一还用的那个化学笔记本的时候，翻箱倒柜发现不见了，明明当初一直都在的啊，被一堆书压得怎么也不会掉的啊。说不定它像挂在我耳边的一个耳塞，和我失去了某些联系，掉了下来。 在看过多少个星空后，在最后一天我想说：如果你只是碰巧出现在这一时空坐标的一瞬 ，那我愿用一生等待下一次的重逢。 我重来没有后悔过来高新。不是简单的随遇而安。我在这里遇见了不忘的十一班，现在的九班。〖九霄揽月，坚持无懈〗 2011 年初的除夕，算是高中入学以来第一次和后来很好的朋友聊天，当时又怎么知道，后来会是一起在 2011 年最后一天的午饭里吃得好饱，五个人一起拥有下简单的幸福感中的那一个。那个除夕夜里我会记得你放的烟花，还有在那里我看到的无限晴朗的星空。 就算人不能两次踏入同一条河，就算无论这条河还是这个人都已经不同了。就算 2012 Is Loading…████████████████▓ 99.95%，就算 2011 年里发生了很多不开心的，永远会回忆的，爱着的，我还不想说要和它们马上再见。因为我永远会记得，哪一年里，有着最灿烂、最寂寞的星空。至少回忆会永久，像不变星空陪着我。","tags":[]},{"title":"转头一切成苍茫","date":"2011-10-29T00:08:00.000Z","path":"2011/10/29/boundless-youth/","text":"楼顶校服花裤衩，橘子汽水破吉他。在 安 讲到的据传数万网友落泪的《老男孩》里，看见了太多的关于青春、梦想还有回忆。还有太多湮没在世俗的曾经有着梦想的人。有过为卑微的梦想奋斗，却只能最后卑微的活着。反而影片最后说到： 梦想这东西 和经典一样，永远不会因为时间而褪色 反而更显珍贵。 多年后被问到：当初的愿望实现了吗？ 恐怕只有笑着回答：事到如今只好祭奠吧。 老男孩感动我的地方在于写出了多少人对梦想变成现实，幻想破灭后的无奈，他们要么失去了梦想，要么改变了梦想，为的是不再是当初的真心而哀叹。当然还有它的最后一句。至于梦想，人生且短暂且漫长，对于我们来说，十几岁的年纪，即便遇到挫折，也希望可以把它当做一个分号，而不是句号，能够继续带着梦想走下去。就算在年纪渐长后终于放弃了小时候坚持的东西，但想起曾经有过的坚持与付出的代价，也是一份不错的回忆了。 不久前的寄语是： 生而为人。 对不起。 其实一篇小说里提到的。却又被认为消极了，其实每个人的理解都不一样，每个人活着，难免的是在别人的生活里充当着一定的角色，要么小丑，要么主角，一定成分的参与别人的生活，却不管怎样还是也应该忠诚地面对自己的心。至于那个对不起，解释起来还真是对不起了。那就去那里吧，走上别人指引的路，不论是多么离奇的相遇。 未来在哪里平凡。 越长越大，其实越会顾后果。 自己以前跟人家吵架，跟别人交谈，其实在成长中反而会学得把情绪越放越少，越来越不要那么爱一个人，越来越不要得罪一个人，怕到了以后回想那个时期却又会觉得有点怀念又很痛苦，怀念是觉得那时候很自由，痛苦是觉得那时候怎么会做错这么多事。 那时陪伴我的人哪，你们如今在何方。 总是说少了人，变了一些东西，新认识了些还算很不错的人。记得曾经在开学时有过第一次如此想念一个人的感觉，第二节整节晚自习都荒唐，哽咽到不行，还记得当时的感受是 就在不远处的一个教室里，有个很爱的人，她遇见了更多的人，发生了一些你不知道的事，过着几乎完全不一样的生活，直到后来，偏偏风渐渐 把距离吹的好远。 身边的朋友，都会尽力珍惜的，即使某一天会不爽的写了随笔《时光机》，可自己终究是知道的，终于要学会不去像阿信说的那样 “我愿意付出所有来换一个时光机，再一次我就不会走向这样的结局。”因为谁也不清楚谁又能预测，下一次的步骤与结局，人生充满了太多的不确定性和不可逆性，每一个不小心，就引发了无数个平行世界，生活在了不同的时空。那我其实应该高兴的是走到现在，我还能遇见一些人，没有忘记一些人。 还记得 安 当时最后点的语气，我们还正是志在四方少年 …… 如果有明天，祝福你 亲爱的。 如果有明天，老男孩应该是一首属于还没有到明天的歌吧。其实那就让我们变成老男孩、老女孩之前，还能知道如何才能 爱过这一场。 老男孩的青春。红砖墙，泥瓦当。上学铃声催的慌，转头一切成苍茫。","tags":[]},{"title":"却是因为爱太轻","date":"2011-08-29T12:21:00.000Z","path":"2011/08/29/never-said-i-love-u/","text":"怎么你们开头都是说暑假好多天好多天了 好吧我也说暑假倒数第二天 算是高一作结 懒得从去年算起我们经历了多少 可以直接知道的是一年了 记得半年前是情人节那天开学 然后就在考完试的下着大雨的返校日算作停止 二月开始 七月初止 就是高一下学期 辩论赛 合唱 篮球赛 大概就这几件大事 当时经历着那些啊 有揪心的 高兴的 失败的 一起努力的 不会放弃 对于今天的自己来说 明明当初只是一件微不足道的事情 现在来看 就当是美好的回忆吧 【我和 Apple 的曲目：如果我变成回忆…】 慢慢的凭借半年的相识 交了一些很好的朋友 一天到晚嬉皮打闹 互开玩笑 【加强语气：】互相洗脑！ 开学不久后离开了的 Alex 下学期还会去找泽泽 下半学期开始很好的安安和歌歌 经常被 Sky 八卦【或一起八卦…】 然后借助语录和 Ismus 一起传传绯闻~ 做操过后和 Cavalier 去买零食上课吃 晚饭后买的牛奶提防着几个人要抢 还记得 531 三个人和 Cavalier 坐在一张床上 535 公然挑衅 531 考试前最後一个周末的托管 日子也就这样慢慢过 然后突然就期末考试了 考试晚自习时 Tamara 聊两节课 考完试后的毫无鸭梨啊 还记得返校日那天特别大的雨 评讲卷子那几天看的电影 文理分科 准备回家清空了课桌 柜子 寝室 到了暑假 现在可以平淡的谈起文理分科了 不像刚开始时的不适应 甚至厌恶 就像欢仔那天红了的双眼 我终于能慢慢接受 我们的距离变大了点这个事实 我会爱着你给我的兔子 好多个哆啦 返校前去欢乐谷的两个人的摩天轮 一起吃的班戳 良木缘咖啡 怕踢那天两个人情侣衫的合影 你唱给我的”左上角的心跳” 安东尼说：我想我唯一能做的 就是 继承那些 你拥有的 让我着迷的品质 好好地生活下去 放了假的两个月生活比较冗杂 一直想旅游而没有动身 却在一个城市里到处走也算是满足一下自己的陌生感 其中不乏一个人的行动 多的是几个人的活动 有去过十多次的地方 也有故地重游与旧友的相聚 路程跨过十多公里 公交卡刷了近百次 时间是两个月 欢乐谷 新城市广场 成都七中高新校区 交大 西门车站 高升桥 石室中学 市图书馆 陕西街 天府广场 浆洗街 春熙路群光广场 孙中山广场 金沙车站 新城市广场 万达广场 亚太广场 棕北 沃尔玛 紫荆 家乐福 血液中心 春熙路北新街 科华 省体 红瓦寺街 成都七中 磨子桥 太升南路 军区总医院 小天东街 棕北 万达广场 在不断变化着的城市中清晰地肯定着自身的存在 两个月中不幸的在下组织了四次活动 第一次八个人变四个人 第二次完全失败 跑去耍了 后两次还算成功吧 都是十多个人的活动 最後一次的另一位组织者竟然把摊子甩给在下了 极度怨念中 =。= 这个暑假见得最多的是歌歌和泽泽 这两个就没怎么水的 【经常被水的人再次怨念中】 苧也经常水我 Rich 是好银啊 Apple 和花花去 shi 吧！ 初中同学的大的聚会倒没有 也只有三四个人出来耍下 兔子那天生了气的聚会 Jin 和竹子吓死人的见面 =。=/// 同学会什麽的 在下知道是喊不了多少人的 然后就桑心了 马上就要开学了 我是准高【级】二【货】的学生了 话说一想到可能有新同学 楚门可高兴啊 因为新同学多半坐他那组 而且多半是他前面 然后就可以近水楼台了 【如果是个男的也让他近水楼台吧…】 不久前得知 十一班将因学校调整班序的原因 变成九班 各种的不爽！ 谢老却只有说让我们慢慢适应 当时爆粗的心都有了 如果这样的话 好多东西都要改的 当初一直喊的：十一十一 勇争第一 十一十一 王者无敌！ 群名：十一楼 我倒希望这个不改… 十一语录 话说坚决不要九班语录这个名字 只是 我们的习惯 多久才能改变 Queen 说：名字虽然只是个代号 但十一是只属于我们的代号 缺席一个人 被换了班序 慢慢变了质 就像最开头说的 换班序这种的事情 即使对现在的自己来说 就像世界都改变了一样 那就在遇见世界末日的绿色海水之前 让十一班成为美好的回忆 2011 年 8 月 29 日 20：21 去年的这个时刻 我们应该在做自我介绍了吧 ——“你好 十一班” ——“再见 十一班”。","tags":[]},{"title":"一样的夏了夏天","date":"2011-06-12T04:05:41.000Z","path":"2011/06/12/summer-the-summer/","text":"你说夏天是个充满主观色彩的季节 夏天的冰淇淋 夏天的西瓜 夏天的蒲扇 夏天的游泳池 夏天的短袖 夏困 夏天的浓荫 夏天的暖风 夏天的暴雨 夏天的歌和夏天的遇见 夏天的蚊虫 夏天的烈日 夏天的温度 夏天的汗水 夏天的口渴 夏天的浮躁 以及夏天的离别 好多时候你喜欢的东西远比不喜欢的多 为什么还是会心生厌倦 你承认很多是取加权平均 就像感觉一样 中考便在一年前的夏天 你对未来的未知与茫然 而产生的恐惧令你陷进那个 40 多度的夏天里 你以后还会和谁一直联系 你以后怎样听到以前的朋友跟你说 好久不见 你为什么还会笑 你以后会住在哪里 你以后会坐哪路车 看哪里的风景 你以后会遇见谁 你以后结交了怎样的朋友 你们有着怎样的故事 未知的总是你那个时候不想去想的 也是因为你知道会慢慢走到时光的深处 在那个领到录取通知书的夏天所以然后你们就毕业了 升入高一与现在的同学的遇见也发生在夏天 遇见是最美好的事了 每天和走的很近的朋友一起活动 其他的朋友也能够很开心的谈论 你也不会觉得有什么可惜的呢 在一起开心就好了 经历了半年的时间 你终于明白是回不去了 要把握的是今天和明天 在离夏天最远的地方 一年光阴让人发现 除了记忆外 什麽也不能永远 其实你不怎么喜欢夏天 但好像所有不舍的离别 美好的遇见 都发生在无论谁夏了的夏天","tags":[]}]